cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
/**
  * @brief JPEG Codec
  */
typedef struct
{
  __IO uint32_t CONFR0;          /*!< JPEG Codec Control Register (JPEG_CONFR0),        Address offset: 00h       */
  __IO uint32_t CONFR1;          /*!< JPEG Codec Control Register (JPEG_CONFR1),        Address offset: 04h       */
  __IO uint32_t CONFR2;          /*!< JPEG Codec Control Register (JPEG_CONFR2),        Address offset: 08h       */
  __IO uint32_t CONFR3;          /*!< JPEG Codec Control Register (JPEG_CONFR3),        Address offset: 0Ch       */ 
  __IO uint32_t CONFR4;          /*!< JPEG Codec Control Register (JPEG_CONFR4),        Address offset: 10h       */ 
  __IO uint32_t CONFR5;          /*!< JPEG Codec Control Register (JPEG_CONFR5),        Address offset: 14h       */ 
  __IO uint32_t CONFR6;          /*!< JPEG Codec Control Register (JPEG_CONFR6),        Address offset: 18h       */ 
  __IO uint32_t CONFR7;          /*!< JPEG Codec Control Register (JPEG_CONFR7),        Address offset: 1Ch       */
  uint32_t  Reserved20[4];       /* Reserved                                            Address offset: 20h-2Ch   */
  __IO uint32_t CR;              /*!< JPEG Control Register (JPEG_CR),                  Address offset: 30h       */ 
  __IO uint32_t SR;              /*!< JPEG Status Register (JPEG_SR),                   Address offset: 34h       */ 
  __IO uint32_t CFR;             /*!< JPEG Clear Flag Register (JPEG_CFR),              Address offset: 38h       */ 
  uint32_t  Reserved3c;          /* Reserved                                            Address offset: 3Ch       */
  __IO uint32_t DIR;             /*!< JPEG Data Input Register (JPEG_DIR),              Address offset: 40h       */
  __IO uint32_t DOR;             /*!< JPEG Data Output Register (JPEG_DOR),             Address offset: 44h       */
  uint32_t  Reserved48[2];       /* Reserved                                            Address offset: 48h-4Ch   */
  __IO uint32_t QMEM0[16];       /*!< JPEG quantization tables 0,                       Address offset: 50h-8Ch   */
  __IO uint32_t QMEM1[16];       /*!< JPEG quantization tables 1,                       Address offset: 90h-CCh   */
  __IO uint32_t QMEM2[16];       /*!< JPEG quantization tables 2,                       Address offset: D0h-10Ch  */
  __IO uint32_t QMEM3[16];       /*!< JPEG quantization tables 3,                       Address offset: 110h-14Ch */
  __IO uint32_t HUFFMIN[16];     /*!< JPEG HuffMin tables,                              Address offset: 150h-18Ch */
  __IO uint32_t HUFFBASE[32];    /*!< JPEG HuffSymb tables,                             Address offset: 190h-20Ch */
  __IO uint32_t HUFFSYMB[84];    /*!< JPEG HUFFSYMB tables,                             Address offset: 210h-35Ch */
  __IO uint32_t DHTMEM[103];     /*!< JPEG DHTMem tables,                               Address offset: 360h-4F8h */
  uint32_t  Reserved4FC;         /* Reserved                                            Address offset: 4FCh      */
  __IO uint32_t HUFFENC_AC0[88]; /*!< JPEG encodor, AC Huffman table 0,                 Address offset: 500h-65Ch */
  __IO uint32_t HUFFENC_AC1[88]; /*!< JPEG encodor, AC Huffman table 1,                 Address offset: 660h-7BCh */
  __IO uint32_t HUFFENC_DC0[8];  /*!< JPEG encodor, DC Huffman table 0,                 Address offset: 7C0h-7DCh */
  __IO uint32_t HUFFENC_DC1[8];  /*!< JPEG encodor, DC Huffman table 1,                 Address offset: 7E0h-7FCh */

} JPEG_TypeDef;


/**
  * @brief LCD
  */

typedef struct
{
  __IO uint32_t CR;        /*!< LCD control register,              Address offset: 0x00 */
  __IO uint32_t FCR;       /*!< LCD frame control register,        Address offset: 0x04 */
  __IO uint32_t SR;        /*!< LCD status register,               Address offset: 0x08 */
  __IO uint32_t CLR;       /*!< LCD clear register,                Address offset: 0x0C */
  uint32_t RESERVED;       /*!< Reserved,                          Address offset: 0x10 */
  __IO uint32_t RAM[16];   /*!< LCD display memory,           Address offset: 0x14-0x50 */
} LCD_TypeDef;

/** 
  * @brief LCD-TFT Display Controller
  */

typedef struct
{
  uint32_t      RESERVED0[2];  /*!< Reserved, 0x00-0x04 */
  __IO uint32_t SSCR;          /*!< LTDC Synchronization Size Configuration Register,    Address offset: 0x08 */
  __IO uint32_t BPCR;          /*!< LTDC Back Porch Configuration Register,              Address offset: 0x0C */
  __IO uint32_t AWCR;          /*!< LTDC Active Width Configuration Register,            Address offset: 0x10 */
  __IO uint32_t TWCR;          /*!< LTDC Total Width Configuration Register,             Address offset: 0x14 */
  __IO uint32_t GCR;           /*!< LTDC Global Control Register,                        Address offset: 0x18 */
  uint32_t      RESERVED1[2];  /*!< Reserved, 0x1C-0x20 */
  __IO uint32_t SRCR;          /*!< LTDC Shadow Reload Configuration Register,           Address offset: 0x24 */
  uint32_t      RESERVED2[1];  /*!< Reserved, 0x28 */
  __IO uint32_t BCCR;          /*!< LTDC Background Color Configuration Register,        Address offset: 0x2C */
  uint32_t      RESERVED3[1];  /*!< Reserved, 0x30 */
  __IO uint32_t IER;           /*!< LTDC Interrupt Enable Register,                      Address offset: 0x34 */
  __IO uint32_t ISR;           /*!< LTDC Interrupt Status Register,                      Address offset: 0x38 */
  __IO uint32_t ICR;           /*!< LTDC Interrupt Clear Register,                       Address offset: 0x3C */
  __IO uint32_t LIPCR;         /*!< LTDC Line Interrupt Position Configuration Register, Address offset: 0x40 */
  __IO uint32_t CPSR;          /*!< LTDC Current Position Status Register,               Address offset: 0x44 */
  __IO uint32_t CDSR;         /*!< LTDC Current Display Status Register,                       Address offset: 0x48 */
} LTDC_TypeDef;  

/**
  * @brief LCD-TFT Display layer x Controller
  */
  
typedef struct
{  
  __IO uint32_t CR;            /*!< LTDC Layerx Control Register                                  Address offset: 0x84 */
  __IO uint32_t WHPCR;         /*!< LTDC Layerx Window Horizontal Position Configuration Register Address offset: 0x88 */
  __IO uint32_t WVPCR;         /*!< LTDC Layerx Window Vertical Position Configuration Register   Address offset: 0x8C */
  __IO uint32_t CKCR;          /*!< LTDC Layerx Color Keying Configuration Register               Address offset: 0x90 */
  __IO uint32_t PFCR;          /*!< LTDC Layerx Pixel Format Configuration Register               Address offset: 0x94 */
  __IO uint32_t CACR;          /*!< LTDC Layerx Constant Alpha Configuration Register             Address offset: 0x98 */
  __IO uint32_t DCCR;          /*!< LTDC Layerx Default Color Configuration Register              Address offset: 0x9C */
  __IO uint32_t BFCR;          /*!< LTDC Layerx Blending Factors Configuration Register           Address offset: 0xA0 */
  uint32_t      RESERVED0[2];  /*!< Reserved */
  __IO uint32_t CFBAR;         /*!< LTDC Layerx Color Frame Buffer Address Register               Address offset: 0xAC */
  __IO uint32_t CFBLR;         /*!< LTDC Layerx Color Frame Buffer Length Register                Address offset: 0xB0 */
  __IO uint32_t CFBLNR;        /*!< LTDC Layerx ColorFrame Buffer Line Number Register            Address offset: 0xB4 */
  uint32_t      RESERVED1[3];  /*!< Reserved */
  __IO uint32_t CLUTWR;         /*!< LTDC Layerx CLUT Write Register                               Address offset: 0x144 */

} LTDC_Layer_TypeDef;

/**
  * @brief Firewall
  */

typedef struct
{
  __IO uint32_t CSSA;     /*!< Code Segment Start Address register,              Address offset: 0x00 */
  __IO uint32_t CSL;      /*!< Code Segment Length register,                      Address offset: 0x04 */
  __IO uint32_t NVDSSA;   /*!< NON volatile data Segment Start Address register,  Address offset: 0x08 */
  __IO uint32_t NVDSL;    /*!< NON volatile data Segment Length register,         Address offset: 0x0C */
  __IO uint32_t VDSSA ;   /*!< Volatile data Segment Start Address register,      Address offset: 0x10 */
  __IO uint32_t VDSL ;    /*!< Volatile data Segment Length register,             Address offset: 0x14 */
  __IO uint32_t CR ;      /*!< Configuration  register,                           Address offset: 0x20 */

} FIREWALL_TypeDef;




/**
  * @brief Power Control
  */

typedef struct
{
  __IO uint32_t CR1;   /*!< PWR power control register 1,        Address offset: 0x00 */
  __IO uint32_t CR2;   /*!< PWR power control register 2,        Address offset: 0x04 */
  __IO uint32_t CR3;   /*!< PWR power control register 3,        Address offset: 0x08 */
  __IO uint32_t CR4;   /*!< PWR power control register 4,        Address offset: 0x0C */
  __IO uint32_t SR1;   /*!< PWR power status register 1,         Address offset: 0x10 */
  __IO uint32_t SR2;   /*!< PWR power status register 2,         Address offset: 0x14 */
  __IO uint32_t SCR;   /*!< PWR power status reset register,     Address offset: 0x18 */
    uint32_t RESERVED;       /*!< Reserved,                      Address offset: 0x1C */
  __IO uint32_t PUCRA; /*!< Pull_up control register of portA,   Address offset: 0x20 */
  __IO uint32_t PDCRA; /*!< Pull_Down control register of portA, Address offset: 0x24 */
  __IO uint32_t PUCRB; /*!< Pull_up control register of portB,   Address offset: 0x28 */
  __IO uint32_t PDCRB; /*!< Pull_Down control register of portB, Address offset: 0x2C */
  __IO uint32_t PUCRC; /*!< Pull_up control register of portC,   Address offset: 0x30 */
  __IO uint32_t PDCRC; /*!< Pull_Down control register of portC, Address offset: 0x34 */
  __IO uint32_t PUCRD; /*!< Pull_up control register of portD,   Address offset: 0x38 */
  __IO uint32_t PDCRD; /*!< Pull_Down control register of portD, Address offset: 0x3C */
  __IO uint32_t PUCRE; /*!< Pull_up control register of portE,   Address offset: 0x40 */
  __IO uint32_t PDCRE; /*!< Pull_Down control register of portE, Address offset: 0x44 */
  __IO uint32_t PUCRF; /*!< Pull_up control register of portF,   Address offset: 0x48 */
  __IO uint32_t PDCRF; /*!< Pull_Down control register of portF, Address offset: 0x4C */
  __IO uint32_t PUCRG; /*!< Pull_up control register of portG,   Address offset: 0x50 */
  __IO uint32_t PDCRG; /*!< Pull_Down control register of portG, Address offset: 0x54 */
  __IO uint32_t PUCRH; /*!< Pull_up control register of portH,   Address offset: 0x58 */
  __IO uint32_t PDCRH; /*!< Pull_Down control register of portH, Address offset: 0x5C */

} PWR_TypeDef;

/**
  * @brief Reset and Clock Control
  */

typedef struct
{
  __IO uint32_t CR;             /*!< RCC clock control register,                                              Address offset: 0x00 */
  __IO uint32_t ICSCR;          /*!< RCC Internal Clock Sources Calibration Register,                         Address offset: 0x04 */
  __IO uint32_t CRRCR;          /*!< Clock Recovery RC  Register,                                             Address offset: 0x08 */
	 uint32_t     RESERVED0;      /*!< Reserved,                                                                Address offset: 0x0C */
  __IO uint32_t CFGR;           /*!< RCC clock configuration register,                                        Address offset: 0x10 */
	 uint32_t     RESERVED1;      /*!< Reserved,                                                                Address offset: 0x14 */
  __IO uint32_t D1CFGR;         /*!< RCC Domain 1 configuration register,                                     Address offset: 0x18 */
  __IO uint32_t D2CFGR;         /*!< RCC Domain 2 configuration register,                                     Address offset: 0x1C */
  __IO uint32_t D3CFGR;         /*!< RCC Domain 3 configuration register,                                     Address offset: 0x20 */
	 uint32_t     RESERVED2;      /*!< Reserved,                                                                Address offset: 0x24 */
  __IO uint32_t PLLCKSELR;      /*!< RCC PLLs Clock Source Selection Register,                                Address offset: 0x28 */
  __IO uint32_t PLLCFGR;        /*!< RCC PLLs  Configuration Register,                                        Address offset: 0x2C */
  __IO uint32_t PLL1DIVR;       /*!< RCC PLL1 Dividers Configuration Register,                                Address offset: 0x30 */
  __IO uint32_t PLL1FRACR;      /*!< RCC PLL1 Fractional Divider Configuration Register,                      Address offset: 0x34 */
	__IO uint32_t PLL2DIVR;       /*!< RCC PLL2 Dividers Configuration Register,                                Address offset: 0x38 */
  __IO uint32_t PLL2FRACR;      /*!< RCC PLL2 Fractional Divider Configuration Register,                      Address offset: 0x3C */
	__IO uint32_t PLL3DIVR;       /*!< RCC PLL3 Dividers Configuration Register,                                Address offset: 0x40 */
  __IO uint32_t PLL3FRACR;      /*!< RCC PLL3 Fractional Divider Configuration Register,                      Address offset: 0x44 */
  uint32_t      RESERVED3;      /*!< Reserved,                                                                Address offset: 0x48 */
 __IO uint32_t  D1CCIPR;        /*!< RCC Domain 1 Kernel Clock Configuration Register                         Address offset: 0x4C */
 __IO uint32_t  D2CCIP1R;       /*!< RCC Domain 2 Kernel Clock Configuration Register                         Address offset: 0x50 */
 __IO uint32_t  D2CCIP2R;       /*!< RCC Domain 2 Kernel Clock Configuration Register                         Address offset: 0x54 */
 __IO uint32_t  D3CCIPR;        /*!< RCC Domain 3 Kernel Clock Configuration Register                         Address offset: 0x58 */
  uint32_t      RESERVED4;      /*!< Reserved,                                                                Address offset: 0x5C */	
 __IO uint32_t  CIER;           /*!< RCC Clock Source Interrupt Enable Register                               Address offset: 0x60 */	
 __IO uint32_t  CIFR;           /*!< RCC Clock Source Interrupt Flag Register                                 Address offset: 0x64 */
 __IO uint32_t  CICR;           /*!< RCC Clock Source Interrupt Clear Register                                Address offset: 0x68 */	
   uint32_t     RESERVED5;      /*!< Reserved,                                                                Address offset: 0x6C */
 __IO uint32_t  BDCR;           /*!< RCC Vswitch Backup Domain Control Register,                              Address offset: 0x70 */
 __IO uint32_t  CSR;            /*!< RCC clock control & status register,                                     Address offset: 0x74 */
	 uint32_t     RESERVED6;      /*!< Reserved,                                                                Address offset: 0x78 */
  __IO uint32_t D1AHB1RSTR;     /*!< RCC Domain 1 AHB1 peripheral reset register,                             Address offset: 0x7C */
  __IO uint32_t D2AHB1RSTR;     /*!< RCC Domain 2 AHB1 peripheral reset register,                             Address offset: 0x80 */
  __IO uint32_t D2AHB2RSTR;     /*!< RCC Domain 2 AHB2 peripheral reset register,                             Address offset: 0x84 */
  __IO uint32_t D3AHB1RSTR;     /*!< RCC Domain 3 AHB1 peripheral reset register,                             Address offset: 0x88 */
	__IO uint32_t D1APB1RSTR;     /*!< RCC Domain 1 APB1 peripheral reset register,                             Address offset: 0x8C */
	__IO uint32_t D2APB1LRSTR;    /*!< RCC Domain 2 APB1 peripheral reset Low Word register,                    Address offset: 0x90 */
	__IO uint32_t D2APB1HRSTR;    /*!< RCC Domain 2 APB1 peripheral reset High Word register,                   Address offset: 0x94 */
	__IO uint32_t D2APB2RSTR;     /*!< RCC Domain 2 APB2 peripheral reset register,                             Address offset: 0x98 */	
	__IO uint32_t D3APB1RSTR;     /*!< RCC Domain 3 APB1 peripheral reset register,                             Address offset: 0x9C */
   uint32_t     RESERVED7[2];   /*!< Reserved, 0xA0-0xA4                                                      Address offset: 0xA0 */ 
	__IO uint32_t D3AMR;          /*!< RCC Domain 3 Autonomous Mode Register,                                   Address offset: 0xA8 */
	 uint32_t     RESERVED8[9];   /*!< Reserved, 0xAC-0xCC                                                      Address offset: 0xAC */
  __IO uint32_t RSR;            /*!< RCC Reset status register,                                               Address offset: 0xD0 */	
  __IO uint32_t D1AHB1ENR;      /*!< RCC Domain 1 AHB1 peripheral clock  register,                            Address offset: 0xD4 */
  __IO uint32_t D2AHB1ENR;      /*!< RCC Domain 2 AHB1 peripheral clock  register,                            Address offset: 0xD8 */
  __IO uint32_t D2AHB2ENR;      /*!< RCC Domain 2 AHB2 peripheral clock  register,                            Address offset: 0xDC */
  __IO uint32_t D3AHB1ENR;      /*!< RCC Domain 3 AHB1 peripheral clock  register,                            Address offset: 0xE0 */
	__IO uint32_t D1APB1ENR;      /*!< RCC Domain 1 APB1 peripheral clock  register,                            Address offset: 0xE4 */
	__IO uint32_t D2APB1LENR;     /*!< RCC Domain 2 APB1 peripheral clock  Low Word register,                   Address offset: 0xE8 */
	__IO uint32_t D2APB1HENR;     /*!< RCC Domain 2 APB1 peripheral clock  High Word register,                  Address offset: 0xEC */
	__IO uint32_t D2APB2ENR;      /*!< RCC Domain 2 APB2 peripheral clock  register,                            Address offset: 0xF0 */	
	__IO uint32_t D3APB1ENR;      /*!< RCC Domain 3 APB1 peripheral clock  register,                            Address offset: 0xF4 */	
  uint32_t      RESERVED9;      /*!< Reserved,                                                                Address offset: 0xF8 */
  __IO uint32_t D1AHB1SMENR;    /*!< RCC Domain 1 AHB1 peripheral sleep clock  register,                      Address offset: 0xFC */
  __IO uint32_t D2AHB1SMENR;    /*!< RCC Domain 2 AHB1 peripheral sleep clock  register,                      Address offset: 0x100 */
  __IO uint32_t D2AHB2SMENR;    /*!< RCC Domain 2 AHB2 peripheral sleep clock  register,                      Address offset: 0x104 */
  __IO uint32_t D3AHB1SMENR;    /*!< RCC Domain 3 AHB1 peripheral sleep clock  register,                      Address offset: 0x108 */
	__IO uint32_t D1APB1SMENR;    /*!< RCC Domain 1 APB1 peripheral sleep clock  register,                      Address offset: 0x10C */
	__IO uint32_t D2APB1LSMENR;   /*!< RCC Domain 2 APB1 peripheral sleep clock  Low Word register,             Address offset: 0x110 */
	__IO uint32_t D2APB1HSMENR;   /*!< RCC Domain 2 APB1 peripheral sleep clock  High Word register,            Address offset: 0x114 */
	__IO uint32_t D2APB2SMENR;    /*!< RCC Domain 2 APB2 peripheral sleep clock  register,                      Address offset: 0x118 */	
	__IO uint32_t D3APB1SMENR;    /*!< RCC Domain 3 APB1 peripheral sleep clock  register,                      Address offset: 0x11C */
	 uint32_t     RESERVED10[4];   /*!< Reserved, 0x120-0x12C                                                   Address offset: 0x120*/
	
} RCC_TypeDef;

typedef struct
{
  __IO uint32_t RSR;            /*!< RCC Reset status register,                                               Address offset: 0x00 */	
  __IO uint32_t D1AHB1ENR;      /*!< RCC Domain 1 AHB1 peripheral clock  register,                            Address offset: 0x04 */
  __IO uint32_t D2AHB1ENR;      /*!< RCC Domain 2 AHB1 peripheral clock  register,                            Address offset: 0x08 */
  __IO uint32_t D2AHB2ENR;      /*!< RCC Domain 2 AHB2 peripheral clock  register,                            Address offset: 0x0C */
  __IO uint32_t D3AHB1ENR;      /*!< RCC Domain 3 AHB1 peripheral clock  register,                            Address offset: 0x10 */
	__IO uint32_t D1APB1ENR;      /*!< RCC Domain 1 APB1 peripheral clock  register,                            Address offset: 0x14 */
	__IO uint32_t D2APB1LENR;     /*!< RCC Domain 2 APB1 peripheral clock  Low Word register,                   Address offset: 0x18 */
	__IO uint32_t D2APB1HENR;     /*!< RCC Domain 2 APB1 peripheral clock  High Word register,                  Address offset: 0x1C */
	__IO uint32_t D2APB2ENR;      /*!< RCC Domain 2 APB2 peripheral clock  register,                            Address offset: 0x20 */	
	__IO uint32_t D3APB1ENR;      /*!< RCC Domain 3 APB1 peripheral clock  register,                            Address offset: 0x24 */	
  uint32_t      RESERVED9;      /*!< Reserved,                                                                Address offset: 0x28 */
  __IO uint32_t D1AHB1SMENR;    /*!< RCC Domain 1 AHB1 peripheral sleep clock  register,                      Address offset: 0x3C */
  __IO uint32_t D2AHB1SMENR;    /*!< RCC Domain 2 AHB1 peripheral sleep clock  register,                      Address offset: 0x40 */
  __IO uint32_t D2AHB2SMENR;    /*!< RCC Domain 2 AHB2 peripheral sleep clock  register,                      Address offset: 0x44 */
  __IO uint32_t D3AHB1SMENR;    /*!< RCC Domain 3 AHB1 peripheral sleep clock  register,                      Address offset: 0x48 */
	__IO uint32_t D1APB1SMENR;    /*!< RCC Domain 1 APB1 peripheral sleep clock  register,                      Address offset: 0x4C */
	__IO uint32_t D2APB1LSMENR;   /*!< RCC Domain 2 APB1 peripheral sleep clock  Low Word register,             Address offset: 0x50 */
	__IO uint32_t D2APB1HSMENR;   /*!< RCC Domain 2 APB1 peripheral sleep clock  High Word register,            Address offset: 0x54 */
	__IO uint32_t D2APB2SMENR;    /*!< RCC Domain 2 APB2 peripheral sleep clock  register,                      Address offset: 0x58 */	
	__IO uint32_t D3APB1SMENR;    /*!< RCC Domain 3 APB1 peripheral sleep clock  register,                      Address offset: 0x5C */
	 uint32_t     RESERVED10[4];   /*!< Reserved, 0x60-0x6C                                                     Address offset: 0x60 */
	 
} RCC_Core_TypeDef;
/**
  * @brief Real-Time Clock
  */

