cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
#define USBOTG_BASE           (AHB2PERIPH_BASE + 0x08000000)
#define ADC1_BASE             (AHB2PERIPH_BASE + 0x08040000)
#define ADC2_BASE             (AHB2PERIPH_BASE + 0x08040100)
#define ADC123_BASE           (AHB2PERIPH_BASE + 0x08040300)

/*!< FMC Banks registers base  address */
#define FMC_Bank1_R_BASE      (FMC_R_BASE + 0x0000)
#define FMC_Bank1E_R_BASE     (FMC_R_BASE + 0x0104)
#define FMC_Bank2_R_BASE      (FMC_R_BASE + 0x0060)
#define FMC_Bank3_R_BASE      (FMC_R_BASE + 0x0080)
#define FMC_Bank5_6_R_BASE    (FMC_R_BASE + 0x0140)

/* Debug MCU registers base address */
#define DBGMCU_BASE           ((uint32_t )0xE0042000)

#define MDMA_Channel0_BASE    (MDMA_BASE + 0x00000040)
#define MDMA_Channel1_BASE    (MDMA_BASE + 0x00000080)
#define MDMA_Channel2_BASE    (MDMA_BASE + 0x000000C0)
#define MDMA_Channel3_BASE    (MDMA_BASE + 0x00000100)
#define MDMA_Channel4_BASE    (MDMA_BASE + 0x00000140)
#define MDMA_Channel5_BASE    (MDMA_BASE + 0x00000180)
#define MDMA_Channel6_BASE    (MDMA_BASE + 0x000001C0)
#define MDMA_Channel7_BASE    (MDMA_BASE + 0x00000200)
#define MDMA_Channel8_BASE    (MDMA_BASE + 0x00000240)
#define MDMA_Channel9_BASE    (MDMA_BASE + 0x00000280)
#define MDMA_Channel10_BASE   (MDMA_BASE + 0x000002C0)
#define MDMA_Channel11_BASE   (MDMA_BASE + 0x00000300)
#define MDMA_Channel12_BASE   (MDMA_BASE + 0x00000340)
#define MDMA_Channel13_BASE   (MDMA_BASE + 0x00000380)
#define MDMA_Channel14_BASE   (MDMA_BASE + 0x000003C0)
#define MDMA_Channel15_BASE   (MDMA_BASE + 0x00000400)
#define MDMA_Channel16_BASE   (MDMA_BASE + 0x00000440)
#define MDMA_Channel17_BASE   (MDMA_BASE + 0x00000480)
#define MDMA_Channel18_BASE   (MDMA_BASE + 0x000004C0)
#define MDMA_Channel19_BASE   (MDMA_BASE + 0x00000500)
#define MDMA_Channel20_BASE   (MDMA_BASE + 0x00000540)
#define MDMA_Channel20_BASE   (MDMA_BASE + 0x00000540)
#define MDMA_Channel21_BASE   (MDMA_BASE + 0x00000580)
#define MDMA_Channel22_BASE   (MDMA_BASE + 0x000005C0)
#define MDMA_Channel23_BASE   (MDMA_BASE + 0x00000600)
#define MDMA_Channel24_BASE   (MDMA_BASE + 0x00000640)
#define MDMA_Channel25_BASE   (MDMA_BASE + 0x00000680)
#define MDMA_Channel26_BASE   (MDMA_BASE + 0x000006C0)
#define MDMA_Channel27_BASE   (MDMA_BASE + 0x00000700)
#define MDMA_Channel28_BASE   (MDMA_BASE + 0x00000740)
#define MDMA_Channel29_BASE   (MDMA_BASE + 0x00000780)
#define MDMA_Channel30_BASE   (MDMA_BASE + 0x000007C0)
#define MDMA_Channel31_BASE   (MDMA_BASE + 0x00000800)
#define MDMA_Channel32_BASE   (MDMA_BASE + 0x00000840)
#define MDMA_Channel33_BASE   (MDMA_BASE + 0x00000880)
#define MDMA_Channel34_BASE   (MDMA_BASE + 0x000008C0)
#define MDMA_Channel35_BASE   (MDMA_BASE + 0x00000900)
#define MDMA_Channel36_BASE   (MDMA_BASE + 0x00000940)
#define MDMA_Channel37_BASE   (MDMA_BASE + 0x00000980)
#define MDMA_Channel38_BASE   (MDMA_BASE + 0x000009C0)
#define MDMA_Channel39_BASE   (MDMA_BASE + 0x00000A00)
#define MDMA_Channel40_BASE   (MDMA_BASE + 0x00000A40)
#define MDMA_Channel41_BASE   (MDMA_BASE + 0x00000A80)
#define MDMA_Channel42_BASE   (MDMA_BASE + 0x00000AC0)
#define MDMA_Channel43_BASE   (MDMA_BASE + 0x00000B00)
#define MDMA_Channel44_BASE   (MDMA_BASE + 0x00000B40)
#define MDMA_Channel45_BASE   (MDMA_BASE + 0x00000B80)
#define MDMA_Channel46_BASE   (MDMA_BASE + 0x00000BC0)
#define MDMA_Channel47_BASE   (MDMA_BASE + 0x00000C00)
#define MDMA_Channel48_BASE   (MDMA_BASE + 0x00000C40)
#define MDMA_Channel49_BASE   (MDMA_BASE + 0x00000C80)
#define MDMA_Channel50_BASE   (MDMA_BASE + 0x00000CC0)
#define MDMA_Channel51_BASE   (MDMA_BASE + 0x00000D00)
#define MDMA_Channel52_BASE   (MDMA_BASE + 0x00000D40)
#define MDMA_Channel53_BASE   (MDMA_BASE + 0x00000D80)
#define MDMA_Channel54_BASE   (MDMA_BASE + 0x00000DC0)
#define MDMA_Channel55_BASE   (MDMA_BASE + 0x00000E00)
#define MDMA_Channel56_BASE   (MDMA_BASE + 0x00000E40)
#define MDMA_Channel57_BASE   (MDMA_BASE + 0x00000E80)
#define MDMA_Channel58_BASE   (MDMA_BASE + 0x00000EC0)
#define MDMA_Channel59_BASE   (MDMA_BASE + 0x00000F00)
#define MDMA_Channel60_BASE   (MDMA_BASE + 0x00000F40)
#define MDMA_Channel61_BASE   (MDMA_BASE + 0x00000F80)
#define MDMA_Channel62_BASE   (MDMA_BASE + 0x00000FC0)

/**
  * @}
  */

/** @addtogroup Peripheral_declaration
  * @{
  */
#define TIM2                ((TIM_TypeDef *) TIM2_BASE)
#define TIM3                ((TIM_TypeDef *) TIM3_BASE)
#define TIM4                ((TIM_TypeDef *) TIM4_BASE)
#define TIM5                ((TIM_TypeDef *) TIM5_BASE)
#define TIM6                ((TIM_TypeDef *) TIM6_BASE)
#define TIM7                ((TIM_TypeDef *) TIM7_BASE)
#define LCD                 ((LCD_TypeDef *) LCD_BASE)
#define RTC                 ((RTC_TypeDef *) RTC_BASE)
#define WWDG1               ((WWDG_TypeDef *) WWDG1_BASE)
#define WWDG2               ((WWDG_TypeDef *) WWDG2_BASE)
#define IWDG1               ((IWDG_TypeDef *) IWDG1_BASE)
#define IWDG2               ((IWDG_TypeDef *) IWDG2_BASE)
#define SPI2                ((SPI_TypeDef *) SPI2_BASE)
#define SPI3                ((SPI_TypeDef *) SPI3_BASE)
#define USART2              ((USART_TypeDef *) USART2_BASE)
#define USART3              ((USART_TypeDef *) USART3_BASE)
#define USART6              ((USART_TypeDef *) USART6_BASE)
#define USART7              ((USART_TypeDef *) USART7_BASE)
#define USART8              ((USART_TypeDef *) USART8_BASE)
#define UART4               ((USART_TypeDef *) UART4_BASE)
#define UART5               ((USART_TypeDef *) UART5_BASE)
#define I2C1                ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                ((I2C_TypeDef *) I2C2_BASE)
#define I2C3                ((I2C_TypeDef *) I2C3_BASE)
#define I2C4                ((I2C_TypeDef *) I2C4_BASE)
#define CAN                 ((CAN_TypeDef *) CAN_BASE)
#define CEC                 ((CEC_TypeDef *) CEC_BASE)
#define LPTIM1              ((LPTIM_TypeDef *) LPTIM1_BASE)
#define PWR                 ((PWR_TypeDef *) PWR_BASE)
#define DAC1                ((DAC_TypeDef *) DAC1_BASE)
#define OPAMP1              ((OPAMP_TypeDef *) OPAMP_BASE)
#define LPUART1             ((USART_TypeDef *) LPUART1_BASE)
#define SWPMI1              ((SWPMI_TypeDef *) SWPMI1_BASE)
#define LPTIM2              ((LPTIM_TypeDef *) LPTIM2_BASE)

