cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
/********************  Bits definition for DMA_HISR register  *****************/ 
#define GPDMA2_HISR_TCIF7                       ((uint32_t)0x08000000)
#define GPDMA2_HISR_HTIF7                       ((uint32_t)0x04000000)
#define GPDMA2_HISR_TEIF7                       ((uint32_t)0x02000000)
#define GPDMA2_HISR_DMEIF7                      ((uint32_t)0x01000000)
#define GPDMA2_HISR_FEIF7                       ((uint32_t)0x00400000)
#define GPDMA2_HISR_TCIF6                       ((uint32_t)0x00200000)
#define GPDMA2_HISR_HTIF6                       ((uint32_t)0x00100000)
#define GPDMA2_HISR_TEIF6                       ((uint32_t)0x00080000)
#define GPDMA2_HISR_DMEIF6                      ((uint32_t)0x00040000)
#define GPDMA2_HISR_FEIF6                       ((uint32_t)0x00010000)
#define GPDMA2_HISR_TCIF5                       ((uint32_t)0x00000800)
#define GPDMA2_HISR_HTIF5                       ((uint32_t)0x00000400)
#define GPDMA2_HISR_TEIF5                       ((uint32_t)0x00000200)
#define GPDMA2_HISR_DMEIF5                      ((uint32_t)0x00000100)
#define GPDMA2_HISR_FEIF5                       ((uint32_t)0x00000040)
#define GPDMA2_HISR_TCIF4                       ((uint32_t)0x00000020)
#define GPDMA2_HISR_HTIF4                       ((uint32_t)0x00000010)
#define GPDMA2_HISR_TEIF4                       ((uint32_t)0x00000008)
#define GPDMA2_HISR_DMEIF4                      ((uint32_t)0x00000004)
#define GPDMA2_HISR_FEIF4                       ((uint32_t)0x00000001)

/********************  Bits definition for DMA_LIFCR register  ****************/ 
#define GPDMA2_LIFCR_CTCIF3                     ((uint32_t)0x08000000)
#define GPDMA2_LIFCR_CHTIF3                     ((uint32_t)0x04000000)
#define GPDMA2_LIFCR_CTEIF3                     ((uint32_t)0x02000000)
#define GPDMA2_LIFCR_CDMEIF3                    ((uint32_t)0x01000000)
#define GPDMA2_LIFCR_CFEIF3                     ((uint32_t)0x00400000)
#define GPDMA2_LIFCR_CTCIF2                     ((uint32_t)0x00200000)
#define GPDMA2_LIFCR_CHTIF2                     ((uint32_t)0x00100000)
#define GPDMA2_LIFCR_CTEIF2                     ((uint32_t)0x00080000)
#define GPDMA2_LIFCR_CDMEIF2                    ((uint32_t)0x00040000)
#define GPDMA2_LIFCR_CFEIF2                     ((uint32_t)0x00010000)
#define GPDMA2_LIFCR_CTCIF1                     ((uint32_t)0x00000800)
#define GPDMA2_LIFCR_CHTIF1                     ((uint32_t)0x00000400)
#define GPDMA2_LIFCR_CTEIF1                     ((uint32_t)0x00000200)
#define GPDMA2_LIFCR_CDMEIF1                    ((uint32_t)0x00000100)
#define GPDMA2_LIFCR_CFEIF1                     ((uint32_t)0x00000040)
#define GPDMA2_LIFCR_CTCIF0                     ((uint32_t)0x00000020)
#define GPDMA2_LIFCR_CHTIF0                     ((uint32_t)0x00000010)
#define GPDMA2_LIFCR_CTEIF0                     ((uint32_t)0x00000008)
#define GPDMA2_LIFCR_CDMEIF0                    ((uint32_t)0x00000004)
#define GPDMA2_LIFCR_CFEIF0                     ((uint32_t)0x00000001)

/********************  Bits definition for DMA_HIFCR  register  ****************/ 
#define GPDMA2_HIFCR_CTCIF7                     ((uint32_t)0x08000000)
#define GPDMA2_HIFCR_CHTIF7                     ((uint32_t)0x04000000)
#define GPDMA2_HIFCR_CTEIF7                     ((uint32_t)0x02000000)
#define GPDMA2_HIFCR_CDMEIF7                    ((uint32_t)0x01000000)
#define GPDMA2_HIFCR_CFEIF7                     ((uint32_t)0x00400000)
#define GPDMA2_HIFCR_CTCIF6                     ((uint32_t)0x00200000)
#define GPDMA2_HIFCR_CHTIF6                     ((uint32_t)0x00100000)
#define GPDMA2_HIFCR_CTEIF6                     ((uint32_t)0x00080000)
#define GPDMA2_HIFCR_CDMEIF6                    ((uint32_t)0x00040000)
#define GPDMA2_HIFCR_CFEIF6                     ((uint32_t)0x00010000)
#define GPDMA2_HIFCR_CTCIF5                     ((uint32_t)0x00000800)
#define GPDMA2_HIFCR_CHTIF5                     ((uint32_t)0x00000400)
#define GPDMA2_HIFCR_CTEIF5                     ((uint32_t)0x00000200)
#define GPDMA2_HIFCR_CDMEIF5                    ((uint32_t)0x00000100)
#define GPDMA2_HIFCR_CFEIF5                     ((uint32_t)0x00000040)
#define GPDMA2_HIFCR_CTCIF4                     ((uint32_t)0x00000020)
#define GPDMA2_HIFCR_CHTIF4                     ((uint32_t)0x00000010)
#define GPDMA2_HIFCR_CTEIF4                     ((uint32_t)0x00000008)
#define GPDMA2_HIFCR_CDMEIF4                    ((uint32_t)0x00000004)
#define GPDMA2_HIFCR_CFEIF4                     ((uint32_t)0x00000001)

/******************************************************************************/
/*                                                                            */
/*                             DMAMUX Controller                              */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DMAMUX_CxCR register  **************/
#define DMAMUX_CxCR_DMAREQ_ID                 ((uint32_t)0x000000FF)
#define DMAMUX_CxCR_DMAREQ_ID_0               ((uint32_t)0x00000001)
#define DMAMUX_CxCR_DMAREQ_ID_1               ((uint32_t)0x00000002)
#define DMAMUX_CxCR_DMAREQ_ID_2               ((uint32_t)0x00000004)
#define DMAMUX_CxCR_DMAREQ_ID_3               ((uint32_t)0x00000008)
#define DMAMUX_CxCR_DMAREQ_ID_4               ((uint32_t)0x00000010)
#define DMAMUX_CxCR_DMAREQ_ID_5               ((uint32_t)0x00000020)
#define DMAMUX_CxCR_DMAREQ_ID_6               ((uint32_t)0x00000040)
#define DMAMUX_CxCR_DMAREQ_ID_7               ((uint32_t)0x00000080)
#define DMAMUX_CxCR_SOIE                      ((uint32_t)0x00000100)
#define DMAMUX_CxCR_SE                        ((uint32_t)0x00010000)
#define DMAMUX_CxCR_SPOL                      ((uint32_t)0x00060000)
#define DMAMUX_CxCR_SPOL_0                    ((uint32_t)0x00020000)
#define DMAMUX_CxCR_SPOL_1                    ((uint32_t)0x00040000)
#define DMAMUX_CxCR_NBREQ                     ((uint32_t)0x00F80000)
#define DMAMUX_CxCR_NBREQ_0                   ((uint32_t)0x00080000)
#define DMAMUX_CxCR_NBREQ_1                   ((uint32_t)0x00100000)
#define DMAMUX_CxCR_NBREQ_2                   ((uint32_t)0x00200000)
#define DMAMUX_CxCR_NBREQ_3                   ((uint32_t)0x00400000)
#define DMAMUX_CxCR_NBREQ_4                   ((uint32_t)0x00800000)
#define DMAMUX_CxCR_SYNC_ID                   ((uint32_t)0x1F000000)
#define DMAMUX_CxCR_SYNC_ID_0                 ((uint32_t)0x01000000)
#define DMAMUX_CxCR_SYNC_ID_1                 ((uint32_t)0x02000000)
#define DMAMUX_CxCR_SYNC_ID_2                 ((uint32_t)0x04000000)
#define DMAMUX_CxCR_SYNC_ID_3                 ((uint32_t)0x08000000)
#define DMAMUX_CxCR_SYNC_ID_4                 ((uint32_t)0x10000000)

/********************  Bits definition for DMAMUX_CSR register  **************/
#define DMAMUX_CSR_SOF0                       ((uint32_t)0x00000001)
#define DMAMUX_CSR_SOF1                       ((uint32_t)0x00000002)
#define DMAMUX_CSR_SOF2                       ((uint32_t)0x00000004)
#define DMAMUX_CSR_SOF3                       ((uint32_t)0x00000008)
#define DMAMUX_CSR_SOF4                       ((uint32_t)0x00000010)
#define DMAMUX_CSR_SOF5                       ((uint32_t)0x00000020)
#define DMAMUX_CSR_SOF6                       ((uint32_t)0x00000040)
#define DMAMUX_CSR_SOF7                       ((uint32_t)0x00000080)
#define DMAMUX_CSR_SOF8                       ((uint32_t)0x00000100)
#define DMAMUX_CSR_SOF9                       ((uint32_t)0x00000200)
#define DMAMUX_CSR_SOF10                      ((uint32_t)0x00000400)
#define DMAMUX_CSR_SOF11                      ((uint32_t)0x00000800)
#define DMAMUX_CSR_SOF12                      ((uint32_t)0x00001000)
#define DMAMUX_CSR_SOF13                      ((uint32_t)0x00002000)
#define DMAMUX_CSR_SOF14                      ((uint32_t)0x00004000)
#define DMAMUX_CSR_SOF15                      ((uint32_t)0x00008000)

