cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
/********************  Bits definition for DMAMUX_CFR register  **************/
#define DMAMUX_CFR_CSOF0                      ((uint32_t)0x00000001)
#define DMAMUX_CFR_CSOF1                      ((uint32_t)0x00000002)
#define DMAMUX_CFR_CSOF2                      ((uint32_t)0x00000004)
#define DMAMUX_CFR_CSOF3                      ((uint32_t)0x00000008)
#define DMAMUX_CFR_CSOF4                      ((uint32_t)0x00000010)
#define DMAMUX_CFR_CSOF5                      ((uint32_t)0x00000020)
#define DMAMUX_CFR_CSOF6                      ((uint32_t)0x00000040)
#define DMAMUX_CFR_CSOF7                      ((uint32_t)0x00000080)
#define DMAMUX_CFR_CSOF8                      ((uint32_t)0x00000100)
#define DMAMUX_CFR_CSOF9                      ((uint32_t)0x00000200)
#define DMAMUX_CFR_CSOF10                     ((uint32_t)0x00000400)
#define DMAMUX_CFR_CSOF11                     ((uint32_t)0x00000800)
#define DMAMUX_CFR_CSOF12                     ((uint32_t)0x00001000)
#define DMAMUX_CFR_CSOF13                     ((uint32_t)0x00002000)
#define DMAMUX_CFR_CSOF14                     ((uint32_t)0x00004000)
#define DMAMUX_CFR_CSOF15                     ((uint32_t)0x00008000)

/********************  Bits definition for DMAMUX_RGxCR register  ************/
#define DMAMUX_RGxCR_SIG_ID                   ((uint32_t)0x0000001F)
#define DMAMUX_RGxCR_SIG_ID_0                 ((uint32_t)0x00000001)
#define DMAMUX_RGxCR_SIG_ID_1                 ((uint32_t)0x00000002)
#define DMAMUX_RGxCR_SIG_ID_2                 ((uint32_t)0x00000004)
#define DMAMUX_RGxCR_SIG_ID_3                 ((uint32_t)0x00000008)
#define DMAMUX_RGxCR_SIG_ID_4                 ((uint32_t)0x00000010)
#define DMAMUX_RGxCR_OIE                      ((uint32_t)0x00000100)
#define DMAMUX_RGxCR_GE                       ((uint32_t)0x00010000)
#define DMAMUX_RGxCR_GPOL                     ((uint32_t)0x00060000)
#define DMAMUX_RGxCR_GPOL_0                   ((uint32_t)0x00020000)
#define DMAMUX_RGxCR_GPOL_1                   ((uint32_t)0x00040000)
#define DMAMUX_RGxCR_NBREQ                    ((uint32_t)0x00F80000)
#define DMAMUX_RGxCR_NBREQ_0                  ((uint32_t)0x00080000)
#define DMAMUX_RGxCR_NBREQ_1                  ((uint32_t)0x00100000)
#define DMAMUX_RGxCR_NBREQ_2                  ((uint32_t)0x00200000)
#define DMAMUX_RGxCR_NBREQ_3                  ((uint32_t)0x00400000)
#define DMAMUX_RGxCR_NBREQ_4                  ((uint32_t)0x00800000)

/********************  Bits definition for DMAMUX_RGSR register  **************/
#define DMAMUX_RGSR_OF0                       ((uint32_t)0x00000001)
#define DMAMUX_RGSR_OF1                       ((uint32_t)0x00000002)
#define DMAMUX_RGSR_OF2                       ((uint32_t)0x00000004)
#define DMAMUX_RGSR_OF3                       ((uint32_t)0x00000008)

/********************  Bits definition for DMAMUX_RGCFR register  **************/
#define DMAMUX_RGCFR_COF0                     ((uint32_t)0x00000001)
#define DMAMUX_RGCFR_COF1                     ((uint32_t)0x00000002)
#define DMAMUX_RGCFR_COF2                     ((uint32_t)0x00000004)
#define DMAMUX_RGCFR_COF3                     ((uint32_t)0x00000008)

/******************************************************************************/
/*                                                                            */
/*                         AHB Master DMA2D Controller (DMA2D)                */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for DMA2D_CR register  ******************/

#define DMA2D_CR_START                     ((uint32_t)0x00000001)               /*!< Start transfer */
#define DMA2D_CR_SUSP                      ((uint32_t)0x00000002)               /*!< Suspend transfer */
#define DMA2D_CR_ABORT                     ((uint32_t)0x00000004)               /*!< Abort transfer */
#define DMA2D_CR_TEIE                      ((uint32_t)0x00000100)               /*!< Transfer Error Interrupt Enable */
#define DMA2D_CR_TCIE                      ((uint32_t)0x00000200)               /*!< Transfer Complete Interrupt Enable */
#define DMA2D_CR_TWIE                      ((uint32_t)0x00000400)               /*!< Transfer Watermark Interrupt Enable */
#define DMA2D_CR_CAEIE                     ((uint32_t)0x00000800)               /*!< CLUT Access Error Interrupt Enable */
#define DMA2D_CR_CTCIE                     ((uint32_t)0x00001000)               /*!< CLUT Transfer Complete Interrupt Enable */
#define DMA2D_CR_CEIE                      ((uint32_t)0x00002000)               /*!< Configuration Error Interrupt Enable */
#define DMA2D_CR_MODE                      ((uint32_t)0x00030000)               /*!< DMA2D Mode */

/********************  Bit definition for DMA2D_ISR register  *****************/

#define DMA2D_ISR_TEIF                     ((uint32_t)0x00000001)               /*!< Transfer Error Interrupt Flag */
#define DMA2D_ISR_TCIF                     ((uint32_t)0x00000002)               /*!< Transfer Complete Interrupt Flag */
#define DMA2D_ISR_TWIF                     ((uint32_t)0x00000004)               /*!< Transfer Watermark Interrupt Flag */
#define DMA2D_ISR_CAEIF                    ((uint32_t)0x00000008)               /*!< CLUT Access Error Interrupt Flag */
#define DMA2D_ISR_CTCIF                    ((uint32_t)0x00000010)               /*!< CLUT Transfer Complete Interrupt Flag */
#define DMA2D_ISR_CEIF                     ((uint32_t)0x00000020)               /*!< Configuration Error Interrupt Flag */

/********************  Bit definition for DMA2D_IFSR register  ****************/

#define DMA2D_IFSR_CTEIF                   ((uint32_t)0x00000001)               /*!< Clears Transfer Error Interrupt Flag */
#define DMA2D_IFSR_CTCIF                   ((uint32_t)0x00000002)               /*!< Clears Transfer Complete Interrupt Flag */
#define DMA2D_IFSR_CTWIF                   ((uint32_t)0x00000004)               /*!< Clears Transfer Watermark Interrupt Flag */
#define DMA2D_IFSR_CCAEIF                  ((uint32_t)0x00000008)               /*!< Clears CLUT Access Error Interrupt Flag */
#define DMA2D_IFSR_CCTCIF                  ((uint32_t)0x00000010)               /*!< Clears CLUT Transfer Complete Interrupt Flag */
#define DMA2D_IFSR_CCEIF                   ((uint32_t)0x00000020)               /*!< Clears Configuration Error Interrupt Flag */

