cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
/********************  Bit definition for DMA2D_NLR register  *****************/

#define DMA2D_NLR_NL                       ((uint32_t)0x0000FFFF)               /*!< Number of Lines */
#define DMA2D_NLR_PL                       ((uint32_t)0x3FFF0000)               /*!< Pixel per Lines */

/********************  Bit definition for DMA2D_LWR register  *****************/

#define DMA2D_LWR_LW                       ((uint32_t)0x0000FFFF)               /*!< Line Watermark */

/********************  Bit definition for DMA2D_AMTCR register  ***************/

#define DMA2D_AMTCR_EN                     ((uint32_t)0x00000001)               /*!< Enable */
#define DMA2D_AMTCR_DT                     ((uint32_t)0x0000FF00)               /*!< Dead Time */


/********************  Bit definition for DMA2D_FGCLUT register  **************/
                                                                     
/********************  Bit definition for DMA2D_BGCLUT register  **************/

/******************************************************************************/
/*                                                                            */
/*                                  DSI Host                                  */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for DSIHOST_VR register  *****************/
#define DSIHOST_VR                         ((uint32_t)0x3133302A)               /*!< DSI Host Version */

/*******************  Bit definition for DSIHOST_CR register  *****************/
#define DSIHOST_CR_EN                      ((uint32_t)0x00000001)               /*!< DSI Host power up and reset */

/*******************  Bit definition for DSIHOST_CCR register  ****************/
#define DSIHOST_CCR_TXECKDIV               ((uint32_t)0x000000FF)               /*!< TX Escape Clock Division */
#define DSIHOST_CCR_TXECKDIV0              ((uint32_t)0x00000001)
#define DSIHOST_CCR_TXECKDIV1              ((uint32_t)0x00000002)
#define DSIHOST_CCR_TXECKDIV2              ((uint32_t)0x00000004)
#define DSIHOST_CCR_TXECKDIV3              ((uint32_t)0x00000008)
#define DSIHOST_CCR_TXECKDIV4              ((uint32_t)0x00000010)
#define DSIHOST_CCR_TXECKDIV5              ((uint32_t)0x00000020)
#define DSIHOST_CCR_TXECKDIV6              ((uint32_t)0x00000040)
#define DSIHOST_CCR_TXECKDIV7              ((uint32_t)0x00000080)

#define DSIHOST_CCR_TOCKDIV                ((uint32_t)0x0000FF00)               /*!< Timeout Clock Division */
#define DSIHOST_CCR_TOCKDIV0               ((uint32_t)0x00000100)
#define DSIHOST_CCR_TOCKDIV1               ((uint32_t)0x00000200)
#define DSIHOST_CCR_TOCKDIV2               ((uint32_t)0x00000400)
#define DSIHOST_CCR_TOCKDIV3               ((uint32_t)0x00000800)
#define DSIHOST_CCR_TOCKDIV4               ((uint32_t)0x00001000)
#define DSIHOST_CCR_TOCKDIV5               ((uint32_t)0x00002000)
#define DSIHOST_CCR_TOCKDIV6               ((uint32_t)0x00004000)
#define DSIHOST_CCR_TOCKDIV7               ((uint32_t)0x00008000)

/*******************  Bit definition for DSIHOST_LVCIDR register  *************/
#define DSIHOST_LVCIDR_VCID                ((uint32_t)0x00000003)               /*!< Virtual Channel ID */
#define DSIHOST_LVCIDR_VCID0               ((uint32_t)0x00000001)
#define DSIHOST_LVCIDR_VCID1               ((uint32_t)0x00000002)

/*******************  Bit definition for DSIHOST_LCOLCR register  *************/
#define DSIHOST_LCOLCR_COLC                ((uint32_t)0x0000000F)               /*!< Color Coding */
#define DSIHOST_LCOLCR_COLC0               ((uint32_t)0x00000001)
#define DSIHOST_LCOLCR_COLC1               ((uint32_t)0x00000020)
#define DSIHOST_LCOLCR_COLC2               ((uint32_t)0x00000040)
#define DSIHOST_LCOLCR_COLC3               ((uint32_t)0x00000080)

#define DSIHOST_LCOLCR_LPE                 ((uint32_t)0x00000100)               /*!< Loosly Packet Enable */

/*******************  Bit definition for DSIHOST_LPCR register  ***************/
#define DSIHOST_LPCR_DEP                   ((uint32_t)0x00000001)               /*!< Data Enable Polarity */
#define DSIHOST_LPCR_VSP                   ((uint32_t)0x00000002)               /*!< VSYNC Polarity */
#define DSIHOST_LPCR_HSP                   ((uint32_t)0x00000004)               /*!< HSYNC Polarity */

/*******************  Bit definition for DSIHOST_LPMCR register  **************/
#define DSIHOST_LPMCR_VLPSIZE              ((uint32_t)0x000000FF)               /*!< VACT Largest Packet Size */
#define DSIHOST_LPMCR_VLPSIZE0             ((uint32_t)0x00000001)
#define DSIHOST_LPMCR_VLPSIZE1             ((uint32_t)0x00000002)
#define DSIHOST_LPMCR_VLPSIZE2             ((uint32_t)0x00000004)
#define DSIHOST_LPMCR_VLPSIZE3             ((uint32_t)0x00000008)
#define DSIHOST_LPMCR_VLPSIZE4             ((uint32_t)0x00000010)
#define DSIHOST_LPMCR_VLPSIZE5             ((uint32_t)0x00000020)
#define DSIHOST_LPMCR_VLPSIZE6             ((uint32_t)0x00000040)
#define DSIHOST_LPMCR_VLPSIZE7             ((uint32_t)0x00000080)

#define DSIHOST_LPMCR_LPSIZE               ((uint32_t)0x00FF0000)               /*!< Largest Packet Size */
#define DSIHOST_LPMCR_LPSIZE0              ((uint32_t)0x00010000)
#define DSIHOST_LPMCR_LPSIZE1              ((uint32_t)0x00020000)
#define DSIHOST_LPMCR_LPSIZE2              ((uint32_t)0x00040000)
#define DSIHOST_LPMCR_LPSIZE3              ((uint32_t)0x00080000)
#define DSIHOST_LPMCR_LPSIZE4              ((uint32_t)0x00100000)
#define DSIHOST_LPMCR_LPSIZE5              ((uint32_t)0x00200000)
#define DSIHOST_LPMCR_LPSIZE6              ((uint32_t)0x00400000)
#define DSIHOST_LPMCR_LPSIZE7              ((uint32_t)0x00800000)

/*******************  Bit definition for DSIHOST_PCR register  ****************/
#define DSIHOST_PCR_ETTXE                  ((uint32_t)0x00000001)               /*!< EoTp Transmission Enable */
#define DSIHOST_PCR_ETRXE                  ((uint32_t)0x00000002)               /*!< EoTp Reception Enable */
#define DSIHOST_PCR_BTAE                   ((uint32_t)0x00000004)               /*!< Bus Turn Around Enable */
#define DSIHOST_PCR_ECCRXE                 ((uint32_t)0x00000008)               /*!< ECC Reception Enable */
#define DSIHOST_PCR_CRCRXE                 ((uint32_t)0x00000010)               /*!< CRC Reception Enable */

/*******************  Bit definition for DSIHOST_GVCIDR register  *************/
#define DSIHOST_GVCIDR_VCID                ((uint32_t)0x00000003)               /*!< Virtual Channel ID */
#define DSIHOST_GVCIDR_VCID0               ((uint32_t)0x00000001)
#define DSIHOST_GVCIDR_VCID1               ((uint32_t)0x00000002)

/*******************  Bit definition for DSIHOST_MCR register  ****************/
#define DSIHOST_MCR_CMDM                   ((uint32_t)0x00000001)               /*!< Command Mode */

/*******************  Bit definition for DSIHOST_VMCR register  ***************/
#define DSIHOST_VMCR_VMT                   ((uint32_t)0x00000003)               /*!< Video Mode Type */
#define DSIHOST_VMCR_VMT0                  ((uint32_t)0x00000001)
#define DSIHOST_VMCR_VMT1                  ((uint32_t)0x00000002)

#define DSIHOST_VMCR_LPVSAE                ((uint32_t)0x00000100)               /*!< Low-Power Vertical Sync Active Enable */
#define DSIHOST_VMCR_LPVBPE                ((uint32_t)0x00000200)               /*!< Low-power Vertical Back-Porch Enable */
#define DSIHOST_VMCR_LPVFPE                ((uint32_t)0x00000400)               /*!< Low-power Vertical Front-porch Enable */
#define DSIHOST_VMCR_LPVAE                 ((uint32_t)0x00000800)               /*!< Low-Power Vertical Active Enable */
#define DSIHOST_VMCR_LPHBPE                ((uint32_t)0x00001000)               /*!< Low-Power Horizontal Back-Porch Enable */
#define DSIHOST_VMCR_LPHFPE                ((uint32_t)0x00002000)               /*!< Low-Power Horizontal Front-Porch Enable */
#define DSIHOST_VMCR_FBTAAE                ((uint32_t)0x00004000)               /*!< Frame Bus-Turn-Around Acknowledge Enable */
#define DSIHOST_VMCR_LPCE                  ((uint32_t)0x00008000)               /*!< Low-Power Command Enable */
#define DSIHOST_VMCR_PGE                   ((uint32_t)0x00010000)               /*!< Pattern Generator Enable */
#define DSIHOST_VMCR_PGM                   ((uint32_t)0x00100000)               /*!< Pattern Generator Mode */
#define DSIHOST_VMCR_PGO                   ((uint32_t)0x01000000)               /*!< Pattern Generator Orientation */

/*******************  Bit definition for DSIHOST_VPCR register  ***************/
#define DSIHOST_VPCR_VPSIZE                ((uint32_t)0x00003FFF)               /*!< Video Packet Size */
#define DSIHOST_VPCR_VPSIZE0               ((uint32_t)0x00000001)
#define DSIHOST_VPCR_VPSIZE1               ((uint32_t)0x00000002)
#define DSIHOST_VPCR_VPSIZE2               ((uint32_t)0x00000004)
#define DSIHOST_VPCR_VPSIZE3               ((uint32_t)0x00000008)
#define DSIHOST_VPCR_VPSIZE4               ((uint32_t)0x00000010)
#define DSIHOST_VPCR_VPSIZE5               ((uint32_t)0x00000020)
#define DSIHOST_VPCR_VPSIZE6               ((uint32_t)0x00000040)
#define DSIHOST_VPCR_VPSIZE7               ((uint32_t)0x00000080)
#define DSIHOST_VPCR_VPSIZE8               ((uint32_t)0x00000100)
#define DSIHOST_VPCR_VPSIZE9               ((uint32_t)0x00000200)
#define DSIHOST_VPCR_VPSIZE10              ((uint32_t)0x00000400)
#define DSIHOST_VPCR_VPSIZE11              ((uint32_t)0x00000800)
#define DSIHOST_VPCR_VPSIZE12              ((uint32_t)0x00001000)
#define DSIHOST_VPCR_VPSIZE13              ((uint32_t)0x00002000)

