cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
/*******************  Bit definition for DSIHOST_CMCR register  ***************/
#define DSIHOST_CMCR_TEARE                 ((uint32_t)0x00000001)               /*!< Tearing Effect Acknowledge Request Enable */
#define DSIHOST_CMCR_ARE                   ((uint32_t)0x00000002)               /*!< Acknowledge Request Enable */
#define DSIHOST_CMCR_GSW0TX                ((uint32_t)0x00000100)               /*!< Generic Short Write Zero parameters Transmission */
#define DSIHOST_CMCR_GSW1TX                ((uint32_t)0x00000200)               /*!< Generic Short Write One parameters Transmission */
#define DSIHOST_CMCR_GSW2TX                ((uint32_t)0x00000400)               /*!< Generic Short Write Two parameters Transmission */
#define DSIHOST_CMCR_GSR0TX                ((uint32_t)0x00000800)               /*!< Generic Short Read Zero parameters Transmission */
#define DSIHOST_CMCR_GSR1TX                ((uint32_t)0x00001000)               /*!< Generic Short Read One parameters Transmission */
#define DSIHOST_CMCR_GSR2TX                ((uint32_t)0x00002000)               /*!< Generic Short Read Two parameters Transmission */
#define DSIHOST_CMCR_GLWTX                 ((uint32_t)0x00004000)               /*!< Generic Long Write Transmission */
#define DSIHOST_CMCR_DSW0TX                ((uint32_t)0x00010000)               /*!< DCS Short Write Zero parameter Transmission */
#define DSIHOST_CMCR_DSW1TX                ((uint32_t)0x00020000)               /*!< DCS Short Read One parameter Transmission */
#define DSIHOST_CMCR_DSR0TX                ((uint32_t)0x00040000)               /*!< DCS Short Read Zero parameter Transmission */
#define DSIHOST_CMCR_DLWTX                 ((uint32_t)0x00080000)               /*!< DCS Long Write Transmission */
#define DSIHOST_CMCR_MRDPS                 ((uint32_t)0x01000000)               /*!< Maximum Read Packet Size */

/*******************  Bit definition for DSIHOST_GHCR register  ***************/
#define DSIHOST_GHCR_DT                    ((uint32_t)0x0000003F)               /*!< Type */
#define DSIHOST_GHCR_DT0                   ((uint32_t)0x00000001)
#define DSIHOST_GHCR_DT1                   ((uint32_t)0x00000002)
#define DSIHOST_GHCR_DT2                   ((uint32_t)0x00000004)
#define DSIHOST_GHCR_DT3                   ((uint32_t)0x00000008)
#define DSIHOST_GHCR_DT4                   ((uint32_t)0x00000010)
#define DSIHOST_GHCR_DT5                   ((uint32_t)0x00000020)

#define DSIHOST_GHCR_VCID                  ((uint32_t)0x000000C0)               /*!< Channel */
#define DSIHOST_GHCR_VCID0                 ((uint32_t)0x00000040)
#define DSIHOST_GHCR_VCID1                 ((uint32_t)0x00000080)

#define DSIHOST_GHCR_WCLSB                 ((uint32_t)0x0000FF00)               /*!< WordCount LSB */
#define DSIHOST_GHCR_WCLSB0                ((uint32_t)0x00000100)
#define DSIHOST_GHCR_WCLSB1                ((uint32_t)0x00000200)
#define DSIHOST_GHCR_WCLSB2                ((uint32_t)0x00000400)
#define DSIHOST_GHCR_WCLSB3                ((uint32_t)0x00000800)
#define DSIHOST_GHCR_WCLSB4                ((uint32_t)0x00001000)
#define DSIHOST_GHCR_WCLSB5                ((uint32_t)0x00002000)
#define DSIHOST_GHCR_WCLSB6                ((uint32_t)0x00004000)
#define DSIHOST_GHCR_WCLSB7                ((uint32_t)0x00008000)

#define DSIHOST_GHCR_WCMSB                 ((uint32_t)0x00FF0000)               /*!< WordCount MSB */
#define DSIHOST_GHCR_WCMSB0                ((uint32_t)0x00010000)
#define DSIHOST_GHCR_WCMSB1                ((uint32_t)0x00020000)
#define DSIHOST_GHCR_WCMSB2                ((uint32_t)0x00040000)
#define DSIHOST_GHCR_WCMSB3                ((uint32_t)0x00080000)
#define DSIHOST_GHCR_WCMSB4                ((uint32_t)0x00100000)
#define DSIHOST_GHCR_WCMSB5                ((uint32_t)0x00200000)
#define DSIHOST_GHCR_WCMSB6                ((uint32_t)0x00400000)
#define DSIHOST_GHCR_WCMSB7                ((uint32_t)0x00800000)

/*******************  Bit definition for DSIHOST_GPDR register  ***************/
#define DSIHOST_GPDR_DATA1                 ((uint32_t)0x000000FF)               /*!< Payload Byte 1 */
#define DSIHOST_GPDR_DATA1_0               ((uint32_t)0x00000001)
#define DSIHOST_GPDR_DATA1_1               ((uint32_t)0x00000002)
#define DSIHOST_GPDR_DATA1_2               ((uint32_t)0x00000004)
#define DSIHOST_GPDR_DATA1_3               ((uint32_t)0x00000008)
#define DSIHOST_GPDR_DATA1_4               ((uint32_t)0x00000010)
#define DSIHOST_GPDR_DATA1_5               ((uint32_t)0x00000020)
#define DSIHOST_GPDR_DATA1_6               ((uint32_t)0x00000040)
#define DSIHOST_GPDR_DATA1_7               ((uint32_t)0x00000080)

#define DSIHOST_GPDR_DATA2                 ((uint32_t)0x0000FF00)               /*!< Payload Byte 2 */
#define DSIHOST_GPDR_DATA2_0               ((uint32_t)0x00000100)
#define DSIHOST_GPDR_DATA2_1               ((uint32_t)0x00000200)
#define DSIHOST_GPDR_DATA2_2               ((uint32_t)0x00000400)
#define DSIHOST_GPDR_DATA2_3               ((uint32_t)0x00000800)
#define DSIHOST_GPDR_DATA2_4               ((uint32_t)0x00001000)
#define DSIHOST_GPDR_DATA2_5               ((uint32_t)0x00002000)
#define DSIHOST_GPDR_DATA2_6               ((uint32_t)0x00004000)
#define DSIHOST_GPDR_DATA2_7               ((uint32_t)0x00008000)

#define DSIHOST_GPDR_DATA3                 ((uint32_t)0x00FF0000)               /*!< Payload Byte 3 */
#define DSIHOST_GPDR_DATA3_0               ((uint32_t)0x00010000)
#define DSIHOST_GPDR_DATA3_1               ((uint32_t)0x00020000)
#define DSIHOST_GPDR_DATA3_2               ((uint32_t)0x00040000)
#define DSIHOST_GPDR_DATA3_3               ((uint32_t)0x00080000)
#define DSIHOST_GPDR_DATA3_4               ((uint32_t)0x00100000)
#define DSIHOST_GPDR_DATA3_5               ((uint32_t)0x00200000)
#define DSIHOST_GPDR_DATA3_6               ((uint32_t)0x00400000)
#define DSIHOST_GPDR_DATA3_7               ((uint32_t)0x00800000)

#define DSIHOST_GPDR_DATA4                 ((uint32_t)0xFF000000)               /*!< Payload Byte 4 */
#define DSIHOST_GPDR_DATA4_0               ((uint32_t)0x01000000)
#define DSIHOST_GPDR_DATA4_1               ((uint32_t)0x02000000)
#define DSIHOST_GPDR_DATA4_2               ((uint32_t)0x04000000)
#define DSIHOST_GPDR_DATA4_3               ((uint32_t)0x08000000)
#define DSIHOST_GPDR_DATA4_4               ((uint32_t)0x10000000)
#define DSIHOST_GPDR_DATA4_5               ((uint32_t)0x20000000)
#define DSIHOST_GPDR_DATA4_6               ((uint32_t)0x40000000)
#define DSIHOST_GPDR_DATA4_7               ((uint32_t)0x80000000)

/*******************  Bit definition for DSIHOST_GPSR register  ***************/
#define DSIHOST_GPSR_CMDFE                 ((uint32_t)0x00000001)               /*!< Command FIFO Empty */
#define DSIHOST_GPSR_CMDFF                 ((uint32_t)0x00000002)               /*!< Command FIFO Full */
#define DSIHOST_GPSR_PWRFE                 ((uint32_t)0x00000004)               /*!< Payload Write FIFO Empty */
#define DSIHOST_GPSR_PWRFF                 ((uint32_t)0x00000008)               /*!< Payload Write FIFO Full */
#define DSIHOST_GPSR_PRDFE                 ((uint32_t)0x00000010)               /*!< Payload Read FIFO Empty */
#define DSIHOST_GPSR_PRDFF                 ((uint32_t)0x00000020)               /*!< Payload Read FIFO Full */
#define DSIHOST_GPSR_RCB                   ((uint32_t)0x00000040)               /*!< Read Command Busy */

/*******************  Bit definition for DSIHOST_TCCR1 register  **************/
#define DSIHOST_TCCR1_LPRX_TOCNT           ((uint32_t)0x0000FFFF)               /*!< Low-power Reception Timeout Counter */
#define DSIHOST_TCCR1_LPRX_TOCNT0          ((uint32_t)0x00000001)
#define DSIHOST_TCCR1_LPRX_TOCNT1          ((uint32_t)0x00000002)
#define DSIHOST_TCCR1_LPRX_TOCNT2          ((uint32_t)0x00000004)
#define DSIHOST_TCCR1_LPRX_TOCNT3          ((uint32_t)0x00000008)
#define DSIHOST_TCCR1_LPRX_TOCNT4          ((uint32_t)0x00000010)
#define DSIHOST_TCCR1_LPRX_TOCNT5          ((uint32_t)0x00000020)
#define DSIHOST_TCCR1_LPRX_TOCNT6          ((uint32_t)0x00000040)
#define DSIHOST_TCCR1_LPRX_TOCNT7          ((uint32_t)0x00000080)
#define DSIHOST_TCCR1_LPRX_TOCNT8          ((uint32_t)0x00000100)
#define DSIHOST_TCCR1_LPRX_TOCNT9          ((uint32_t)0x00000200)
#define DSIHOST_TCCR1_LPRX_TOCNT10         ((uint32_t)0x00000400)
#define DSIHOST_TCCR1_LPRX_TOCNT11         ((uint32_t)0x00000800)
#define DSIHOST_TCCR1_LPRX_TOCNT12         ((uint32_t)0x00001000)
#define DSIHOST_TCCR1_LPRX_TOCNT13         ((uint32_t)0x00002000)
#define DSIHOST_TCCR1_LPRX_TOCNT14         ((uint32_t)0x00004000)
#define DSIHOST_TCCR1_LPRX_TOCNT15         ((uint32_t)0x00008000)

#define DSIHOST_TCCR1_HSTX_TOCNT           ((uint32_t)0xFFFF0000)               /*!< High-Speed Transmission Timeout Counter */
#define DSIHOST_TCCR1_HSTX_TOCNT0          ((uint32_t)0x00010000)
#define DSIHOST_TCCR1_HSTX_TOCNT1          ((uint32_t)0x00020000)
#define DSIHOST_TCCR1_HSTX_TOCNT2          ((uint32_t)0x00040000)
#define DSIHOST_TCCR1_HSTX_TOCNT3          ((uint32_t)0x00080000)
#define DSIHOST_TCCR1_HSTX_TOCNT4          ((uint32_t)0x00100000)
#define DSIHOST_TCCR1_HSTX_TOCNT5          ((uint32_t)0x00200000)
#define DSIHOST_TCCR1_HSTX_TOCNT6          ((uint32_t)0x00400000)
#define DSIHOST_TCCR1_HSTX_TOCNT7          ((uint32_t)0x00800000)
#define DSIHOST_TCCR1_HSTX_TOCNT8          ((uint32_t)0x01000000)
#define DSIHOST_TCCR1_HSTX_TOCNT9          ((uint32_t)0x02000000)
#define DSIHOST_TCCR1_HSTX_TOCNT10         ((uint32_t)0x04000000)
#define DSIHOST_TCCR1_HSTX_TOCNT11         ((uint32_t)0x08000000)
#define DSIHOST_TCCR1_HSTX_TOCNT12         ((uint32_t)0x10000000)
#define DSIHOST_TCCR1_HSTX_TOCNT13         ((uint32_t)0x20000000)
#define DSIHOST_TCCR1_HSTX_TOCNT14         ((uint32_t)0x40000000)
#define DSIHOST_TCCR1_HSTX_TOCNT15         ((uint32_t)0x80000000)

