cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
/*******************  Bit definition for DSIHOST_CLCR register  ***************/
#define DSIHOST_CLCR_DPCC                  ((uint32_t)0x00000001)               /*!< D-PHY Clock Control */
#define DSIHOST_CLCR_ACR                   ((uint32_t)0x00000002)               /*!< Automatic Clocklane Control */

/*******************  Bit definition for DSIHOST_CLTCR register  **************/
#define DSIHOST_CLTCR_LP2HS_TIME           ((uint32_t)0x000003FF)               /*!< Low-Power to High-Speed Time */
#define DSIHOST_CLTCR_LP2HS_TIME0          ((uint32_t)0x00000001)
#define DSIHOST_CLTCR_LP2HS_TIME1          ((uint32_t)0x00000002)
#define DSIHOST_CLTCR_LP2HS_TIME2          ((uint32_t)0x00000004)
#define DSIHOST_CLTCR_LP2HS_TIME3          ((uint32_t)0x00000008)
#define DSIHOST_CLTCR_LP2HS_TIME4          ((uint32_t)0x00000010)
#define DSIHOST_CLTCR_LP2HS_TIME5          ((uint32_t)0x00000020)
#define DSIHOST_CLTCR_LP2HS_TIME6          ((uint32_t)0x00000040)
#define DSIHOST_CLTCR_LP2HS_TIME7          ((uint32_t)0x00000080)
#define DSIHOST_CLTCR_LP2HS_TIME8          ((uint32_t)0x00000100)
#define DSIHOST_CLTCR_LP2HS_TIME9          ((uint32_t)0x00000200)

#define DSIHOST_CLTCR_HS2LP_TIME           ((uint32_t)0x03FF0000)               /*!< High-Speed to Low-Power Time */
#define DSIHOST_CLTCR_HS2LP_TIME0          ((uint32_t)0x00010000)
#define DSIHOST_CLTCR_HS2LP_TIME1          ((uint32_t)0x00020000)
#define DSIHOST_CLTCR_HS2LP_TIME2          ((uint32_t)0x00040000)
#define DSIHOST_CLTCR_HS2LP_TIME3          ((uint32_t)0x00080000)
#define DSIHOST_CLTCR_HS2LP_TIME4          ((uint32_t)0x00100000)
#define DSIHOST_CLTCR_HS2LP_TIME5          ((uint32_t)0x00200000)
#define DSIHOST_CLTCR_HS2LP_TIME6          ((uint32_t)0x00400000)
#define DSIHOST_CLTCR_HS2LP_TIME7          ((uint32_t)0x00800000)
#define DSIHOST_CLTCR_HS2LP_TIME8          ((uint32_t)0x01000000)
#define DSIHOST_CLTCR_HS2LP_TIME9          ((uint32_t)0x02000000)

/*******************  Bit definition for DSIHOST_DLTCR register  **************/
#define DSIHOST_DLTCR_MRD_TIME             ((uint32_t)0x00007FFF)               /*!< Maximum Read Time */
#define DSIHOST_DLTCR_MRD_TIME0            ((uint32_t)0x00000001)
#define DSIHOST_DLTCR_MRD_TIME1            ((uint32_t)0x00000002)
#define DSIHOST_DLTCR_MRD_TIME2            ((uint32_t)0x00000004)
#define DSIHOST_DLTCR_MRD_TIME3            ((uint32_t)0x00000008)
#define DSIHOST_DLTCR_MRD_TIME4            ((uint32_t)0x00000010)
#define DSIHOST_DLTCR_MRD_TIME5            ((uint32_t)0x00000020)
#define DSIHOST_DLTCR_MRD_TIME6            ((uint32_t)0x00000040)
#define DSIHOST_DLTCR_MRD_TIME7            ((uint32_t)0x00000080)
#define DSIHOST_DLTCR_MRD_TIME8            ((uint32_t)0x00000100)
#define DSIHOST_DLTCR_MRD_TIME9            ((uint32_t)0x00000200)
#define DSIHOST_DLTCR_MRD_TIME10           ((uint32_t)0x00000400)
#define DSIHOST_DLTCR_MRD_TIME11           ((uint32_t)0x00000800)
#define DSIHOST_DLTCR_MRD_TIME12           ((uint32_t)0x00001000)
#define DSIHOST_DLTCR_MRD_TIME13           ((uint32_t)0x00002000)
#define DSIHOST_DLTCR_MRD_TIME14           ((uint32_t)0x00004000)

#define DSIHOST_DLTCR_LP2HS_TIME           ((uint32_t)0x00FF0000)               /*!< Low-Power To High-Speed Time */
#define DSIHOST_DLTCR_LP2HS_TIME0          ((uint32_t)0x00010000)
#define DSIHOST_DLTCR_LP2HS_TIME1          ((uint32_t)0x00020000)
#define DSIHOST_DLTCR_LP2HS_TIME2          ((uint32_t)0x00040000)
#define DSIHOST_DLTCR_LP2HS_TIME3          ((uint32_t)0x00080000)
#define DSIHOST_DLTCR_LP2HS_TIME4          ((uint32_t)0x00100000)
#define DSIHOST_DLTCR_LP2HS_TIME5          ((uint32_t)0x00200000)
#define DSIHOST_DLTCR_LP2HS_TIME6          ((uint32_t)0x00400000)
#define DSIHOST_DLTCR_LP2HS_TIME7          ((uint32_t)0x00800000)

#define DSIHOST_DLTCR_HS2LP_TIME           ((uint32_t)0xFF000000)               /*!< High-Speed To Low-Power Time */
#define DSIHOST_DLTCR_HS2LP_TIME0          ((uint32_t)0x01000000)
#define DSIHOST_DLTCR_HS2LP_TIME1          ((uint32_t)0x02000000)
#define DSIHOST_DLTCR_HS2LP_TIME2          ((uint32_t)0x04000000)
#define DSIHOST_DLTCR_HS2LP_TIME3          ((uint32_t)0x08000000)
#define DSIHOST_DLTCR_HS2LP_TIME4          ((uint32_t)0x10000000)
#define DSIHOST_DLTCR_HS2LP_TIME5          ((uint32_t)0x20000000)
#define DSIHOST_DLTCR_HS2LP_TIME6          ((uint32_t)0x40000000)
#define DSIHOST_DLTCR_HS2LP_TIME7          ((uint32_t)0x80000000)

/*******************  Bit definition for DSIHOST_PCTLR register  **************/
#define DSIHOST_PCTLR_DEN                  ((uint32_t)0x00000002)               /*!< Digital Enable */
#define DSIHOST_PCTLR_CKE                  ((uint32_t)0x00000004)               /*!< Clock Enable */

/*******************  Bit definition for DSIHOST_PCONFR register  *************/
#define DSIHOST_PCONFR_NL                  ((uint32_t)0x00000003)               /*!< Number of Lanes */
#define DSIHOST_PCONFR_NL0                 ((uint32_t)0x00000001)
#define DSIHOST_PCONFR_NL1                 ((uint32_t)0x00000002)
                                     
#define DSIHOST_PCONFR_SW_TIME             ((uint32_t)0x0000FF00)               /*!< Stop Wait Time */
#define DSIHOST_PCONFR_SW_TIME0            ((uint32_t)0x00000100)
#define DSIHOST_PCONFR_SW_TIME1            ((uint32_t)0x00000200)
#define DSIHOST_PCONFR_SW_TIME2            ((uint32_t)0x00000400)
#define DSIHOST_PCONFR_SW_TIME3            ((uint32_t)0x00000800)
#define DSIHOST_PCONFR_SW_TIME4            ((uint32_t)0x00001000)
#define DSIHOST_PCONFR_SW_TIME5            ((uint32_t)0x00002000)
#define DSIHOST_PCONFR_SW_TIME6            ((uint32_t)0x00004000)
#define DSIHOST_PCONFR_SW_TIME7            ((uint32_t)0x00008000)

/*******************  Bit definition for DSIHOST_PUCR register  ***************/
#define DSIHOST_PUCR_URCL                  ((uint32_t)0x00000001)               /*!< ULPS Request on Clock Lane */
#define DSIHOST_PUCR_UECL                  ((uint32_t)0x00000002)               /*!< ULPS Exit on Clock Lane */
#define DSIHOST_PUCR_URDL                  ((uint32_t)0x00000004)               /*!< ULPS Request on Data Lane */
#define DSIHOST_PUCR_UEDL                  ((uint32_t)0x00000008)               /*!< ULPS Exit on Data Lane */

