cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
#define DSIWRAP_PCR2_HSTXSRCCL              ((uint32_t)0x00030000)              /*!< High-Speed Transmission Delay on Clock Lane */
#define DSIWRAP_PCR2_HSTXSRCCL0             ((uint32_t)0x00010000)
#define DSIWRAP_PCR2_HSTXSRCCL1             ((uint32_t)0x00020000)

#define DSIWRAP_PCR2_HSTXSRCDL              ((uint32_t)0x000C0000)              /*!< High-Speed Transmission Delay on Data Lane */
#define DSIWRAP_PCR2_HSTXSRCDL0             ((uint32_t)0x00040000)
#define DSIWRAP_PCR2_HSTXSRCDL1             ((uint32_t)0x00080000)

#define DSIWRAP_PCR2_FLPRXLPM               ((uint32_t)0x00400000)              /*!< Forces LP Receiver in Low-Power Mode */

#define DSIWRAP_PCR2_LPRXFT                 ((uint32_t)0x06000000)              /*!< Low-Power RX low-pass Filtering Tuning */
#define DSIWRAP_PCR2_LPRXFT0                ((uint32_t)0x02000000)
#define DSIWRAP_PCR2_LPRXFT1                ((uint32_t)0x04000000)

/*******************  Bit definition for DSIWRAP_PCR3 register  ***************/
#define DSIWRAP_PCR3_TCLKPREP               ((uint32_t)0x000000FF)              /*!< t-CLKPREP */
#define DSIWRAP_PCR3_TCLKPREP0              ((uint32_t)0x00000001)
#define DSIWRAP_PCR3_TCLKPREP1              ((uint32_t)0x00000002)
#define DSIWRAP_PCR3_TCLKPREP2              ((uint32_t)0x00000004)
#define DSIWRAP_PCR3_TCLKPREP3              ((uint32_t)0x00000008)
#define DSIWRAP_PCR3_TCLKPREP4              ((uint32_t)0x00000010)
#define DSIWRAP_PCR3_TCLKPREP5              ((uint32_t)0x00000020)
#define DSIWRAP_PCR3_TCLKPREP6              ((uint32_t)0x00000040)
#define DSIWRAP_PCR3_TCLKPREP7              ((uint32_t)0x00000080)

#define DSIWRAP_PCR3_TCLKZERO               ((uint32_t)0x0000FF00)              /*!< t-CLKZERO */
#define DSIWRAP_PCR3_TCLKZERO0              ((uint32_t)0x00000100)
#define DSIWRAP_PCR3_TCLKZERO1              ((uint32_t)0x00000200)
#define DSIWRAP_PCR3_TCLKZERO2              ((uint32_t)0x00000400)
#define DSIWRAP_PCR3_TCLKZERO3              ((uint32_t)0x00000800)
#define DSIWRAP_PCR3_TCLKZERO4              ((uint32_t)0x00001000)
#define DSIWRAP_PCR3_TCLKZERO5              ((uint32_t)0x00002000)
#define DSIWRAP_PCR3_TCLKZERO6              ((uint32_t)0x00004000)
#define DSIWRAP_PCR3_TCLKZERO7              ((uint32_t)0x00008000)

#define DSIWRAP_PCR3_THSPREP                ((uint32_t)0x00FF0000)              /*!< t-HSPREP */
#define DSIWRAP_PCR3_THSPREP0               ((uint32_t)0x00010000)
#define DSIWRAP_PCR3_THSPREP1               ((uint32_t)0x00020000)
#define DSIWRAP_PCR3_THSPREP2               ((uint32_t)0x00040000)
#define DSIWRAP_PCR3_THSPREP3               ((uint32_t)0x00080000)
#define DSIWRAP_PCR3_THSPREP4               ((uint32_t)0x00100000)
#define DSIWRAP_PCR3_THSPREP5               ((uint32_t)0x00200000)
#define DSIWRAP_PCR3_THSPREP6               ((uint32_t)0x00400000)
#define DSIWRAP_PCR3_THSPREP7               ((uint32_t)0x00800000)

#define DSIWRAP_PCR3_THSTRAIL               ((uint32_t)0xFF000000)              /*!< t-HSTRAIL */
#define DSIWRAP_PCR3_THSTRAIL0              ((uint32_t)0x01000000)
#define DSIWRAP_PCR3_THSTRAIL1              ((uint32_t)0x02000000)
#define DSIWRAP_PCR3_THSTRAIL2              ((uint32_t)0x04000000)
#define DSIWRAP_PCR3_THSTRAIL3              ((uint32_t)0x08000000)
#define DSIWRAP_PCR3_THSTRAIL4              ((uint32_t)0x10000000)
#define DSIWRAP_PCR3_THSTRAIL5              ((uint32_t)0x20000000)
#define DSIWRAP_PCR3_THSTRAIL6              ((uint32_t)0x40000000)
#define DSIWRAP_PCR3_THSTRAIL7              ((uint32_t)0x80000000)

/*******************  Bit definition for DSIWRAP_PCR4 register  ***************/
#define DSIWRAP_PCR4_THSZERO                ((uint32_t)0x000000FF)              /*!< t-HSZERO */
#define DSIWRAP_PCR4_THSZERO0               ((uint32_t)0x00000001)
#define DSIWRAP_PCR4_THSZERO1               ((uint32_t)0x00000002)
#define DSIWRAP_PCR4_THSZERO2               ((uint32_t)0x00000004)
#define DSIWRAP_PCR4_THSZERO3               ((uint32_t)0x00000008)
#define DSIWRAP_PCR4_THSZERO4               ((uint32_t)0x00000010)
#define DSIWRAP_PCR4_THSZERO5               ((uint32_t)0x00000020)
#define DSIWRAP_PCR4_THSZERO6               ((uint32_t)0x00000040)
#define DSIWRAP_PCR4_THSZERO7               ((uint32_t)0x00000080)

#define DSIWRAP_PCR4_TLPXD                  ((uint32_t)0x0000FF00)              /*!< t-LPXD */
#define DSIWRAP_PCR4_TLPXD0                 ((uint32_t)0x00000100)
#define DSIWRAP_PCR4_TLPXD1                 ((uint32_t)0x00000200)
#define DSIWRAP_PCR4_TLPXD2                 ((uint32_t)0x00000400)
#define DSIWRAP_PCR4_TLPXD3                 ((uint32_t)0x00000800)
#define DSIWRAP_PCR4_TLPXD4                 ((uint32_t)0x00001000)
#define DSIWRAP_PCR4_TLPXD5                 ((uint32_t)0x00002000)
#define DSIWRAP_PCR4_TLPXD6                 ((uint32_t)0x00004000)
#define DSIWRAP_PCR4_TLPXD7                 ((uint32_t)0x00008000)

#define DSIWRAP_PCR4_THSEXIT                ((uint32_t)0x00FF0000)              /*!< t-HSEXIT */
#define DSIWRAP_PCR4_THSEXIT0               ((uint32_t)0x00010000)
#define DSIWRAP_PCR4_THSEXIT1               ((uint32_t)0x00020000)
#define DSIWRAP_PCR4_THSEXIT2               ((uint32_t)0x00040000)
#define DSIWRAP_PCR4_THSEXIT3               ((uint32_t)0x00080000)
#define DSIWRAP_PCR4_THSEXIT4               ((uint32_t)0x00100000)
#define DSIWRAP_PCR4_THSEXIT5               ((uint32_t)0x00200000)
#define DSIWRAP_PCR4_THSEXIT6               ((uint32_t)0x00400000)
#define DSIWRAP_PCR4_THSEXIT7               ((uint32_t)0x00800000)

#define DSIWRAP_PCR4_TLPXC                  ((uint32_t)0xFF000000)              /*!< t-LPXC */
#define DSIWRAP_PCR4_TLPXC0                 ((uint32_t)0x01000000)
#define DSIWRAP_PCR4_TLPXC1                 ((uint32_t)0x02000000)
#define DSIWRAP_PCR4_TLPXC2                 ((uint32_t)0x04000000)
#define DSIWRAP_PCR4_TLPXC3                 ((uint32_t)0x08000000)
#define DSIWRAP_PCR4_TLPXC4                 ((uint32_t)0x10000000)
#define DSIWRAP_PCR4_TLPXC5                 ((uint32_t)0x20000000)
#define DSIWRAP_PCR4_TLPXC6                 ((uint32_t)0x40000000)
#define DSIWRAP_PCR4_TLPXC7                 ((uint32_t)0x80000000)

