cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
/*******************  Bits definition for FLASH_FBOOT7_CUR register  *****************/
#define FLASH_FBOOT7_CUR_BOOT_CM7_ADD0           ((uint32_t)0x0000FFFF)
#define FLASH_FBOOT7_CUR_BOOT_CM7_ADD1           ((uint32_t)0xFFFF0000)

/*******************  Bits definition for FLASH_FBOOT7_PRG register  *****************/
#define FLASH_FBOOT7_PRG_BOOT_CM7_ADD0           ((uint32_t)0x0000FFFF)
#define FLASH_FBOOT7_PRG_BOOT_CM7_ADD1           ((uint32_t)0xFFFF0000)

/*******************  Bits definition for FLASH_FBOOT4_CUR register  *****************/
#define FLASH_FBOOT4_CUR_BOOT_CM4_ADD0           ((uint32_t)0x0000FFFF)
#define FLASH_FBOOT4_CUR_BOOT_CM4_ADD1           ((uint32_t)0xFFFF0000)

/*******************  Bits definition for FLASH_FBOOT4_PRG register  *****************/
#define FLASH_FBOOT4_PRG_BOOT_CM4_ADD0           ((uint32_t)0x0000FFFF)
#define FLASH_FBOOT4_PRG_BOOT_CM4_ADD1           ((uint32_t)0xFFFF0000)

/*******************  Bits definition for FLASH_FDBFLADD_A register  *****************/
#define FLASH_FDBFLADD_A_ADDR_FAIL_DB_DETECT_A   ((uint32_t)0x000FFFFF)

/*******************  Bits definition for FLASH_FKEYR_B register  *****************/
#define FLASH_FKEYR_B_KEYR_B                     ((uint32_t)0xFFFFFFFF)

/*******************  Bits definition for FLASH_FSR_B register  *****************/
#define FLASH_FSR_B_BSY_B                    ((uint32_t)0x00000001)
#define FLASH_FSR_B_WDW_B                    ((uint32_t)0x00000002)
#define FLASH_FSR_B_QW_B                     ((uint32_t)0x00000004)
#define FLASH_FSR_B_FAIL_FLASH_B             ((uint32_t)0x00000008)
#define FLASH_FSR_B_EOP_B                    ((uint32_t)0x00010000)
#define FLASH_FSR_B_WRPERR_B                 ((uint32_t)0x00020000)
#define FLASH_FSR_B_PGSERR_B                 ((uint32_t)0x00040000)
#define FLASH_FSR_B_PGAERR_B                 ((uint32_t)0x00080000)
#define FLASH_FSR_B_NDELERR_B                ((uint32_t)0x00100000)
#define FLASH_FSR_B_INCERR_B                 ((uint32_t)0x00200000)
#define FLASH_FSR_B_OPERR_B                  ((uint32_t)0x00400000)
#define FLASH_FSR_B_RDPERR_B                 ((uint32_t)0x00800000)
#define FLASH_FSR_B_RDSERR_B                 ((uint32_t)0x01000000)
#define FLASH_FSR_B_SNECCERR_B               ((uint32_t)0x02000000)
#define FLASH_FSR_B_DBECCERR_B               ((uint32_t)0x04000000)

/*******************  Bits definition for FLASH_FCR_B register  *****************/
#define FLASH_FCR_B_LOCK_B                   ((uint32_t)0x00000001)
#define FLASH_FCR_B_PG_B                     ((uint32_t)0x00000002)
#define FLASH_FCR_B_SER_B                    ((uint32_t)0x00000004)
#define FLASH_FCR_B_BER_B                    ((uint32_t)0x00000008)
#define FLASH_FCR_B_SSN_B                    ((uint32_t)0x00000070)
#define FLASH_FCR_B_SSN_B_0                  ((uint32_t)0x00000010)
#define FLASH_FCR_B_SSN_B_1                  ((uint32_t)0x00000020)
#define FLASH_FCR_B_SSN_B_2                  ((uint32_t)0x00000040)
#define FLASH_FCR_B_PSIZE_B                  ((uint32_t)0x00000030)
#define FLASH_FCR_B_PSIZE_B_0                ((uint32_t)0x00000100)
#define FLASH_FCR_B_PSIZE_B_1                ((uint32_t)0x00000200)
#define FLASH_FCR_B_FW_B                     ((uint32_t)0x00000040)
#define FLASH_FCR_B_STRT_B                   ((uint32_t)0x00000020)
#define FLASH_FCR_B_EOPIE_B                  ((uint32_t)0x00010000)
#define FLASH_FCR_B_WRPERRIE_B               ((uint32_t)0x00020000)
#define FLASH_FCR_B_PGSERRIE_B               ((uint32_t)0x00040000)
#define FLASH_FCR_B_PGAERRIE_B               ((uint32_t)0x00080000)
#define FLASH_FCR_B_NDELERRIE_B              ((uint32_t)0x00100000)
#define FLASH_FCR_B_INCERRIE_B               ((uint32_t)0x00200000)
#define FLASH_FCR_B_OPERRIE_B                ((uint32_t)0x00400000)
#define FLASH_FCR_B_RDPERRIE_B               ((uint32_t)0x00800000)
#define FLASH_FCR_B_RDSERRIE_B               ((uint32_t)0x01000000)
#define FLASH_FCR_B_SNECCERRIE_B             ((uint32_t)0x02000000)
#define FLASH_FCR_B_DBECCERRIE_B             ((uint32_t)0x04000000)

/*******************  Bits definition for FLASH_FPRAR_CUR_B register  *****************/
#define FLASH_FPRAR_CUR_B_PROT_AREA_START_B      ((uint32_t)0x00000FFF)
#define FLASH_FPRAR_CUR_B_PROT_AREA_END_B        ((uint32_t)0x0FFF0000)
#define FLASH_FPRAR_CUR_B_DMEP_B                 ((uint32_t)0x80000000)

/*******************  Bits definition for FLASH_FPRAR_PRG_B register  *****************/
#define FLASH_FPRAR_PRG_B_PROT_AREA_START_B      ((uint32_t)0x00000FFF)
#define FLASH_FPRAR_PRG_B_PROT_AREA_END_B        ((uint32_t)0x0FFF0000)
#define FLASH_FPRAR_PRG_B_DMEP_B                 ((uint32_t)0x80000000)

/*******************  Bits definition for FLASH_FSCAR_CUR_B register  *****************/
#define FLASH_FSCAR_CUR_B_SEC_AREA_START_B       ((uint32_t)0x00000FFF)
#define FLASH_FSCAR_CUR_B_SEC_AREA_END_B         ((uint32_t)0x0FFF0000)
#define FLASH_FSCAR_CUR_B_DMES_B                 ((uint32_t)0x80000000)

/*******************  Bits definition for FLASH_FSCAR_PRG_B register  *****************/
#define FLASH_FSCAR_PRG_B_SEC_AREA_START_B       ((uint32_t)0x00000FFF)
#define FLASH_FSCAR_PRG_B_SEC_AREA_END_B         ((uint32_t)0x0FFF0000)
#define FLASH_FSCAR_PRG_B_DMES_B                 ((uint32_t)0x80000000)

/*******************  Bits definition for FLASH_FWRPN_CUR_B register  *****************/
#define FLASH_FWRPN_CUR_B_WRPSN_B                ((uint32_t)0x000000FF)

/*******************  Bits definition for FLASH_FWRPN_PRG_A register  *****************/
#define FLASH_FWRPN_PRG_B_WRPSN_B                ((uint32_t)0x000000FF)

/*******************  Bits definition for FLASH_FDBFLADD_B register  *****************/
#define FLASH_FDBFLADD_B_ADDR_FAIL_DB_DETECT_B   ((uint32_t)0x000FFFFF)

/*******************  Bits definition for FLASH_FENGI_CNFW register  *****************/
#define FLASH_FENGI_CNFW_WRITE_START             ((uint32_t)0x00000001)
#define FLASH_FENGI_CNFW_PREPARE                 ((uint32_t)0x00000002)
#define FLASH_FENGI_CNFW_WRITE_ECC               ((uint32_t)0x00000004)
#define FLASH_FENGI_CNFW_ONLY_ECC                ((uint32_t)0x00000008)
#define FLASH_FENGI_CNFW_N_ENGI                  ((uint32_t)0x00000070)
#define FLASH_FENGI_CNFW_N_ENGI_0                ((uint32_t)0x00000010)
#define FLASH_FENGI_CNFW_N_ENGI_1                ((uint32_t)0x00000020)
#define FLASH_FENGI_CNFW_N_ENGI_2                ((uint32_t)0x00000040)
#define FLASH_FENGI_CNFW_N_WORD                  ((uint32_t)0x00000700)
#define FLASH_FENGI_CNFW_N_WORD_0                ((uint32_t)0x00000100)
#define FLASH_FENGI_CNFW_N_WORD_1                ((uint32_t)0x00000200)
#define FLASH_FENGI_CNFW_N_WORD_2                ((uint32_t)0x00000400)
#define FLASH_FENGI_CNFW_ENGI_VALUE              ((uint32_t)0xFFFF0000)

/*******************  Bits definition for FLASH_FOPT_CNFW register  *****************/
#define FLASH_FOPT_CNFW_WRITE_START              ((uint32_t)0x00000001)
#define FLASH_FOPT_CNFW_PREPARE                  ((uint32_t)0x00000002)
#define FLASH_FOPT_CNFW_WRITE_ECC                ((uint32_t)0x00000004)
#define FLASH_FOPT_CNFW_ONLY_ECC                 ((uint32_t)0x00000008)
#define FLASH_FOPT_CNFW_N_OPT                    ((uint32_t)0x00000070)
#define FLASH_FOPT_CNFW_N_OPT_0                  ((uint32_t)0x00000010)
#define FLASH_FOPT_CNFW_N_OPT_1                  ((uint32_t)0x00000020)
#define FLASH_FOPT_CNFW_N_OPT_2                  ((uint32_t)0x00000040)
#define FLASH_FOPT_CNFW_N_WORD                   ((uint32_t)0x00000700)
#define FLASH_FOPT_CNFW_N_WORD_0                 ((uint32_t)0x00000100)
#define FLASH_FOPT_CNFW_N_WORD_1                 ((uint32_t)0x00000200)
#define FLASH_FOPT_CNFW_N_WORD_2                 ((uint32_t)0x00000400)
#define FLASH_FOPT_CNFW_OPT_VALUE                ((uint32_t)0xFFFF0000)

/*******************  Bits definition for FLASH_FTSTCR register  *****************/
#define FLASH_FTSTCR_ECC_CONF                   ((uint32_t)0x00000003)
#define FLASH_FTSTCR_ECC_CONF_0                 ((uint32_t)0x00000001)
#define FLASH_FTSTCR_ECC_CONF_1                 ((uint32_t)0x00000002)
#define FLASH_FTSTCR_ECC_EN                     ((uint32_t)0x00010000)

