cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
/********************  Bit definition for HSEM_ICR0 register  *****************/
#define  HSEM_ICR0_ISEM0                       ((uint32_t)0x00000001)           /*!<semaphore 0 , interrupt 0 clear bit.  */
#define  HSEM_ICR0_ISEM1                       ((uint32_t)0x00000002)           /*!<semaphore 1 , interrupt 0 clear bit.  */
#define  HSEM_ICR0_ISEM2                       ((uint32_t)0x00000004)           /*!<semaphore 2 , interrupt 0 clear bit.  */
#define  HSEM_ICR0_ISEM3                       ((uint32_t)0x00000008)           /*!<semaphore 3 , interrupt 0 clear bit.  */
#define  HSEM_ICR0_ISEM4                       ((uint32_t)0x00000010)           /*!<semaphore 4 , interrupt 0 clear bit.  */
#define  HSEM_ICR0_ISEM5                       ((uint32_t)0x00000020)           /*!<semaphore 5 interrupt 0 clear bit.  */
#define  HSEM_ICR0_ISEM6                       ((uint32_t)0x00000040)           /*!<semaphore 6 interrupt 0 clear bit.  */
#define  HSEM_ICR0_ISEM7                       ((uint32_t)0x00000080)           /*!<semaphore 7 interrupt 0 clear bit.  */
#define  HSEM_ICR0_ISEM8                       ((uint32_t)0x00000100)           /*!<semaphore 8 interrupt 0 clear bit.  */
#define  HSEM_ICR0_ISEM9                       ((uint32_t)0x00000200)           /*!<semaphore 9 interrupt 0 clear bit.  */
#define  HSEM_ICR0_ISEM10                      ((uint32_t)0x00000400)           /*!<semaphore 10 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM11                      ((uint32_t)0x00000800)           /*!<semaphore 11 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM12                      ((uint32_t)0x00001000)           /*!<semaphore 12 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM13                      ((uint32_t)0x00002000)           /*!<semaphore 13 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM14                      ((uint32_t)0x00004000)           /*!<semaphore 14 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM15                      ((uint32_t)0x00008000)           /*!<semaphore 15 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM16                      ((uint32_t)0x00010000)           /*!<semaphore 16 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM17                      ((uint32_t)0x00020000)           /*!<semaphore 17 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM18                      ((uint32_t)0x00040000)           /*!<semaphore 18 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM19                      ((uint32_t)0x00080000)           /*!<semaphore 19 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM20                      ((uint32_t)0x00100000)           /*!<semaphore 20 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM21                      ((uint32_t)0x00200000)           /*!<semaphore 21 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM22                      ((uint32_t)0x00400000)           /*!<semaphore 22 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM23                      ((uint32_t)0x00800000)           /*!<semaphore 23 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM24                      ((uint32_t)0x01000000)           /*!<semaphore 24 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM25                      ((uint32_t)0x02000000)           /*!<semaphore 25 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM26                      ((uint32_t)0x04000000)           /*!<semaphore 26 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM27                      ((uint32_t)0x08000000)           /*!<semaphore 27 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM28                      ((uint32_t)0x10000000)           /*!<semaphore 28 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM29                      ((uint32_t)0x20000000)           /*!<semaphore 29 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM30                      ((uint32_t)0x40000000)           /*!<semaphore 30 interrupt 0 clear bit. */
#define  HSEM_ICR0_ISEM31                      ((uint32_t)0x80000000)           /*!<semaphore 31 interrupt 0 clear bit. */

/********************  Bit definition for HSEM_ISR0 register  *****************/
#define  HSEM_ISR0_ISEM0                       ((uint32_t)0x00000001)           /*!<semaphore 0 interrupt 0 status bit.  */
#define  HSEM_ISR0_ISEM1                       ((uint32_t)0x00000002)           /*!<semaphore 1 interrupt 0 status bit.  */
#define  HSEM_ISR0_ISEM2                       ((uint32_t)0x00000004)           /*!<semaphore 2 interrupt 0 status bit.  */
#define  HSEM_ISR0_ISEM3                       ((uint32_t)0x00000008)           /*!<semaphore 3 interrupt 0 status bit.  */
#define  HSEM_ISR0_ISEM4                       ((uint32_t)0x00000010)           /*!<semaphore 4 interrupt 0 status bit.  */
#define  HSEM_ISR0_ISEM5                       ((uint32_t)0x00000020)           /*!<semaphore 5 interrupt 0 status bit.  */
#define  HSEM_ISR0_ISEM6                       ((uint32_t)0x00000040)           /*!<semaphore 6 interrupt 0 status bit.  */
#define  HSEM_ISR0_ISEM7                       ((uint32_t)0x00000080)           /*!<semaphore 7 interrupt 0 status bit.  */
#define  HSEM_ISR0_ISEM8                       ((uint32_t)0x00000100)           /*!<semaphore 8 interrupt 0 status bit.  */
#define  HSEM_ISR0_ISEM9                       ((uint32_t)0x00000200)           /*!<semaphore 9 interrupt 0 status bit.  */
#define  HSEM_ISR0_ISEM10                      ((uint32_t)0x00000400)           /*!<semaphore 10 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM11                      ((uint32_t)0x00000800)           /*!<semaphore 11 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM12                      ((uint32_t)0x00001000)           /*!<semaphore 12 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM13                      ((uint32_t)0x00002000)           /*!<semaphore 13 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM14                      ((uint32_t)0x00004000)           /*!<semaphore 14 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM15                      ((uint32_t)0x00008000)           /*!<semaphore 15 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM16                      ((uint32_t)0x00010000)           /*!<semaphore 16 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM17                      ((uint32_t)0x00020000)           /*!<semaphore 17 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM18                      ((uint32_t)0x00040000)           /*!<semaphore 18 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM19                      ((uint32_t)0x00080000)           /*!<semaphore 19 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM20                      ((uint32_t)0x00100000)           /*!<semaphore 20 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM21                      ((uint32_t)0x00200000)           /*!<semaphore 21 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM22                      ((uint32_t)0x00400000)           /*!<semaphore 22 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM23                      ((uint32_t)0x00800000)           /*!<semaphore 23 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM24                      ((uint32_t)0x01000000)           /*!<semaphore 24 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM25                      ((uint32_t)0x02000000)           /*!<semaphore 25 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM26                      ((uint32_t)0x04000000)           /*!<semaphore 26 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM27                      ((uint32_t)0x08000000)           /*!<semaphore 27 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM28                      ((uint32_t)0x10000000)           /*!<semaphore 28 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM29                      ((uint32_t)0x20000000)           /*!<semaphore 29 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM30                      ((uint32_t)0x40000000)           /*!<semaphore 30 interrupt 0 status bit. */
#define  HSEM_ISR0_ISEM31                      ((uint32_t)0x80000000)           /*!<semaphore 31 interrupt 0 status bit. */

/********************  Bit definition for HSEM_MISR0 register  *****************/
#define  HSEM_MISR0_ISEM0                       ((uint32_t)0x00000001)           /*!<semaphore 0 interrupt 0 masked status bit.  */
#define  HSEM_MISR0_ISEM1                       ((uint32_t)0x00000002)           /*!<semaphore 1 interrupt 0 masked status bit.  */
#define  HSEM_MISR0_ISEM2                       ((uint32_t)0x00000004)           /*!<semaphore 2 interrupt 0 masked status bit.  */
#define  HSEM_MISR0_ISEM3                       ((uint32_t)0x00000008)           /*!<semaphore 3 interrupt 0 masked status bit.  */
#define  HSEM_MISR0_ISEM4                       ((uint32_t)0x00000010)           /*!<semaphore 4 interrupt 0 masked status bit.  */
#define  HSEM_MISR0_ISEM5                       ((uint32_t)0x00000020)           /*!<semaphore 5 interrupt 0 masked status bit.  */
#define  HSEM_MISR0_ISEM6                       ((uint32_t)0x00000040)           /*!<semaphore 6 interrupt 0 masked status bit.  */
#define  HSEM_MISR0_ISEM7                       ((uint32_t)0x00000080)           /*!<semaphore 7 interrupt 0 masked status bit.  */
#define  HSEM_MISR0_ISEM8                       ((uint32_t)0x00000100)           /*!<semaphore 8 interrupt 0 masked status bit.  */
#define  HSEM_MISR0_ISEM9                       ((uint32_t)0x00000200)           /*!<semaphore 9 interrupt 0 masked status bit.  */
#define  HSEM_MISR0_ISEM10                      ((uint32_t)0x00000400)           /*!<semaphore 10 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM11                      ((uint32_t)0x00000800)           /*!<semaphore 11 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM12                      ((uint32_t)0x00001000)           /*!<semaphore 12 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM13                      ((uint32_t)0x00002000)           /*!<semaphore 13 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM14                      ((uint32_t)0x00004000)           /*!<semaphore 14 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM15                      ((uint32_t)0x00008000)           /*!<semaphore 15 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM16                      ((uint32_t)0x00010000)           /*!<semaphore 16 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM17                      ((uint32_t)0x00020000)           /*!<semaphore 17 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM18                      ((uint32_t)0x00040000)           /*!<semaphore 18 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM19                      ((uint32_t)0x00080000)           /*!<semaphore 19 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM20                      ((uint32_t)0x00100000)           /*!<semaphore 20 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM21                      ((uint32_t)0x00200000)           /*!<semaphore 21 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM22                      ((uint32_t)0x00400000)           /*!<semaphore 22 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM23                      ((uint32_t)0x00800000)           /*!<semaphore 23 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM24                      ((uint32_t)0x01000000)           /*!<semaphore 24 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM25                      ((uint32_t)0x02000000)           /*!<semaphore 25 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM26                      ((uint32_t)0x04000000)           /*!<semaphore 26 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM27                      ((uint32_t)0x08000000)           /*!<semaphore 27 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM28                      ((uint32_t)0x10000000)           /*!<semaphore 28 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM29                      ((uint32_t)0x20000000)           /*!<semaphore 29 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM30                      ((uint32_t)0x40000000)           /*!<semaphore 30 interrupt 0 masked status bit. */
#define  HSEM_MISR0_ISEM31                      ((uint32_t)0x80000000)           /*!<semaphore 31 interrupt 0 masked status bit. */

/********************  Bit definition for HSEM_IER1 register  *****************/
#define  HSEM_IER1_ISEM0                       ((uint32_t)0x00000001)           /*!<semaphore 0 , interrupt 1 enable bit.  */
#define  HSEM_IER1_ISEM1                       ((uint32_t)0x00000002)           /*!<semaphore 1 , interrupt 1 enable bit.  */
#define  HSEM_IER1_ISEM2                       ((uint32_t)0x00000004)           /*!<semaphore 2 , interrupt 1 enable bit.  */
#define  HSEM_IER1_ISEM3                       ((uint32_t)0x00000008)           /*!<semaphore 3 , interrupt 1 enable bit.  */
#define  HSEM_IER1_ISEM4                       ((uint32_t)0x00000010)           /*!<semaphore 4 , interrupt 1 enable bit.  */
#define  HSEM_IER1_ISEM5                       ((uint32_t)0x00000020)           /*!<semaphore 5 interrupt 1 enable bit.  */
#define  HSEM_IER1_ISEM6                       ((uint32_t)0x00000040)           /*!<semaphore 6 interrupt 1 enable bit.  */
#define  HSEM_IER1_ISEM7                       ((uint32_t)0x00000080)           /*!<semaphore 7 interrupt 1 enable bit.  */
#define  HSEM_IER1_ISEM8                       ((uint32_t)0x00000100)           /*!<semaphore 8 interrupt 1 enable bit.  */
#define  HSEM_IER1_ISEM9                       ((uint32_t)0x00000200)           /*!<semaphore 9 interrupt 1 enable bit.  */
#define  HSEM_IER1_ISEM10                      ((uint32_t)0x00000400)           /*!<semaphore 10 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM11                      ((uint32_t)0x00000800)           /*!<semaphore 11 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM12                      ((uint32_t)0x00001000)           /*!<semaphore 12 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM13                      ((uint32_t)0x00002000)           /*!<semaphore 13 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM14                      ((uint32_t)0x00004000)           /*!<semaphore 14 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM15                      ((uint32_t)0x00008000)           /*!<semaphore 15 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM16                      ((uint32_t)0x00010000)           /*!<semaphore 16 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM17                      ((uint32_t)0x00020000)           /*!<semaphore 17 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM18                      ((uint32_t)0x00040000)           /*!<semaphore 18 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM19                      ((uint32_t)0x00080000)           /*!<semaphore 19 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM20                      ((uint32_t)0x00100000)           /*!<semaphore 20 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM21                      ((uint32_t)0x00200000)           /*!<semaphore 21 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM22                      ((uint32_t)0x00400000)           /*!<semaphore 22 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM23                      ((uint32_t)0x00800000)           /*!<semaphore 23 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM24                      ((uint32_t)0x01000000)           /*!<semaphore 24 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM25                      ((uint32_t)0x02000000)           /*!<semaphore 25 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM26                      ((uint32_t)0x04000000)           /*!<semaphore 26 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM27                      ((uint32_t)0x08000000)           /*!<semaphore 27 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM28                      ((uint32_t)0x10000000)           /*!<semaphore 28 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM29                      ((uint32_t)0x20000000)           /*!<semaphore 29 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM30                      ((uint32_t)0x40000000)           /*!<semaphore 30 interrupt 1 enable bit. */
#define  HSEM_IER1_ISEM31                      ((uint32_t)0x80000000)           /*!<semaphore 31 interrupt 1 enable bit. */

