cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
/********************  Bit definition for HSEM_ICR1 register  *****************/
#define  HSEM_ICR1_ISEM0                       ((uint32_t)0x00000001)           /*!<semaphore 0 , interrupt 1 clear bit.  */
#define  HSEM_ICR1_ISEM1                       ((uint32_t)0x00000002)           /*!<semaphore 1 , interrupt 1 clear bit.  */
#define  HSEM_ICR1_ISEM2                       ((uint32_t)0x00000004)           /*!<semaphore 2 , interrupt 1 clear bit.  */
#define  HSEM_ICR1_ISEM3                       ((uint32_t)0x00000008)           /*!<semaphore 3 , interrupt 1 clear bit.  */
#define  HSEM_ICR1_ISEM4                       ((uint32_t)0x00000010)           /*!<semaphore 4 , interrupt 1 clear bit.  */
#define  HSEM_ICR1_ISEM5                       ((uint32_t)0x00000020)           /*!<semaphore 5 interrupt 1 clear bit.  */
#define  HSEM_ICR1_ISEM6                       ((uint32_t)0x00000040)           /*!<semaphore 6 interrupt 1 clear bit.  */
#define  HSEM_ICR1_ISEM7                       ((uint32_t)0x00000080)           /*!<semaphore 7 interrupt 1 clear bit.  */
#define  HSEM_ICR1_ISEM8                       ((uint32_t)0x00000100)           /*!<semaphore 8 interrupt 1 clear bit.  */
#define  HSEM_ICR1_ISEM9                       ((uint32_t)0x00000200)           /*!<semaphore 9 interrupt 1 clear bit.  */
#define  HSEM_ICR1_ISEM10                      ((uint32_t)0x00000400)           /*!<semaphore 10 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM11                      ((uint32_t)0x00000800)           /*!<semaphore 11 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM12                      ((uint32_t)0x00001000)           /*!<semaphore 12 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM13                      ((uint32_t)0x00002000)           /*!<semaphore 13 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM14                      ((uint32_t)0x00004000)           /*!<semaphore 14 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM15                      ((uint32_t)0x00008000)           /*!<semaphore 15 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM16                      ((uint32_t)0x00010000)           /*!<semaphore 16 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM17                      ((uint32_t)0x00020000)           /*!<semaphore 17 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM18                      ((uint32_t)0x00040000)           /*!<semaphore 18 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM19                      ((uint32_t)0x00080000)           /*!<semaphore 19 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM20                      ((uint32_t)0x00100000)           /*!<semaphore 20 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM21                      ((uint32_t)0x00200000)           /*!<semaphore 21 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM22                      ((uint32_t)0x00400000)           /*!<semaphore 22 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM23                      ((uint32_t)0x00800000)           /*!<semaphore 23 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM24                      ((uint32_t)0x01000000)           /*!<semaphore 24 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM25                      ((uint32_t)0x02000000)           /*!<semaphore 25 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM26                      ((uint32_t)0x04000000)           /*!<semaphore 26 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM27                      ((uint32_t)0x08000000)           /*!<semaphore 27 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM28                      ((uint32_t)0x10000000)           /*!<semaphore 28 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM29                      ((uint32_t)0x20000000)           /*!<semaphore 29 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM30                      ((uint32_t)0x40000000)           /*!<semaphore 30 interrupt 1 clear bit. */
#define  HSEM_ICR1_ISEM31                      ((uint32_t)0x80000000)           /*!<semaphore 31 interrupt 1 clear bit. */

/********************  Bit definition for HSEM_ISR1 register  *****************/
#define  HSEM_ISR1_ISEM0                       ((uint32_t)0x00000001)           /*!<semaphore 0 interrupt 1 status bit.  */
#define  HSEM_ISR1_ISEM1                       ((uint32_t)0x00000002)           /*!<semaphore 1 interrupt 1 status bit.  */
#define  HSEM_ISR1_ISEM2                       ((uint32_t)0x00000004)           /*!<semaphore 2 interrupt 1 status bit.  */
#define  HSEM_ISR1_ISEM3                       ((uint32_t)0x00000008)           /*!<semaphore 3 interrupt 1 status bit.  */
#define  HSEM_ISR1_ISEM4                       ((uint32_t)0x00000010)           /*!<semaphore 4 interrupt 1 status bit.  */
#define  HSEM_ISR1_ISEM5                       ((uint32_t)0x00000020)           /*!<semaphore 5 interrupt 1 status bit.  */
#define  HSEM_ISR1_ISEM6                       ((uint32_t)0x00000040)           /*!<semaphore 6 interrupt 1 status bit.  */
#define  HSEM_ISR1_ISEM7                       ((uint32_t)0x00000080)           /*!<semaphore 7 interrupt 1 status bit.  */
#define  HSEM_ISR1_ISEM8                       ((uint32_t)0x00000100)           /*!<semaphore 8 interrupt 1 status bit.  */
#define  HSEM_ISR1_ISEM9                       ((uint32_t)0x00000200)           /*!<semaphore 9 interrupt 1 status bit.  */
#define  HSEM_ISR1_ISEM10                      ((uint32_t)0x00000400)           /*!<semaphore 10 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM11                      ((uint32_t)0x00000800)           /*!<semaphore 11 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM12                      ((uint32_t)0x00001000)           /*!<semaphore 12 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM13                      ((uint32_t)0x00002000)           /*!<semaphore 13 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM14                      ((uint32_t)0x00004000)           /*!<semaphore 14 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM15                      ((uint32_t)0x00008000)           /*!<semaphore 15 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM16                      ((uint32_t)0x00010000)           /*!<semaphore 16 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM17                      ((uint32_t)0x00020000)           /*!<semaphore 17 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM18                      ((uint32_t)0x00040000)           /*!<semaphore 18 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM19                      ((uint32_t)0x00080000)           /*!<semaphore 19 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM20                      ((uint32_t)0x00100000)           /*!<semaphore 20 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM21                      ((uint32_t)0x00200000)           /*!<semaphore 21 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM22                      ((uint32_t)0x00400000)           /*!<semaphore 22 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM23                      ((uint32_t)0x00800000)           /*!<semaphore 23 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM24                      ((uint32_t)0x01000000)           /*!<semaphore 24 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM25                      ((uint32_t)0x02000000)           /*!<semaphore 25 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM26                      ((uint32_t)0x04000000)           /*!<semaphore 26 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM27                      ((uint32_t)0x08000000)           /*!<semaphore 27 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM28                      ((uint32_t)0x10000000)           /*!<semaphore 28 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM29                      ((uint32_t)0x20000000)           /*!<semaphore 29 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM30                      ((uint32_t)0x40000000)           /*!<semaphore 30 interrupt 1 status bit. */
#define  HSEM_ISR1_ISEM31                      ((uint32_t)0x80000000)           /*!<semaphore 31 interrupt 1 status bit. */

/********************  Bit definition for HSEM_MISR1 register  *****************/
#define  HSEM_MISR1_ISEM0                       ((uint32_t)0x00000001)           /*!<semaphore 0 interrupt 1 masked status bit.  */
#define  HSEM_MISR1_ISEM1                       ((uint32_t)0x00000002)           /*!<semaphore 1 interrupt 1 masked status bit.  */
#define  HSEM_MISR1_ISEM2                       ((uint32_t)0x00000004)           /*!<semaphore 2 interrupt 1 masked status bit.  */
#define  HSEM_MISR1_ISEM3                       ((uint32_t)0x00000008)           /*!<semaphore 3 interrupt 1 masked status bit.  */
#define  HSEM_MISR1_ISEM4                       ((uint32_t)0x00000010)           /*!<semaphore 4 interrupt 1 masked status bit.  */
#define  HSEM_MISR1_ISEM5                       ((uint32_t)0x00000020)           /*!<semaphore 5 interrupt 1 masked status bit.  */
#define  HSEM_MISR1_ISEM6                       ((uint32_t)0x00000040)           /*!<semaphore 6 interrupt 1 masked status bit.  */
#define  HSEM_MISR1_ISEM7                       ((uint32_t)0x00000080)           /*!<semaphore 7 interrupt 1 masked status bit.  */
#define  HSEM_MISR1_ISEM8                       ((uint32_t)0x00000100)           /*!<semaphore 8 interrupt 1 masked status bit.  */
#define  HSEM_MISR1_ISEM9                       ((uint32_t)0x00000200)           /*!<semaphore 9 interrupt 1 masked status bit.  */
#define  HSEM_MISR1_ISEM10                      ((uint32_t)0x00000400)           /*!<semaphore 10 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM11                      ((uint32_t)0x00000800)           /*!<semaphore 11 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM12                      ((uint32_t)0x00001000)           /*!<semaphore 12 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM13                      ((uint32_t)0x00002000)           /*!<semaphore 13 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM14                      ((uint32_t)0x00004000)           /*!<semaphore 14 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM15                      ((uint32_t)0x00008000)           /*!<semaphore 15 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM16                      ((uint32_t)0x00010000)           /*!<semaphore 16 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM17                      ((uint32_t)0x00020000)           /*!<semaphore 17 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM18                      ((uint32_t)0x00040000)           /*!<semaphore 18 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM19                      ((uint32_t)0x00080000)           /*!<semaphore 19 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM20                      ((uint32_t)0x00100000)           /*!<semaphore 20 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM21                      ((uint32_t)0x00200000)           /*!<semaphore 21 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM22                      ((uint32_t)0x00400000)           /*!<semaphore 22 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM23                      ((uint32_t)0x00800000)           /*!<semaphore 23 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM24                      ((uint32_t)0x01000000)           /*!<semaphore 24 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM25                      ((uint32_t)0x02000000)           /*!<semaphore 25 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM26                      ((uint32_t)0x04000000)           /*!<semaphore 26 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM27                      ((uint32_t)0x08000000)           /*!<semaphore 27 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM28                      ((uint32_t)0x10000000)           /*!<semaphore 28 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM29                      ((uint32_t)0x20000000)           /*!<semaphore 29 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM30                      ((uint32_t)0x40000000)           /*!<semaphore 30 interrupt 1 masked status bit. */
#define  HSEM_MISR1_ISEM31                      ((uint32_t)0x80000000)           /*!<semaphore 31 interrupt 1 masked status bit. */

/********************  Bit definition for HSEM_CR register  *****************/
#define  HSEM_CR_COREID                         ((uint32_t)0x0000FF00)           /*!<CoreID of semaphores to be cleared. */
#define  HSEM_CR_KEY                            ((uint32_t)0xFFFF0000)           /*!<semaphores clear key. */

/********************  Bit definition for HSEM_KEYR register  *****************/
#define  HSEM_KEYR_KEY                          ((uint32_t)0xFFFF0000)           /*!<semaphores clear key. */

/******************************************************************************/
/*                                                                            */
/*                                    HASH                                    */
/*                                                                            */
/******************************************************************************/
/******************  Bits definition for HASH_CR register  ********************/
#define HASH_CR_INIT                         ((uint32_t)0x00000004)
#define HASH_CR_DMAE                         ((uint32_t)0x00000008)
#define HASH_CR_DATATYPE                     ((uint32_t)0x00000030)
#define HASH_CR_DATATYPE_0                   ((uint32_t)0x00000010)
#define HASH_CR_DATATYPE_1                   ((uint32_t)0x00000020)
#define HASH_CR_MODE                         ((uint32_t)0x00000040)
#define HASH_CR_ALGO                         ((uint32_t)0x00040080)
#define HASH_CR_ALGO_0                       ((uint32_t)0x00000080)
#define HASH_CR_ALGO_1                       ((uint32_t)0x00040000)
#define HASH_CR_NBW                          ((uint32_t)0x00000F00)
#define HASH_CR_NBW_0                        ((uint32_t)0x00000100)
#define HASH_CR_NBW_1                        ((uint32_t)0x00000200)
#define HASH_CR_NBW_2                        ((uint32_t)0x00000400)
#define HASH_CR_NBW_3                        ((uint32_t)0x00000800)
#define HASH_CR_DINNE                        ((uint32_t)0x00001000)
#define HASH_CR_MDMAT                        ((uint32_t)0x00002000)
#define HASH_CR_LKEY                         ((uint32_t)0x00010000)

