cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
/******************  Bit definition for I2C_ISR register  *********************/
#define  I2C_ISR_TXE                         ((uint32_t)0x00000001)        /*!< Transmit data register empty */
#define  I2C_ISR_TXIS                        ((uint32_t)0x00000002)        /*!< Transmit interrupt status */
#define  I2C_ISR_RXNE                        ((uint32_t)0x00000004)        /*!< Receive data register not empty */
#define  I2C_ISR_ADDR                        ((uint32_t)0x00000008)        /*!< Address matched (slave mode)*/
#define  I2C_ISR_NACKF                       ((uint32_t)0x00000010)        /*!< NACK received flag */
#define  I2C_ISR_STOPF                       ((uint32_t)0x00000020)        /*!< STOP detection flag */
#define  I2C_ISR_TC                          ((uint32_t)0x00000040)        /*!< Transfer complete (master mode) */
#define  I2C_ISR_TCR                         ((uint32_t)0x00000080)        /*!< Transfer complete reload */
#define  I2C_ISR_BERR                        ((uint32_t)0x00000100)        /*!< Bus error */
#define  I2C_ISR_ARLO                        ((uint32_t)0x00000200)        /*!< Arbitration lost */
#define  I2C_ISR_OVR                         ((uint32_t)0x00000400)        /*!< Overrun/Underrun */
#define  I2C_ISR_PECERR                      ((uint32_t)0x00000800)        /*!< PEC error in reception */
#define  I2C_ISR_TIMEOUT                     ((uint32_t)0x00001000)        /*!< Timeout or Tlow detection flag */
#define  I2C_ISR_ALERT                       ((uint32_t)0x00002000)        /*!< SMBus alert */
#define  I2C_ISR_BUSY                        ((uint32_t)0x00008000)        /*!< Bus busy */
#define  I2C_ISR_DIR                         ((uint32_t)0x00010000)        /*!< Transfer direction (slave mode) */
#define  I2C_ISR_ADDCODE                     ((uint32_t)0x00FE0000)        /*!< Address match code (slave mode) */

/******************  Bit definition for I2C_ICR register  *********************/
#define  I2C_ICR_ADDRCF                      ((uint32_t)0x00000008)        /*!< Address matched clear flag */
#define  I2C_ICR_NACKCF                      ((uint32_t)0x00000010)        /*!< NACK clear flag */
#define  I2C_ICR_STOPCF                      ((uint32_t)0x00000020)        /*!< STOP detection clear flag */
#define  I2C_ICR_BERRCF                      ((uint32_t)0x00000100)        /*!< Bus error clear flag */
#define  I2C_ICR_ARLOCF                      ((uint32_t)0x00000200)        /*!< Arbitration lost clear flag */
#define  I2C_ICR_OVRCF                       ((uint32_t)0x00000400)        /*!< Overrun/Underrun clear flag */
#define  I2C_ICR_PECCF                       ((uint32_t)0x00000800)        /*!< PAC error clear flag */
#define  I2C_ICR_TIMOUTCF                    ((uint32_t)0x00001000)        /*!< Timeout clear flag */
#define  I2C_ICR_ALERTCF                     ((uint32_t)0x00002000)        /*!< Alert clear flag */

/******************  Bit definition for I2C_PECR register  *********************/
#define  I2C_PECR_PEC                        ((uint32_t)0x000000FF)        /*!< PEC register */

/******************  Bit definition for I2C_RXDR register  *********************/
#define  I2C_RXDR_RXDATA                     ((uint32_t)0x000000FF)        /*!< 8-bit receive data */

/******************  Bit definition for I2C_TXDR register  *********************/
#define  I2C_TXDR_TXDATA                     ((uint32_t)0x000000FF)        /*!< 8-bit transmit data */

/******************************************************************************/
/*                                                                            */
/*                           Independent WATCHDOG                             */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for IWDG_KR register  ********************/
#define  IWDG_KR_KEY                         ((uint16_t)0xFFFF)            /*!<Key value (write only, read 0000h)  */

/*******************  Bit definition for IWDG_PR register  ********************/
#define  IWDG_PR_PR                          ((uint8_t)0x07)               /*!<PR[2:0] (Prescaler divider)         */
#define  IWDG_PR_PR_0                        ((uint8_t)0x01)               /*!<Bit 0 */
#define  IWDG_PR_PR_1                        ((uint8_t)0x02)               /*!<Bit 1 */
#define  IWDG_PR_PR_2                        ((uint8_t)0x04)               /*!<Bit 2 */

/*******************  Bit definition for IWDG_RLR register  *******************/
#define  IWDG_RLR_RL                         ((uint16_t)0x0FFF)            /*!<Watchdog counter reload value        */

/*******************  Bit definition for IWDG_SR register  ********************/
#define  IWDG_SR_PVU                         ((uint8_t)0x01)               /*!< Watchdog prescaler value update */
#define  IWDG_SR_RVU                         ((uint8_t)0x02)               /*!< Watchdog counter reload value update */
#define  IWDG_SR_WVU                         ((uint8_t)0x04)               /*!< Watchdog counter window value update */

/*******************  Bit definition for IWDG_KR register  ********************/
#define  IWDG_WINR_WIN                         ((uint16_t)0x0FFF)            /*!< Watchdog counter window value */

/******************************************************************************/
/*                                                                            */
/*                        JPEG Encoder/Decoder                                */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for CONFR0 register  ********************/
#define  JPEG_CONFR0_START                       ((uint32_t)0x00000001)        /*!<Start/Stop bit */  

/********************  Bit definition for CONFR1 register  ********************/
#define  JPEG_CONFR1_NF                          ((uint32_t)0x00000003)        /*!<Number of color components */  
#define  JPEG_CONFR1_NF_0                        ((uint32_t)0x00000001)        /*!<Bit 0 */   
#define  JPEG_CONFR1_NF_1                        ((uint32_t)0x00000002)        /*!<Bit 1 */
#define  JPEG_CONFR1_RE                          ((uint32_t)0x00000004)        /*!<Restart maker Enable */  
#define  JPEG_CONFR1_DE                          ((uint32_t)0x00000008)        /*!<Decoding Enable */  
#define  JPEG_CONFR1_COLORSPACE                  ((uint32_t)0x00000030)        /*!<Color Space */  
#define  JPEG_CONFR1_COLORSPACE_0                ((uint32_t)0x00000010)        /*!<Bit 0 */  
#define  JPEG_CONFR1_COLORSPACE_1                ((uint32_t)0x00000020)        /*!<Bit 1 */  
#define  JPEG_CONFR1_NS                          ((uint32_t)0x000000C0)        /*!<Number of components for Scan */  
#define  JPEG_CONFR1_NS_0                        ((uint32_t)0x00000040)        /*!<Bit 0 */  
#define  JPEG_CONFR1_NS_1                        ((uint32_t)0x00000080)        /*!<Bit 1 */
#define  JPEG_CONFR1_HDR                         ((uint32_t)0x00000100)        /*!<Header Processing On/Off */
#define  JPEG_CONFR1_YSIZE                       ((uint32_t)0xFFFF0000)        /*!<Number of lines in source image */

/********************  Bit definition for CONFR2 register  ********************/
#define  JPEG_CONFR2_NMCU                        ((uint32_t)0x03FFFFFF)        /*!<Number of MCU units minus 1 to encode */

/********************  Bit definition for CONFR3 register  ********************/
#define  JPEG_CONFR3_NRST                        ((uint32_t)0x0000FFFF)        /*!<Number of MCU between two restart makers minus 1 */
#define  JPEG_CONFR3_XSIZE                       ((uint32_t)0xFFFF0000)        /*!<Number of pixels per line */

/********************  Bit definition for CONFR4 register  ********************/
#define  JPEG_CONFR4_HD                          ((uint32_t)0x00000001)        /*!<Selects the Huffman table for encoding the DC coefficients */  
#define  JPEG_CONFR4_HA                          ((uint32_t)0x00000002)        /*!<Selects the Huffman table for encoding the AC coefficients */ 
#define  JPEG_CONFR4_QT                          ((uint32_t)0x0000000C)        /*!<Selects quantization table associated with a color component */
#define  JPEG_CONFR4_QT_0                        ((uint32_t)0x00000004)        /*!<Bit 0 */
#define  JPEG_CONFR4_QT_1                        ((uint32_t)0x00000008)        /*!<Bit 1 */
#define  JPEG_CONFR4_NB                          ((uint32_t)0x000000F0)        /*!<Number of data units minus 1 that belong to a particular color in the MCU */
#define  JPEG_CONFR4_NB_0                        ((uint32_t)0x00000010)        /*!<Bit 0 */
#define  JPEG_CONFR4_NB_1                        ((uint32_t)0x00000020)        /*!<Bit 1 */
#define  JPEG_CONFR4_NB_2                        ((uint32_t)0x00000040)        /*!<Bit 2 */
#define  JPEG_CONFR4_NB_3                        ((uint32_t)0x00000080)        /*!<Bit 3 */
#define  JPEG_CONFR4_VSF                         ((uint32_t)0x00000F00)        /*!<Vertical sampling factor for component 1 */
#define  JPEG_CONFR4_VSF_0                       ((uint32_t)0x00000100)        /*!<Bit 0 */
#define  JPEG_CONFR4_VSF_1                       ((uint32_t)0x00000200)        /*!<Bit 1 */
#define  JPEG_CONFR4_VSF_2                       ((uint32_t)0x00000400)        /*!<Bit 2 */
#define  JPEG_CONFR4_VSF_3                       ((uint32_t)0x00000800)        /*!<Bit 3 */
#define  JPEG_CONFR4_HSF                         ((uint32_t)0x0000F000)        /*!<Horizontal sampling factor for component 1 */
#define  JPEG_CONFR4_HSF_0                       ((uint32_t)0x00001000)        /*!<Bit 0 */
#define  JPEG_CONFR4_HSF_1                       ((uint32_t)0x00002000)        /*!<Bit 1 */
#define  JPEG_CONFR4_HSF_2                       ((uint32_t)0x00004000)        /*!<Bit 2 */
#define  JPEG_CONFR4_HSF_3                       ((uint32_t)0x00008000)        /*!<Bit 3 */

