cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
/********************  Bit definition for CONFR5 register  ********************/
#define  JPEG_CONFR5_HD                          ((uint32_t)0x00000001)        /*!<Selects the Huffman table for encoding the DC coefficients */  
#define  JPEG_CONFR5_HA                          ((uint32_t)0x00000002)        /*!<Selects the Huffman table for encoding the AC coefficients */ 
#define  JPEG_CONFR5_QT                          ((uint32_t)0x0000000C)        /*!<Selects quantization table associated with a color component */
#define  JPEG_CONFR5_QT_0                        ((uint32_t)0x00000004)        /*!<Bit 0 */
#define  JPEG_CONFR5_QT_1                        ((uint32_t)0x00000008)        /*!<Bit 1 */
#define  JPEG_CONFR5_NB                          ((uint32_t)0x000000F0)        /*!<Number of data units minus 1 that belong to a particular color in the MCU */
#define  JPEG_CONFR5_NB_0                        ((uint32_t)0x00000010)        /*!<Bit 0 */
#define  JPEG_CONFR5_NB_1                        ((uint32_t)0x00000020)        /*!<Bit 1 */
#define  JPEG_CONFR5_NB_2                        ((uint32_t)0x00000040)        /*!<Bit 2 */
#define  JPEG_CONFR5_NB_3                        ((uint32_t)0x00000080)        /*!<Bit 3 */
#define  JPEG_CONFR5_VSF                         ((uint32_t)0x00000F00)        /*!<Vertical sampling factor for component 2 */
#define  JPEG_CONFR5_VSF_0                       ((uint32_t)0x00000100)        /*!<Bit 0 */
#define  JPEG_CONFR5_VSF_1                       ((uint32_t)0x00000200)        /*!<Bit 1 */
#define  JPEG_CONFR5_VSF_2                       ((uint32_t)0x00000400)        /*!<Bit 2 */
#define  JPEG_CONFR5_VSF_3                       ((uint32_t)0x00000800)        /*!<Bit 3 */
#define  JPEG_CONFR5_HSF                         ((uint32_t)0x0000F000)        /*!<Horizontal sampling factor for component 2 */
#define  JPEG_CONFR5_HSF_0                       ((uint32_t)0x00001000)        /*!<Bit 0 */
#define  JPEG_CONFR5_HSF_1                       ((uint32_t)0x00002000)        /*!<Bit 1 */
#define  JPEG_CONFR5_HSF_2                       ((uint32_t)0x00004000)        /*!<Bit 2 */
#define  JPEG_CONFR5_HSF_3                       ((uint32_t)0x00008000)        /*!<Bit 3 */

/********************  Bit definition for CONFR6 register  ********************/
#define  JPEG_CONFR6_HD                          ((uint32_t)0x00000001)        /*!<Selects the Huffman table for encoding the DC coefficients */  
#define  JPEG_CONFR6_HA                          ((uint32_t)0x00000002)        /*!<Selects the Huffman table for encoding the AC coefficients */ 
#define  JPEG_CONFR6_QT                          ((uint32_t)0x0000000C)        /*!<Selects quantization table associated with a color component */
#define  JPEG_CONFR6_QT_0                        ((uint32_t)0x00000004)        /*!<Bit 0 */
#define  JPEG_CONFR6_QT_1                        ((uint32_t)0x00000008)        /*!<Bit 1 */
#define  JPEG_CONFR6_NB                          ((uint32_t)0x000000F0)        /*!<Number of data units minus 1 that belong to a particular color in the MCU */
#define  JPEG_CONFR6_NB_0                        ((uint32_t)0x00000010)        /*!<Bit 0 */
#define  JPEG_CONFR6_NB_1                        ((uint32_t)0x00000020)        /*!<Bit 1 */
#define  JPEG_CONFR6_NB_2                        ((uint32_t)0x00000040)        /*!<Bit 2 */
#define  JPEG_CONFR6_NB_3                        ((uint32_t)0x00000080)        /*!<Bit 3 */
#define  JPEG_CONFR6_VSF                         ((uint32_t)0x00000F00)        /*!<Vertical sampling factor for component 2 */
#define  JPEG_CONFR6_VSF_0                       ((uint32_t)0x00000100)        /*!<Bit 0 */
#define  JPEG_CONFR6_VSF_1                       ((uint32_t)0x00000200)        /*!<Bit 1 */
#define  JPEG_CONFR6_VSF_2                       ((uint32_t)0x00000400)        /*!<Bit 2 */
#define  JPEG_CONFR6_VSF_3                       ((uint32_t)0x00000800)        /*!<Bit 3 */
#define  JPEG_CONFR6_HSF                         ((uint32_t)0x0000F000)        /*!<Horizontal sampling factor for component 2 */
#define  JPEG_CONFR6_HSF_0                       ((uint32_t)0x00001000)        /*!<Bit 0 */
#define  JPEG_CONFR6_HSF_1                       ((uint32_t)0x00002000)        /*!<Bit 1 */
#define  JPEG_CONFR6_HSF_2                       ((uint32_t)0x00004000)        /*!<Bit 2 */
#define  JPEG_CONFR6_HSF_3                       ((uint32_t)0x00008000)        /*!<Bit 3 */

/********************  Bit definition for CONFR7 register  ********************/
#define  JPEG_CONFR7_HD                          ((uint32_t)0x00000001)        /*!<Selects the Huffman table for encoding the DC coefficients */  
#define  JPEG_CONFR7_HA                          ((uint32_t)0x00000002)        /*!<Selects the Huffman table for encoding the AC coefficients */ 
#define  JPEG_CONFR7_QT                          ((uint32_t)0x0000000C)        /*!<Selects quantization table associated with a color component */
#define  JPEG_CONFR7_QT_0                        ((uint32_t)0x00000004)        /*!<Bit 0 */
#define  JPEG_CONFR7_QT_1                        ((uint32_t)0x00000008)        /*!<Bit 1 */
#define  JPEG_CONFR7_NB                          ((uint32_t)0x000000F0)        /*!<Number of data units minus 1 that belong to a particular color in the MCU */
#define  JPEG_CONFR7_NB_0                        ((uint32_t)0x00000010)        /*!<Bit 0 */
#define  JPEG_CONFR7_NB_1                        ((uint32_t)0x00000020)        /*!<Bit 1 */
#define  JPEG_CONFR7_NB_2                        ((uint32_t)0x00000040)        /*!<Bit 2 */
#define  JPEG_CONFR7_NB_3                        ((uint32_t)0x00000080)        /*!<Bit 3 */
#define  JPEG_CONFR7_VSF                         ((uint32_t)0x00000F00)        /*!<Vertical sampling factor for component 2 */
#define  JPEG_CONFR7_VSF_0                       ((uint32_t)0x00000100)        /*!<Bit 0 */
#define  JPEG_CONFR7_VSF_1                       ((uint32_t)0x00000200)        /*!<Bit 1 */
#define  JPEG_CONFR7_VSF_2                       ((uint32_t)0x00000400)        /*!<Bit 2 */
#define  JPEG_CONFR7_VSF_3                       ((uint32_t)0x00000800)        /*!<Bit 3 */
#define  JPEG_CONFR7_HSF                         ((uint32_t)0x0000F000)        /*!<Horizontal sampling factor for component 2 */
#define  JPEG_CONFR7_HSF_0                       ((uint32_t)0x00001000)        /*!<Bit 0 */
#define  JPEG_CONFR7_HSF_1                       ((uint32_t)0x00002000)        /*!<Bit 1 */
#define  JPEG_CONFR7_HSF_2                       ((uint32_t)0x00004000)        /*!<Bit 2 */
#define  JPEG_CONFR7_HSF_3                       ((uint32_t)0x00008000)        /*!<Bit 3 */

/********************  Bit definition for CR register  ********************/
#define  JPEG_CR_JCEN                            ((uint32_t)0x00000001)        /*!<Enable the JPEG Codec Core */
#define  JPEG_CR_IFTIE                           ((uint32_t)0x00000002)        /*!<Input FIFO Threshold Interrupt Enable */
#define  JPEG_CR_IFNFIE                          ((uint32_t)0x00000004)        /*!<Input FIFO Not Full Interrupt Enable */
#define  JPEG_CR_OFTIE                           ((uint32_t)0x00000008)        /*!<Output FIFO Threshold Interrupt Enable */
#define  JPEG_CR_OFNEIE                          ((uint32_t)0x00000010)        /*!<Output FIFO Not Empty Interrupt Enable */
#define  JPEG_CR_EOCIE                           ((uint32_t)0x00000020)        /*!<End of Conversion Interrupt Enable */
#define  JPEG_CR_HPDIE                           ((uint32_t)0x00000040)        /*!<Header Parsing Done Interrupt Enable */
#define  JPEG_CR_IDMAEN                          ((uint32_t)0x00000800)        /*!<Enable the DMA request generation for the input FIFO */
#define  JPEG_CR_ODMAEN                          ((uint32_t)0x00001000)        /*!<Enable the DMA request generation for the output FIFO */
#define  JPEG_CR_IFF                             ((uint32_t)0x00002000)        /*!<Flush the input FIFO */
#define  JPEG_CR_OFF                             ((uint32_t)0x00004000)        /*!<Flush the output FIFO */

/********************  Bit definition for SR register  ********************/
#define  JPEG_SR_IFTF                            ((uint32_t)0x00000002)        /*!<Input FIFO is not full and is bellow its threshold flag */
#define  JPEG_SR_IFNFF                           ((uint32_t)0x00000004)        /*!<Input FIFO Not Full Flag, a data can be written */
#define  JPEG_SR_OFTF                            ((uint32_t)0x00000008)        /*!<Output FIFO is not empty and has reach its threshold */
#define  JPEG_SR_OFNEF                           ((uint32_t)0x000000010)        /*!<Output FIFO is not empty, a data is available */
#define  JPEG_SR_EOCF                            ((uint32_t)0x000000020)        /*!<JPEG Codec core has finished the encoding or the decoding process and than last data has been sent to the output FIFO */
#define  JPEG_SR_HPDF                            ((uint32_t)0x000000040)        /*!<JPEG Codec has finished the parsing of the headers and the internal registers have been updated */

