cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
/********************  Bit definition for MDMA_SGISR0 register  ****************/
#define MDMA_SGISR0_GIF0                           ((uint32_t)0x00000001)              /*!< Channel 0 global interrupt flag */
#define MDMA_SGISR0_GIF1                           ((uint32_t)0x00000002)              /*!< Channel 1 global interrupt flag */
#define MDMA_SGISR0_GIF2                           ((uint32_t)0x00000004)              /*!< Channel 2 global interrupt flag */
#define MDMA_SGISR0_GIF3                           ((uint32_t)0x00000008)              /*!< Channel 3 global interrupt flag */
#define MDMA_SGISR0_GIF4                           ((uint32_t)0x00000010)              /*!< Channel 4 global interrupt flag */
#define MDMA_SGISR0_GIF5                           ((uint32_t)0x00000020)              /*!< Channel 5 global interrupt flag */
#define MDMA_SGISR0_GIF6                           ((uint32_t)0x00000040)              /*!< Channel 6 global interrupt flag */
#define MDMA_SGISR0_GIF7                           ((uint32_t)0x00000080)              /*!< Channel 7 global interrupt flag */
#define MDMA_SGISR0_GIF8                           ((uint32_t)0x00000100)              /*!< Channel 8 global interrupt flag */
#define MDMA_SGISR0_GIF9                           ((uint32_t)0x00000200)              /*!< Channel 9 global interrupt flag */
#define MDMA_SGISR0_GIF10                          ((uint32_t)0x00000400)              /*!< Channel 10 global interrupt flag */
#define MDMA_SGISR0_GIF11                          ((uint32_t)0x00000800)              /*!< Channel 11 global interrupt flag */
#define MDMA_SGISR0_GIF12                          ((uint32_t)0x00001000)              /*!< Channel 12 global interrupt flag */
#define MDMA_SGISR0_GIF13                          ((uint32_t)0x00002000)              /*!< Channel 13 global interrupt flag */
#define MDMA_SGISR0_GIF14                          ((uint32_t)0x00004000)              /*!< Channel 14 global interrupt flag */
#define MDMA_SGISR0_GIF15                          ((uint32_t)0x00008000)              /*!< Channel 15 global interrupt flag */
#define MDMA_SGISR0_GIF16                          ((uint32_t)0x00010000)              /*!< Channel 16 global interrupt flag */
#define MDMA_SGISR0_GIF17                          ((uint32_t)0x00020000)              /*!< Channel 17 global interrupt flag */
#define MDMA_SGISR0_GIF18                          ((uint32_t)0x00040000)              /*!< Channel 18 global interrupt flag */
#define MDMA_SGISR0_GIF19                          ((uint32_t)0x00080000)              /*!< Channel 19 global interrupt flag */
#define MDMA_SGISR0_GIF20                          ((uint32_t)0x00100000)              /*!< Channel 20 global interrupt flag */
#define MDMA_SGISR0_GIF21                          ((uint32_t)0x00200000)              /*!< Channel 21 global interrupt flag */
#define MDMA_SGISR0_GIF22                          ((uint32_t)0x00400000)              /*!< Channel 22 global interrupt flag */
#define MDMA_SGISR0_GIF23                          ((uint32_t)0x00800000)              /*!< Channel 23 global interrupt flag */
#define MDMA_SGISR0_GIF24                          ((uint32_t)0x01000000)              /*!< Channel 24 global interrupt flag */
#define MDMA_SGISR0_GIF25                          ((uint32_t)0x02000000)              /*!< Channel 25 global interrupt flag */
#define MDMA_SGISR0_GIF26                          ((uint32_t)0x04000000)              /*!< Channel 26 global interrupt flag */
#define MDMA_SGISR0_GIF27                          ((uint32_t)0x08000000)              /*!< Channel 27 global interrupt flag */
#define MDMA_SGISR0_GIF28                          ((uint32_t)0x10000000)              /*!< Channel 28 global interrupt flag */
#define MDMA_SGISR0_GIF29                          ((uint32_t)0x20000000)              /*!< Channel 29 global interrupt flag */
#define MDMA_SGISR0_GIF30                          ((uint32_t)0x40000000)              /*!< Channel 30 global interrupt flag */
#define MDMA_SGISR0_GIF31                          ((uint32_t)0x80000000)              /*!< Channel 31 global interrupt flag */

/********************  Bit definition for MDMA_SGISR1 register  ****************/
#define MDMA_SGISR1_GIF32                          ((uint32_t)0x00000001)              /*!< Channel 32 global interrupt flag */
#define MDMA_SGISR1_GIF33                          ((uint32_t)0x00000002)              /*!< Channel 33 global interrupt flag */
#define MDMA_SGISR1_GIF34                          ((uint32_t)0x00000004)              /*!< Channel 34 global interrupt flag */
#define MDMA_SGISR1_GIF35                          ((uint32_t)0x00000008)              /*!< Channel 35 global interrupt flag */
#define MDMA_SGISR1_GIF36                          ((uint32_t)0x00000010)              /*!< Channel 36 global interrupt flag */
#define MDMA_SGISR1_GIF37                          ((uint32_t)0x00000020)              /*!< Channel 37 global interrupt flag */
#define MDMA_SGISR1_GIF38                          ((uint32_t)0x00000040)              /*!< Channel 38 global interrupt flag */
#define MDMA_SGISR1_GIF39                          ((uint32_t)0x00000080)              /*!< Channel 39 global interrupt flag */
#define MDMA_SGISR1_GIF40                          ((uint32_t)0x00000100)              /*!< Channel 40 global interrupt flag */
#define MDMA_SGISR1_GIF41                          ((uint32_t)0x00000200)              /*!< Channel 41 global interrupt flag */
#define MDMA_SGISR1_GIF42                          ((uint32_t)0x00000400)              /*!< Channel 42 global interrupt flag */
#define MDMA_SGISR1_GIF43                          ((uint32_t)0x00000800)              /*!< Channel 43 global interrupt flag */
#define MDMA_SGISR1_GIF44                          ((uint32_t)0x00001000)              /*!< Channel 44 global interrupt flag */
#define MDMA_SGISR1_GIF45                          ((uint32_t)0x00002000)              /*!< Channel 45 global interrupt flag */
#define MDMA_SGISR1_GIF46                          ((uint32_t)0x00004000)              /*!< Channel 46 global interrupt flag */
#define MDMA_SGISR1_GIF47                          ((uint32_t)0x00008000)              /*!< Channel 47 global interrupt flag */
#define MDMA_SGISR1_GIF48                          ((uint32_t)0x00010000)              /*!< Channel 48 global interrupt flag */
#define MDMA_SGISR1_GIF49                          ((uint32_t)0x00020000)              /*!< Channel 49 global interrupt flag */
#define MDMA_SGISR1_GIF50                          ((uint32_t)0x00040000)              /*!< Channel 50 global interrupt flag */
#define MDMA_SGISR1_GIF51                          ((uint32_t)0x00080000)              /*!< Channel 51 global interrupt flag */
#define MDMA_SGISR1_GIF52                          ((uint32_t)0x00100000)              /*!< Channel 52 global interrupt flag */
#define MDMA_SGISR1_GIF53                          ((uint32_t)0x00200000)              /*!< Channel 53 global interrupt flag */
#define MDMA_SGISR1_GIF54                          ((uint32_t)0x00400000)              /*!< Channel 54 global interrupt flag */
#define MDMA_SGISR1_GIF55                          ((uint32_t)0x00800000)              /*!< Channel 55 global interrupt flag */
#define MDMA_SGISR1_GIF56                          ((uint32_t)0x01000000)              /*!< Channel 56 global interrupt flag */
#define MDMA_SGISR1_GIF57                          ((uint32_t)0x02000000)              /*!< Channel 57 global interrupt flag */
#define MDMA_SGISR1_GIF58                          ((uint32_t)0x04000000)              /*!< Channel 58 global interrupt flag */
#define MDMA_SGISR1_GIF59                          ((uint32_t)0x08000000)              /*!< Channel 59 global interrupt flag */
#define MDMA_SGISR1_GIF60                          ((uint32_t)0x10000000)              /*!< Channel 60 global interrupt flag */
#define MDMA_SGISR1_GIF61                          ((uint32_t)0x20000000)              /*!< Channel 61 global interrupt flag */
#define MDMA_SGISR1_GIF62                          ((uint32_t)0x40000000)              /*!< Channel 62 global interrupt flag */

/********************  Bit definition for MDMA_CxISR register  ****************/
#define MDMA_CISR_TEIF                            ((uint32_t)0x00000001)              /*!< Channel x transfer error interrupt flag */
#define MDMA_CISR_CTCIF                           ((uint32_t)0x00000002)              /*!< Channel x Channel Transfer Complete interrupt flag */
#define MDMA_CISR_BRTIF                           ((uint32_t)0x00000004)              /*!< Channel x block repeat transfer complete interrupt flag */
#define MDMA_CISR_BTIF                            ((uint32_t)0x00000008)              /*!< Channel x block transfer complete interrupt flag */
#define MDMA_CISR_TCIF                            ((uint32_t)0x00000010)              /*!< Channel x buffer transfer complete interrupt flag */
#define MDMA_CISR_CRQA                            ((uint32_t)0x00010000)              /*!< Channel x ReQest Active flag */

/********************  Bit definition for MDMA_CxIFCR register  ****************/
#define MDMA_CIFCR_CTEIF                          ((uint32_t)0x00000001)              /*!< Channel x clear transfer error interrupt flag */
#define MDMA_CIFCR_CCTCIF                         ((uint32_t)0x00000002)              /*!< Clear Channel transfer complete interrupt flag for channel x */
#define MDMA_CIFCR_CBRTIF                         ((uint32_t)0x00000004)              /*!< Channel x clear block repeat transfer complete interrupt flag */
#define MDMA_CIFCR_CBTIF                          ((uint32_t)0x00000008)              /*!< Channel x Clear block transfer complete interrupt flag */
#define MDMA_CIFCR_CLTCIF                         ((uint32_t)0x00000010)              /*!< CLear Transfer buffer Complete Interrupt Flag for channel */

/********************  Bit definition for MDMA_CxESR register  ****************/
#define MDMA_CESR_TEA                            ((uint32_t)0x0000007F)              /*!< Transfer Error Address */
#define MDMA_CESR_TED                            ((uint32_t)0x00000080)              /*!< Transfer Error Direction */
#define MDMA_CESR_TELD                           ((uint32_t)0x00000100)              /*!< Transfer Error Link Data */
#define MDMA_CESR_TEMD                           ((uint32_t)0x00000200)              /*!< Transfer Error Mask Data */

