cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
/********************  Bit definition for PWR_PUCRG register  ********************/
#define   PWR_PUCRG_PG15                     ((uint32_t)0x00008000)      /*!< Port PG15 Pull-Up set */
#define   PWR_PUCRG_PG14                     ((uint32_t)0x00004000)      /*!< Port PG14 Pull-Up set */
#define   PWR_PUCRG_PG13                     ((uint32_t)0x00002000)      /*!< Port PG13 Pull-Up set */
#define   PWR_PUCRG_PG12                     ((uint32_t)0x00001000)      /*!< Port PG12 Pull-Up set */
#define   PWR_PUCRG_PG11                     ((uint32_t)0x00000800)      /*!< Port PG11 Pull-Up set */
#define   PWR_PUCRG_PG10                     ((uint32_t)0x00000400)      /*!< Port PG10 Pull-Up set */
#define   PWR_PUCRG_PG9                      ((uint32_t)0x00000200)      /*!< Port PG9 Pull-Up set  */
#define   PWR_PUCRG_PG8                      ((uint32_t)0x00000100)      /*!< Port PG8 Pull-Up set  */
#define   PWR_PUCRG_PG7                      ((uint32_t)0x00000080)      /*!< Port PG7 Pull-Up set  */
#define   PWR_PUCRG_PG6                      ((uint32_t)0x00000040)      /*!< Port PG6 Pull-Up set  */
#define   PWR_PUCRG_PG5                      ((uint32_t)0x00000020)      /*!< Port PG5 Pull-Up set  */
#define   PWR_PUCRG_PG4                      ((uint32_t)0x00000010)      /*!< Port PG4 Pull-Up set  */
#define   PWR_PUCRG_PG3                      ((uint32_t)0x00000008)      /*!< Port PG3 Pull-Up set  */
#define   PWR_PUCRG_PG2                      ((uint32_t)0x00000004)      /*!< Port PG2 Pull-Up set  */
#define   PWR_PUCRG_PG1                      ((uint32_t)0x00000002)      /*!< Port PG1 Pull-Up set  */
#define   PWR_PUCRG_PG0                      ((uint32_t)0x00000001)      /*!< Port PG0 Pull-Up set  */

/********************  Bit definition for PWR_PDCRG register  ********************/
#define   PWR_PDCRG_PG15                     ((uint32_t)0x00008000)      /*!< Port PG15 Pull-Down set */
#define   PWR_PDCRG_PG14                     ((uint32_t)0x00004000)      /*!< Port PG14 Pull-Down set */
#define   PWR_PDCRG_PG13                     ((uint32_t)0x00002000)      /*!< Port PG13 Pull-Down set */
#define   PWR_PDCRG_PG12                     ((uint32_t)0x00001000)      /*!< Port PG12 Pull-Down set */
#define   PWR_PDCRG_PG11                     ((uint32_t)0x00000800)      /*!< Port PG11 Pull-Down set */
#define   PWR_PDCRG_PG10                     ((uint32_t)0x00000400)      /*!< Port PG10 Pull-Down set */
#define   PWR_PDCRG_PG9                      ((uint32_t)0x00000200)      /*!< Port PG9 Pull-Down set  */
#define   PWR_PDCRG_PG8                      ((uint32_t)0x00000100)      /*!< Port PG8 Pull-Down set  */
#define   PWR_PDCRG_PG7                      ((uint32_t)0x00000080)      /*!< Port PG7 Pull-Down set  */
#define   PWR_PDCRG_PG6                      ((uint32_t)0x00000040)      /*!< Port PG6 Pull-Down set  */
#define   PWR_PDCRG_PG5                      ((uint32_t)0x00000020)      /*!< Port PG5 Pull-Down set  */
#define   PWR_PDCRG_PG4                      ((uint32_t)0x00000010)      /*!< Port PG4 Pull-Down set  */
#define   PWR_PDCRG_PG3                      ((uint32_t)0x00000008)      /*!< Port PG3 Pull-Down set  */
#define   PWR_PDCRG_PG2                      ((uint32_t)0x00000004)      /*!< Port PG2 Pull-Down set  */
#define   PWR_PDCRG_PG1                      ((uint32_t)0x00000002)      /*!< Port PG1 Pull-Down set  */
#define   PWR_PDCRG_PG0                      ((uint32_t)0x00000001)      /*!< Port PG0 Pull-Down set  */

/********************  Bit definition for PWR_PUCRH register  ********************/
#define   PWR_PUCRH_PH1                      ((uint32_t)0x00000002)      /*!< Port PH1 Pull-Up set  */
#define   PWR_PUCRH_PH0                      ((uint32_t)0x00000001)      /*!< Port PH0 Pull-Up set  */

/********************  Bit definition for PWR_PDCRH register  ********************/
#define   PWR_PDCRH_PH1                      ((uint32_t)0x00000002)      /*!< Port PH1 Pull-Down set  */
#define   PWR_PDCRH_PH0                      ((uint32_t)0x00000001)      /*!< Port PH0 Pull-Down set  */

/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for RCC_CR register  ********************/
#define  RCC_CR_HSION                        ((uint32_t)0x00000001)       /*!< Internal High Speed clock enable */
#define  RCC_CR_HSIKERON                     ((uint32_t)0x00000002)       /*!< Internal High Speed clock enable for some IPs Kernel */
#define  RCC_CR_HSIRDY                       ((uint32_t)0x00000004)       /*!< Internal High Speed clock ready flag */
#define  RCC_CR_HSIDIV                       ((uint32_t)0x00000018)       /*!< Internal High Speed clock divider selection */
#define  RCC_CR_HSIDIV_1                     ((uint32_t)0x00000000)       /*!< Internal High Speed clock divider selection : Division by 1 */
#define  RCC_CR_HSIDIV_2                     ((uint32_t)0x00000008)       /*!< Internal High Speed clock divider selection : Division by 2 */
#define  RCC_CR_HSIDIV_4                     ((uint32_t)0x00000010)       /*!< Internal High Speed clock divider selection : Division by 4 */
#define  RCC_CR_HSIDIV_8                     ((uint32_t)0x00000018)       /*!< Internal High Speed clock divider selection : Division by 8 */

#define  RCC_CR_HSIDIVF                      ((uint32_t)0x00000020)       /*!< HSI Divider flag */
#define  RCC_CR_CSION                        ((uint32_t)0x00000080)       /*!< The Internal RC 4MHz oscillator clock enable */
#define  RCC_CR_CSIRDY                       ((uint32_t)0x00000100)       /*!< The Internal RC 4MHz oscillator clock ready */
#define  RCC_CR_CSIKERON                     ((uint32_t)0x00000200)       /*!< Internal RC 4MHz oscillator clock enable for some IPs Kernel */
#define  RCC_CR_RC48ON                       ((uint32_t)0x00001000)       /*!< RC48 clock enable clock enable  */
#define  RCC_CR_RC48RDY                      ((uint32_t)0x00002000)       /*!< RC48 clock ready */


#define  RCC_CR_HSEON                        ((uint32_t)0x00010000)       /*!< External High Speed clock enable */
#define  RCC_CR_HSERDY                       ((uint32_t)0x00020000)       /*!< External High Speed clock ready */
#define  RCC_CR_HSEBYP                       ((uint32_t)0x00040000)       /*!< External High Speed clock Bypass */
#define  RCC_CR_CSSHSEON                     ((uint32_t)0x00080000)       /*!< HSE Clock security System enable */

#define  RCC_CR_PLL1ON                        ((uint32_t)0x01000000)       /*!< System PLL1 clock enable */
#define  RCC_CR_PLL1RDY                       ((uint32_t)0x02000000)       /*!< System PLL1 clock ready */
#define  RCC_CR_PLL2ON                        ((uint32_t)0x04000000)       /*!< System PLL2 clock enable */
#define  RCC_CR_PLL2RDY                       ((uint32_t)0x08000000)       /*!< System PLL2 clock ready */
#define  RCC_CR_PLL3ON                        ((uint32_t)0x10000000)       /*!< System PLL3 clock enable */
#define  RCC_CR_PLL3RDY                       ((uint32_t)0x20000000)       /*!< System PLL3 clock ready */



/*Legacy */
#define  RCC_CR_PLLON                         ((uint32_t)0x01000000)       /*!< System PLL clock enable */
#define  RCC_CR_PLLRDY                        ((uint32_t)0x02000000)       /*!< System PLL clock ready */
#define  RCC_CR_PLLSAI1ON                     ((uint32_t)0x04000000)       /*!< SAI1 PLL enable */
#define  RCC_CR_PLLSAI1RDY                    ((uint32_t)0x08000000)       /*!< SAI PLL ready */
#define  RCC_CR_PLLSAI2ON                     ((uint32_t)0x10000000)       /*!< SAI2 PLL enable */
#define  RCC_CR_PLLSAI2RDY                    ((uint32_t)0x20000000)       /*!< SAI2 PLL ready */


/*!< MSIRANGE configuration : 12 frequency ranges available */

#define  RCC_CR_MSIRANGE                     ((uint32_t)0x000000F0)       /*!< Internal Multi Speed clock Range */
#define  RCC_CR_MSIRANGE_0                   ((uint32_t)0x00000000)       /*!< Internal Multi Speed clock Range 100 KHz */
#define  RCC_CR_MSIRANGE_1                   ((uint32_t)0x00000010)       /*!< Internal Multi Speed clock Range 200 KHz */
#define  RCC_CR_MSIRANGE_2                   ((uint32_t)0x00000020)       /*!< Internal Multi Speed clock Range 400 KHz */
#define  RCC_CR_MSIRANGE_3                   ((uint32_t)0x00000030)       /*!< Internal Multi Speed clock Range 800 KHz */
#define  RCC_CR_MSIRANGE_4                   ((uint32_t)0x00000040)       /*!< Internal Multi Speed clock Range 1 MHz */
#define  RCC_CR_MSIRANGE_5                   ((uint32_t)0x00000050)       /*!< Internal Multi Speed clock Range 2 MHz */
#define  RCC_CR_MSIRANGE_6                   ((uint32_t)0x00000060)       /*!< Internal Multi Speed clock Range 4  MHz */
#define  RCC_CR_MSIRANGE_7                   ((uint32_t)0x00000070)       /*!< Internal Multi Speed clock Range 8 KHz */
#define  RCC_CR_MSIRANGE_8                   ((uint32_t)0x00000080)       /*!< Internal Multi Speed clock Range 16 MHz */
#define  RCC_CR_MSIRANGE_9                   ((uint32_t)0x00000090)       /*!< Internal Multi Speed clock Range 24 MHz */
#define  RCC_CR_MSIRANGE_10                  ((uint32_t)0x000000A0)       /*!< Internal Multi Speed clock Range 32 MHz */
#define  RCC_CR_MSIRANGE_11                  ((uint32_t)0x000000B0)       /*!< Internal Multi Speed clock Range 48  MHz */
/********************  Bit definition for RCC_ICSCR register  ***************/
/*!< HSICAL configuration */
#define  RCC_ICSCR_HSICAL                    ((uint32_t)0x00000FFF)       /*!< MSICAL[11:0] bits */
#define  RCC_ICSCR_HSICAL_0                  ((uint32_t)0x00000001)       /*!<Bit 0 */
#define  RCC_ICSCR_HSICAL_1                  ((uint32_t)0x00000002)       /*!<Bit 1 */
#define  RCC_ICSCR_HSICAL_2                  ((uint32_t)0x00000004)       /*!<Bit 2 */
#define  RCC_ICSCR_HSICAL_3                  ((uint32_t)0x00000008)       /*!<Bit 3 */
#define  RCC_ICSCR_HSICAL_4                  ((uint32_t)0x00000010)       /*!<Bit 4 */
#define  RCC_ICSCR_HSICAL_5                  ((uint32_t)0x00000020)       /*!<Bit 5 */
#define  RCC_ICSCR_HSICAL_6                  ((uint32_t)0x00000040)       /*!<Bit 6 */
#define  RCC_ICSCR_HSICAL_7                  ((uint32_t)0x00000080)       /*!<Bit 7 */
#define  RCC_ICSCR_HSICAL_8                  ((uint32_t)0x00000100)       /*!<Bit 8 */
#define  RCC_ICSCR_HSICAL_9                  ((uint32_t)0x00000200)       /*!<Bit 9 */
#define  RCC_ICSCR_HSICAL_10                 ((uint32_t)0x00000400)       /*!<Bit 10 */
#define  RCC_ICSCR_HSICAL_11                 ((uint32_t)0x00000800)       /*!<Bit 11 */

/*!< HSITRIM configuration */
#define  RCC_ICSCR_HSITRIM                   ((uint32_t)0x0003F000)       /*!< HSITRIM[5:0] bits */
#define  RCC_ICSCR_HSITRIM_0                 ((uint32_t)0x00001000)       /*!<Bit 0 */
#define  RCC_ICSCR_HSITRIM_1                 ((uint32_t)0x00002000)       /*!<Bit 1 */
#define  RCC_ICSCR_HSITRIM_2                 ((uint32_t)0x00004000)       /*!<Bit 2 */
#define  RCC_ICSCR_HSITRIM_3                 ((uint32_t)0x00008000)       /*!<Bit 3 */
#define  RCC_ICSCR_HSITRIM_4                 ((uint32_t)0x00010000)       /*!<Bit 4 */
#define  RCC_ICSCR_HSITRIM_5                 ((uint32_t)0x00020000)       /*!<Bit 5 */


/*!< CSICAL configuration */
#define  RCC_ICSCR_CSICAL                    ((uint32_t)0x03FC0000)       /*!< CSICAL[7:0] bits */
#define  RCC_ICSCR_CSICAL_0                  ((uint32_t)0x00040000)        /*!<Bit 0 */
#define  RCC_ICSCR_CSICAL_1                  ((uint32_t)0x00080000)        /*!<Bit 1 */
#define  RCC_ICSCR_CSICAL_2                  ((uint32_t)0x00100000)        /*!<Bit 2 */
#define  RCC_ICSCR_CSICAL_3                  ((uint32_t)0x00200000)        /*!<Bit 3 */
#define  RCC_ICSCR_CSICAL_4                  ((uint32_t)0x00400000)        /*!<Bit 4 */
#define  RCC_ICSCR_CSICAL_5                  ((uint32_t)0x00800000)        /*!<Bit 5 */
#define  RCC_ICSCR_CSICAL_6                  ((uint32_t)0x01000000)        /*!<Bit 6 */
#define  RCC_ICSCR_CSICAL_7                  ((uint32_t)0x02000000)        /*!<Bit 7 */

