cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
/*!< CSITRIM configuration */
#define  RCC_ICSCR_CSITRIM                   ((uint32_t)0x7C000000)       /*!< CSITRIM[4:0] bits */
#define  RCC_ICSCR_CSITRIM_0                 ((uint32_t)0x04000000)        /*!<Bit 0 */
#define  RCC_ICSCR_CSITRIM_1                 ((uint32_t)0x08000000)        /*!<Bit 1 */
#define  RCC_ICSCR_CSITRIM_2                 ((uint32_t)0x10000000)        /*!<Bit 2 */
#define  RCC_ICSCR_CSITRIM_3                 ((uint32_t)0x20000000)        /*!<Bit 3 */
#define  RCC_ICSCR_CSITRIM_4                 ((uint32_t)0x40000000)        /*!<Bit 4 */


/********************  Bit definition for RCC_PLLCFGR register  ***************/

#define  RCC_PLLCFGR_PLL1FRACEN                 ((uint32_t)0x00000001)
#define  RCC_PLLCFGR_PLL1VCOSEL                 ((uint32_t)0x00000002)
#define  RCC_PLLCFGR_PLL1RGE                    ((uint32_t)0x0000000C)
#define  RCC_PLLCFGR_PLL1RGE_0                  ((uint32_t)0x00000000)
#define  RCC_PLLCFGR_PLL1RGE_1                  ((uint32_t)0x00000004)
#define  RCC_PLLCFGR_PLL1RGE_2                  ((uint32_t)0x00000008)
#define  RCC_PLLCFGR_PLL1RGE_3                  ((uint32_t)0x0000000C)

#define  RCC_PLLCFGR_PLL2FRACEN                 ((uint32_t)0x00000010)
#define  RCC_PLLCFGR_PLL2VCOSEL                 ((uint32_t)0x00000020)
#define  RCC_PLLCFGR_PLL2RGE                    ((uint32_t)0x000000C0)
#define  RCC_PLLCFGR_PLL2RGE_0                  ((uint32_t)0x00000000)
#define  RCC_PLLCFGR_PLL2RGE_1                  ((uint32_t)0x00000040)
#define  RCC_PLLCFGR_PLL2RGE_2                  ((uint32_t)0x00000080)
#define  RCC_PLLCFGR_PLL2RGE_3                  ((uint32_t)0x000000C0)

#define  RCC_PLLCFGR_PLL3FRACEN                 ((uint32_t)0x00000100)
#define  RCC_PLLCFGR_PLL3VCOSEL                 ((uint32_t)0x00000200)
#define  RCC_PLLCFGR_PLL3RGE                    ((uint32_t)0x00000C00)
#define  RCC_PLLCFGR_PLL3RGE_0                  ((uint32_t)0x00000000)
#define  RCC_PLLCFGR_PLL3RGE_1                  ((uint32_t)0x00000400)
#define  RCC_PLLCFGR_PLL3RGE_2                  ((uint32_t)0x00000800)
#define  RCC_PLLCFGR_PLL3RGE_3                  ((uint32_t)0x00000C00)

#define  RCC_PLLCFGR_DIVP1EN                    ((uint32_t)0x00010000)
#define  RCC_PLLCFGR_DIVQ1EN                    ((uint32_t)0x00020000)
#define  RCC_PLLCFGR_DIVR1EN                    ((uint32_t)0x00040000)

#define  RCC_PLLCFGR_DIVP2EN                    ((uint32_t)0x00080000)
#define  RCC_PLLCFGR_DIVQ2EN                    ((uint32_t)0x00100000)
#define  RCC_PLLCFGR_DIVR2EN                    ((uint32_t)0x00200000)

#define  RCC_PLLCFGR_DIVP3EN                    ((uint32_t)0x00400000)
#define  RCC_PLLCFGR_DIVQ3EN                    ((uint32_t)0x00800000)
#define  RCC_PLLCFGR_DIVR3EN                    ((uint32_t)0x01000000)


/********************  Bit definition for RCC_PLL1DIVR register  ***************/
#define  RCC_PLL1DIVR_N1                        ((uint32_t)0x000001FF)
#define  RCC_PLL1DIVR_P1                        ((uint32_t)0x0000FE00)
#define  RCC_PLL1DIVR_Q1                        ((uint32_t)0x007F0000)
#define  RCC_PLL1DIVR_R1                        ((uint32_t)0x7F000000)

/********************  Bit definition for RCC_PLL2DIVR register  ***************/
#define  RCC_PLL2DIVR_N2                        ((uint32_t)0x000001FF)
#define  RCC_PLL2DIVR_P2                        ((uint32_t)0x0000FE00)
#define  RCC_PLL2DIVR_Q2                        ((uint32_t)0x007F0000)
#define  RCC_PLL2DIVR_R2                        ((uint32_t)0x7F000000)

/********************  Bit definition for RCC_PLL3DIVR register  ***************/
#define  RCC_PLL3DIVR_N3                        ((uint32_t)0x000001FF)
#define  RCC_PLL3DIVR_P3                        ((uint32_t)0x0000FE00)
#define  RCC_PLL3DIVR_Q3                        ((uint32_t)0x007F0000)
#define  RCC_PLL3DIVR_R3                        ((uint32_t)0x7F000000)

/********************  Bit definition for RCC_PLL1FRACR register  ***************/
#define  RCC_PLL1FRACR_FRACN1                   ((uint32_t)0x0007FFFF)

/********************  Bit definition for RCC_PLL2FRACR register  ***************/
#define  RCC_PLL2FRACR_FRACN2                   ((uint32_t)0x0007FFFF)

/********************  Bit definition for RCC_PLL3FRACR register  ***************/
#define  RCC_PLL3FRACR_FRACN3                   ((uint32_t)0x0007FFFF)


/********************  Bit definition for RCC_PLLCKSELR register  *************/

#define  RCC_PLLCKSELR_PLLSRC                     ((uint32_t)0x00000003)

#define  RCC_PLLCKSELR_PLLSRC_HSI                 ((uint32_t)0x00000000)     /*!< HSI source clock selected */
#define  RCC_PLLCKSELR_PLLSRC_CSI                 ((uint32_t)0x00000001)     /*!< CSI source clock selected */
#define  RCC_PLLCKSELR_PLLSRC_HSE                 ((uint32_t)0x00000002)     /*!< HSE source clock selected */
#define  RCC_PLLCKSELR_PLLSRC_NONE                ((uint32_t)0x00000003)     /*!< No source clock selected  */

/*!< RTCPRE configuration */
#define  RCC_PLLCKSELR_DIVM1                      ((uint32_t)0x000003F0)
#define  RCC_PLLCKSELR_DIVM1_0                    ((uint32_t)0x00000010)
#define  RCC_PLLCKSELR_DIVM1_1                    ((uint32_t)0x00000020)
#define  RCC_PLLCKSELR_DIVM1_2                    ((uint32_t)0x00000040)
#define  RCC_PLLCKSELR_DIVM1_3                    ((uint32_t)0x00000080)
#define  RCC_PLLCKSELR_DIVM1_4                    ((uint32_t)0x00000100)
#define  RCC_PLLCKSELR_DIVM1_5                    ((uint32_t)0x00000200)

#define  RCC_PLLCKSELR_DIVM2                      ((uint32_t)0x0003F000)
#define  RCC_PLLCKSELR_DIVM2_0                    ((uint32_t)0x00001000)
#define  RCC_PLLCKSELR_DIVM2_1                    ((uint32_t)0x00002000)
#define  RCC_PLLCKSELR_DIVM2_2                    ((uint32_t)0x00004000)
#define  RCC_PLLCKSELR_DIVM2_3                    ((uint32_t)0x00008000)
#define  RCC_PLLCKSELR_DIVM2_4                    ((uint32_t)0x00010000)
#define  RCC_PLLCKSELR_DIVM2_5                    ((uint32_t)0x00020000)

