cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
#define  RCC_PLLCKSELR_DIVM3                      ((uint32_t)0x03F00000)
#define  RCC_PLLCKSELR_DIVM3_0                    ((uint32_t)0x00100000)
#define  RCC_PLLCKSELR_DIVM3_1                    ((uint32_t)0x00200000)
#define  RCC_PLLCKSELR_DIVM3_2                    ((uint32_t)0x00400000)
#define  RCC_PLLCKSELR_DIVM3_3                    ((uint32_t)0x00800000)
#define  RCC_PLLCKSELR_DIVM3_4                    ((uint32_t)0x01000000)
#define  RCC_PLLCKSELR_DIVM3_5                    ((uint32_t)0x02000000)


/********************  Bit definition for RCC_CFGR register  ******************/
/*!< SW configuration */
#define  RCC_CFGR_SW                          ((uint32_t)0x00000003)       /*!< SW[1:0] bits (System clock Switch) */
#define  RCC_CFGR_SW_0                        ((uint32_t)0x00000001)       /*!<Bit 0 */
#define  RCC_CFGR_SW_1                        ((uint32_t)0x00000002)       /*!<Bit 1 */

#define  RCC_CFGR_SW_HSI                      ((uint32_t)0x00000000)       /*!< HSI selection as system clock */
#define  RCC_CFGR_SW_CSI                      ((uint32_t)0x00000001)       /*!< CSI selection as system clock */
#define  RCC_CFGR_SW_HSE                      ((uint32_t)0x00000002)       /*!< HSE selection as system clock */
#define  RCC_CFGR_SW_PLL1                     ((uint32_t)0x00000003)       /*!< PLL1 selection as system clock */

#define  RCC_CFGR_SWS_HSI                     ((uint32_t)0x00000000)       /*!< HSI used as system clock */
#define  RCC_CFGR_SWS_CSI                     ((uint32_t)0x00000008)       /*!< CSI used as system clock */
#define  RCC_CFGR_SWS_HSE                     ((uint32_t)0x00000010)       /*!< HSE used as system clock */
#define  RCC_CFGR_SWS_PLL1                    ((uint32_t)0x00000018)       /*!< PLL1 used as system clock */

/*!< SWS configuration */
#define  RCC_CFGR_SWS                         ((uint32_t)0x00000018)       /*!< SWS[1:0] bits (System Clock Switch Status) */
#define  RCC_CFGR_SWS_0                       ((uint32_t)0x00000008)       /*!<Bit 0 */
#define  RCC_CFGR_SWS_1                       ((uint32_t)0x00000010)       /*!<Bit 1 */

#define  RCC_CFGR_STOPWUCK                    ((uint32_t)0x00000040)       /*!< Wake Up from stop and CSS backup clock selection */
#define  RCC_CFGR_STOPKERWUCK                 ((uint32_t)0x00000080)       /*!< Kernel Clock Selection after a Wake Up from STOP */

/*!< RTCPRE configuration */
#define  RCC_CFGR_RTCPRE                     ((uint32_t)0x00001F00)
#define  RCC_CFGR_RTCPRE_0                   ((uint32_t)0x00000100)
#define  RCC_CFGR_RTCPRE_1                   ((uint32_t)0x00000200)
#define  RCC_CFGR_RTCPRE_2                   ((uint32_t)0x00000400)
#define  RCC_CFGR_RTCPRE_3                   ((uint32_t)0x00000800)
#define  RCC_CFGR_RTCPRE_4                   ((uint32_t)0x00001000)

/*!< MCO1 configuration */
#define  RCC_CFGR_MCO1                       ((uint32_t)0x01C00000)
#define  RCC_CFGR_MCO1_0                     ((uint32_t)0x00400000)
#define  RCC_CFGR_MCO1_1                     ((uint32_t)0x00800000)
#define  RCC_CFGR_MCO1_2                     ((uint32_t)0x01000000)

#define  RCC_CFGR_MCO1PRE                    ((uint32_t)0x003C0000)
#define  RCC_CFGR_MCO1PRE_0                  ((uint32_t)0x00040000)
#define  RCC_CFGR_MCO1PRE_1                  ((uint32_t)0x00080000)
#define  RCC_CFGR_MCO1PRE_2                  ((uint32_t)0x00100000)
#define  RCC_CFGR_MCO1PRE_3                  ((uint32_t)0x00200000)

#define  RCC_CFGR_MCO2PRE                    ((uint32_t)0x1E000000)
#define  RCC_CFGR_MCO2PRE_0                  ((uint32_t)0x02000000)
#define  RCC_CFGR_MCO2PRE_1                  ((uint32_t)0x04000000)
#define  RCC_CFGR_MCO2PRE_2                  ((uint32_t)0x08000000)
#define  RCC_CFGR_MCO2PRE_3                  ((uint32_t)0x10000000)

#define  RCC_CFGR_MCO2                       ((uint32_t)0xE0000000)
#define  RCC_CFGR_MCO2_0                     ((uint32_t)0x20000000)
#define  RCC_CFGR_MCO2_1                     ((uint32_t)0x40000000)
#define  RCC_CFGR_MCO2_2                     ((uint32_t)0x80000000)

/********************  Bit definition for RCC_D1CFGR register  ******************/
/*!< D1HPRE configuration */
#define  RCC_D1CFGR_HPRE                        ((uint32_t)0x0000000F)       /*!< HPRE[3:0] bits (Domain1 AHB prescaler) */
#define  RCC_D1CFGR_HPRE_0                      ((uint32_t)0x00000001)       /*!<Bit 0 */
#define  RCC_D1CFGR_HPRE_1                      ((uint32_t)0x00000002)       /*!<Bit 1 */
#define  RCC_D1CFGR_HPRE_2                      ((uint32_t)0x00000004)       /*!<Bit 2 */
#define  RCC_D1CFGR_HPRE_3                      ((uint32_t)0x00000008)       /*!<Bit 3 */


#define  RCC_D1CFGR_HPRE_DIV1                  ((uint32_t)0x00000000)        /*!< Domain1 AHB Clock not divided */
#define  RCC_D1CFGR_HPRE_DIV2                  ((uint32_t)0x00000008)        /*!< Domain1 AHB Clock divided by 2 */
#define  RCC_D1CFGR_HPRE_DIV4                  ((uint32_t)0x00000009)        /*!< Domain1 AHB Clock divided by 4 */
#define  RCC_D1CFGR_HPRE_DIV8                  ((uint32_t)0x0000000A)        /*!< Domain1 AHB Clock divided by 8 */
#define  RCC_D1CFGR_HPRE_DIV16                 ((uint32_t)0x0000000B)        /*!< Domain1 AHB Clock divided by 16 */
#define  RCC_D1CFGR_HPRE_DIV64                 ((uint32_t)0x0000000C)        /*!< Domain1 AHB Clock divided by 64 */
#define  RCC_D1CFGR_HPRE_DIV128                ((uint32_t)0x0000000D)        /*!< Domain1 AHB Clock divided by 128 */
#define  RCC_D1CFGR_HPRE_DIV256                ((uint32_t)0x0000000E)        /*!< Domain1 AHB Clock divided by 256 */
#define  RCC_D1CFGR_HPRE_DIV512                ((uint32_t)0x0000000F)        /*!< Domain1 AHB Clock divided by 512 */

/*!< D1PPRE configuration */
#define  RCC_D1CFGR_D1PPRE                       ((uint32_t)0x00000070)       /*!< D1PRE[2:0] bits (Domain1 APB prescaler) */
#define  RCC_D1CFGR_D1PPRE_0                     ((uint32_t)0x00000010)       /*!<Bit 0 */
#define  RCC_D1CFGR_D1PPRE_1                     ((uint32_t)0x00000020)       /*!<Bit 1 */
#define  RCC_D1CFGR_D1PPRE_2                     ((uint32_t)0x00000040)       /*!<Bit 2 */

#define  RCC_D1CFGR_D1PPRE_DIV1                 ((uint32_t)0x00000000)        /*!< Domain1 APB clock not divided */
#define  RCC_D1CFGR_D1PPRE_DIV2                 ((uint32_t)0x00000040)        /*!< Domain1 APB clock divided by 2 */
#define  RCC_D1CFGR_D1PPRE_DIV4                 ((uint32_t)0x00000050)        /*!< Domain1 APB clock divided by 4 */
#define  RCC_D1CFGR_D1PPRE_DIV8                 ((uint32_t)0x00000060)        /*!< Domain1 APB clock divided by 8 */
#define  RCC_D1CFGR_D1PPRE_DIV16                ((uint32_t)0x00000070)        /*!< Domain1 APB clock divided by 16 */

#define  RCC_D1CFGR_D1CPRE                      ((uint32_t)0x00000F00)       /*!< D1CPRE[2:0] bits (Domain 1 Core prescaler) */
#define  RCC_D1CFGR_D1CPRE_0                    ((uint32_t)0x00000100)       /*!<Bit 0 */
#define  RCC_D1CFGR_D1CPRE_1                    ((uint32_t)0x00000200)       /*!<Bit 1 */
#define  RCC_D1CFGR_D1CPRE_2                    ((uint32_t)0x00000400)       /*!<Bit 2 */
#define  RCC_D1CFGR_D1CPRE_3                    ((uint32_t)0x00000800)       /*!<Bit 3 */

