cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
#define  RCC_D2APB1LSMENR_TIM2SMEN                 ((uint32_t)0x00000001)
#define  RCC_D2APB1LSMENR_TIM3SMEN                 ((uint32_t)0x00000002)
#define  RCC_D2APB1LSMENR_TIM4SMEN                 ((uint32_t)0x00000004)
#define  RCC_D2APB1LSMENR_TIM5SMEN                 ((uint32_t)0x00000008)
#define  RCC_D2APB1LSMENR_TIM6SMEN                 ((uint32_t)0x00000010)
#define  RCC_D2APB1LSMENR_TIM7SMEN                 ((uint32_t)0x00000020)
#define  RCC_D2APB1LSMENR_TIM12SMEN                ((uint32_t)0x00000040)
#define  RCC_D2APB1LSMENR_TIM13SMEN                ((uint32_t)0x00000080)
#define  RCC_D2APB1LSMENR_TIM14SMEN                ((uint32_t)0x00000100)
#define  RCC_D2APB1LSMENR_LPTIM1SMEN               ((uint32_t)0x00000200)
#define  RCC_D2APB1LSMENR_WWDG2SMEN                ((uint32_t)0x00000800)
#define  RCC_D2APB1LSMENR_SPI2SMEN                 ((uint32_t)0x00004000)
#define  RCC_D2APB1LSMENR_SPI3SMEN                 ((uint32_t)0x00008000)
#define  RCC_D2APB1LSMENR_SPDIFRXSMEN              ((uint32_t)0x00010000)
#define  RCC_D2APB1LSMENR_USART2SMEN               ((uint32_t)0x00020000)
#define  RCC_D2APB1LSMENR_USART3SMEN               ((uint32_t)0x00040000)
#define  RCC_D2APB1LSMENR_UART4SMEN                ((uint32_t)0x00080000)
#define  RCC_D2APB1LSMENR_UART5SMEN                ((uint32_t)0x00100000)
#define  RCC_D2APB1LSMENR_I2C1SMEN                 ((uint32_t)0x00200000)
#define  RCC_D2APB1LSMENR_I2C2SMEN                 ((uint32_t)0x00400000)
#define  RCC_D2APB1LSMENR_I2C3SMEN                 ((uint32_t)0x00800000)
#define  RCC_D2APB1LSMENR_CECSMEN                  ((uint32_t)0x08000000)
#define  RCC_D2APB1LSMENR_DAC12SMEN                ((uint32_t)0x20000000)
#define  RCC_D2APB1LSMENR_USART7SMEN               ((uint32_t)0x40000000)
#define  RCC_D2APB1LSMENR_USART8SMEN               ((uint32_t)0x80000000)

/********************  Bit definition for D2APB1HSMENR register  ******************/
#define  RCC_D2APB1HSMENR_CRSSMEN                  ((uint32_t)0x00000002)
#define  RCC_D2APB1HSMENR_SWPMISMEN                ((uint32_t)0x00000004)
#define  RCC_D2APB1HSMENR_OPAMPSMEN                ((uint32_t)0x00000010)
#define  RCC_D2APB1HSMENR_MDIOSSMEN                ((uint32_t)0x00000020)
#define  RCC_D2APB1HSMENR_FDCANSMEN                ((uint32_t)0x00000100)

/********************  Bit definition for D2APB2SMENR register  ******************/
#define  RCC_D2APB2SMENR_TIM1SMEN                  ((uint32_t)0x00000001)
#define  RCC_D2APB2SMENR_TIM8SMEN                  ((uint32_t)0x00000002)
#define  RCC_D2APB2SMENR_USART1SMEN                ((uint32_t)0x00000010)
#define  RCC_D2APB2SMENR_USART6SMEN                ((uint32_t)0x00000020)
#define  RCC_D2APB2SMENR_SPI1SMEN                  ((uint32_t)0x00001000)
#define  RCC_D2APB2SMENR_SPI4SMEN                  ((uint32_t)0x00002000)
#define  RCC_D2APB2SMENR_TIM15SMEN                 ((uint32_t)0x00010000)
#define  RCC_D2APB2SMENR_TIM16SMEN                 ((uint32_t)0x00020000)
#define  RCC_D2APB2SMENR_TIM17SMEN                 ((uint32_t)0x00040000)
#define  RCC_D2APB2SMENR_SPI5SMEN                  ((uint32_t)0x00100000)
#define  RCC_D2APB2SMENR_SAI1SMEN                  ((uint32_t)0x00400000)
#define  RCC_D2APB2SMENR_SAI2SMEN                  ((uint32_t)0x00800000)
#define  RCC_D2APB2SMENR_SAI3SMEN                  ((uint32_t)0x01000000)
#define  RCC_D2APB2SMENR_DFSDMSMEN                 ((uint32_t)0x10000000)
#define  RCC_D2APB2SMENR_HRTIMSMEN                 ((uint32_t)0x20000000)

/********************  Bit definition for D3APB1SMENR register  ******************/
#define  RCC_D3APB1SMENR_SYSCFGSMEN                ((uint32_t)0x00000002)
#define  RCC_D3APB1SMENR_LPUART1SMEN               ((uint32_t)0x00000008)
#define  RCC_D3APB1SMENR_SPI6SMEN                  ((uint32_t)0x00000020)
#define  RCC_D3APB1SMENR_I2C4SMEN                  ((uint32_t)0x00000080)
#define  RCC_D3APB1SMENR_LPTIM2SMEN                ((uint32_t)0x00000200)
#define  RCC_D3APB1SMENR_LPTIM3SMEN                ((uint32_t)0x00000400)
#define  RCC_D3APB1SMENR_LPTIM4SMEN                ((uint32_t)0x00000800)
#define  RCC_D3APB1SMENR_LPTIM5SMEN                ((uint32_t)0x00001000)
#define  RCC_D3APB1SMENR_COMP12SMEN                ((uint32_t)0x00004000)
#define  RCC_D3APB1SMENR_SAI4SMEN                  ((uint32_t)0x00200000) 

/********************  Bit definition for RCC_AHB1SMENR register  ***************/
#define  RCC_AHB1SMENR_DMA1SMEN                ((uint32_t)0x00000001)
#define  RCC_AHB1SMENR_DMA2SMEN                ((uint32_t)0x00000002)
#define  RCC_AHB1SMENR_FLASHSMEN               ((uint32_t)0x00000100)
#define  RCC_AHB1SMENR_SRAM1SMEN               ((uint32_t)0x00000200)
#define  RCC_AHB1SMENR_CRCSMEN                 ((uint32_t)0x00001000)
#define  RCC_AHB1SMENR_TSCSMEN                 ((uint32_t)0x00010000)
/********************  Bit definition for RCC_AHB2SMENR register  *************/
#define  RCC_AHB2SMENR_GPIOASMEN                 ((uint32_t)0x00000001)
#define  RCC_AHB2SMENR_GPIOBSMEN                 ((uint32_t)0x00000002)
#define  RCC_AHB2SMENR_GPIOCSMEN                 ((uint32_t)0x00000004)
#define  RCC_AHB2SMENR_GPIODSMEN                 ((uint32_t)0x00000008)
#define  RCC_AHB2SMENR_GPIOESMEN                 ((uint32_t)0x00000010)
#define  RCC_AHB2SMENR_GPIOFSMEN                 ((uint32_t)0x00000020)
#define  RCC_AHB2SMENR_GPIOGSMEN                 ((uint32_t)0x00000040)
#define  RCC_AHB2SMENR_GPIOHSMEN                 ((uint32_t)0x00000080)
#define  RCC_AHB2SMENR_SRAM2SMEN                 ((uint32_t)0x00000200)
#define  RCC_AHB2SMENR_OTGFSSMEN                 ((uint32_t)0x00001000)
#define  RCC_AHB2SMENR_ADCSMEN                   ((uint32_t)0x00002000)
#define  RCC_AHB2SMENR_RNGSMEN                   ((uint32_t)0x00040000)
/********************  Bit definition for RCC_AHB3SMENR register  *************/
#define  RCC_AHB3SMENR_FMCSMEN                   ((uint32_t)0x00000001)
#define  RCC_AHB3SMENR_QSPISMEN                  ((uint32_t)0x00000100)

/********************  Bit definition for RCC_APB1SMENR1 register  *************/
#define  RCC_APB1SMENR1_TIM2SMEN                ((uint32_t)0x00000001)
#define  RCC_APB1SMENR1_TIM3SMEN                ((uint32_t)0x00000002)
#define  RCC_APB1SMENR1_TIM4SMEN                ((uint32_t)0x00000004)
#define  RCC_APB1SMENR1_TIM5SMEN                ((uint32_t)0x00000008)
#define  RCC_APB1SMENR1_TIM6SMEN                ((uint32_t)0x00000010)
#define  RCC_APB1SMENR1_TIM7SMEN                ((uint32_t)0x00000020)
#define  RCC_APB1SMENR1_LCDSMEN                 ((uint32_t)0x00000200)
#define  RCC_APB1SMENR1_WWDGSMEN                ((uint32_t)0x00000800)
#define  RCC_APB1SMENR1_SPI2SMEN                ((uint32_t)0x00004000)
#define  RCC_APB1SMENR1_SPI3SMEN                ((uint32_t)0x00008000)
#define  RCC_APB1SMENR1_USART2SMEN              ((uint32_t)0x00020000)
#define  RCC_APB1SMENR1_USART3SMEN              ((uint32_t)0x00040000)
#define  RCC_APB1SMENR1_UART4SMEN               ((uint32_t)0x00080000)
#define  RCC_APB1SMENR1_UART5SMEN               ((uint32_t)0x00100000)
#define  RCC_APB1SMENR1_I2C1SMEN                ((uint32_t)0x00200000)
#define  RCC_APB1SMENR1_I2C2SMEN                ((uint32_t)0x00400000)
#define  RCC_APB1SMENR1_I2C3SMEN                ((uint32_t)0x00800000)
#define  RCC_APB1SMENR1_CAN1SMEN                ((uint32_t)0x02000000)
#define  RCC_APB1SMENR1_PWRSMEN                 ((uint32_t)0x10000000)
#define  RCC_APB1SMENR1_DAC1SMEN                ((uint32_t)0x20000000)
#define  RCC_APB1SMENR1_OPAMPSMEN               ((uint32_t)0x40000000)
#define  RCC_APB1SMENR1_LPTIM1SMEN              ((uint32_t)0x80000000)

/********************  Bit definition for RCC_APB1SMENR2 register  *************/
#define  RCC_APB1SMENR2_LPUART1SMEN              ((uint32_t)0x00000001)
#define  RCC_APB1SMENR2_SWPMI1SMEN               ((uint32_t)0x00000004)
#define  RCC_APB1SMENR2_LPTIM2SMEN               ((uint32_t)0x00000020)

/********************  Bit definition for RCC_APB2SMENR register  *************/
#define  RCC_APB2SMENR_SYSCFGSMEN                ((uint32_t)0x00000001)
#define  RCC_APB2SMENR_SDMMCSMEN                 ((uint32_t)0x00000400)
#define  RCC_APB2SMENR_TIM1SMEN                  ((uint32_t)0x00000800)
#define  RCC_APB2SMENR_SPI1SMEN                  ((uint32_t)0x00001000)
#define  RCC_APB2SMENR_TIM8SMEN                  ((uint32_t)0x00002000)
#define  RCC_APB2SMENR_USART1SMEN                ((uint32_t)0x00004000)
#define  RCC_APB2SMENR_TIM15SMEN                 ((uint32_t)0x00010000)
#define  RCC_APB2SMENR_TIM16SMEN                 ((uint32_t)0x00020000)
#define  RCC_APB2SMENR_TIM17SMEN                 ((uint32_t)0x00040000)
#define  RCC_APB2SMENR_SAI1SMEN                  ((uint32_t)0x00200000)
#define  RCC_APB2SMENR_SAI2SMEN                  ((uint32_t)0x00400000)
#define  RCC_APB2SMENR_DFSDMSMEN                 ((uint32_t)0x01000000)

/********************  Bit definition for RCC_D1CCIPR register  ****************/
#define  RCC_D1CCIPR_DSISRC                      ((uint32_t)0x00000100)

/********************  Bit definition for RCC_CCIPR register  ******************/
#define  RCC_CCIPR_USART1SEL                     ((uint32_t)0x00000003)
#define  RCC_CCIPR_USART1SEL_0                   ((uint32_t)0x00000001)
#define  RCC_CCIPR_USART1SEL_1                   ((uint32_t)0x00000002)

#define  RCC_CCIPR_USART2SEL                     ((uint32_t)0x0000000C)
#define  RCC_CCIPR_USART2SEL_0                   ((uint32_t)0x00000004)
#define  RCC_CCIPR_USART2SEL_1                   ((uint32_t)0x00000008)

