cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7A-B3/inc/stm32h700.h
/******************************* ADC Instances ********************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == ADC1)

/******************************** COMP Instances ******************************/
#define IS_COMP_ALL_INSTANCE(INSTANCE) (((INSTANCE) == COMP1) || \
                                       ((INSTANCE) == COMP2))

/******************************* CRC Instances ********************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CRC)

/******************************* DAC Instances ********************************/
#define IS_DAC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DAC1)

/****************************** DFSDM Instances *******************************/
#define IS_DFSDM_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DFSDM0) || \
                                         ((INSTANCE) == DFSDM1) || \
                                         ((INSTANCE) == DFSDM2) || \
                                         ((INSTANCE) == DFSDM3))

/******************************** DMA Instances *******************************/
#define IS_DMA_STREAM_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DMA1_Stream0) || \
                                             ((INSTANCE) == DMA1_Stream1) || \
                                             ((INSTANCE) == DMA1_Stream2) || \
                                             ((INSTANCE) == DMA1_Stream3) || \
                                             ((INSTANCE) == DMA1_Stream4) || \
                                             ((INSTANCE) == DMA1_Stream5) || \
                                             ((INSTANCE) == DMA1_Stream6) || \
                                             ((INSTANCE) == DMA1_Stream7) || \
                                             ((INSTANCE) == DMA2_Stream0) || \
                                             ((INSTANCE) == DMA2_Stream1) || \
                                             ((INSTANCE) == DMA2_Stream2) || \
																			       ((INSTANCE) == DMA2_Stream3) || \
                                             ((INSTANCE) == DMA2_Stream4) || \
                                             ((INSTANCE) == DMA2_Stream5) || \
                                             ((INSTANCE) == DMA2_Stream6) || \
                                             ((INSTANCE) == DMA2_Stream7) || \
																			       ((INSTANCE) == DMA3_Stream0) || \
                                             ((INSTANCE) == DMA3_Stream1) || \
                                             ((INSTANCE) == DMA3_Stream2) || \
                                             ((INSTANCE) == DMA3_Stream3) || \
                                             ((INSTANCE) == DMA3_Stream4) || \
                                             ((INSTANCE) == DMA3_Stream5) || \
                                             ((INSTANCE) == DMA3_Stream6) || \
                                             ((INSTANCE) == DMA3_Stream7))

/******************************** DMA Request Generator Instances **************/
#define IS_DMA_REQUEST_GEN_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DMAMUX1_RequestGenerator0) || \
                                                   ((INSTANCE) == DMAMUX1_RequestGenerator1) || \
                                                   ((INSTANCE) == DMAMUX1_RequestGenerator2) || \
                                                   ((INSTANCE) == DMAMUX1_RequestGenerator3) || \
                                                   ((INSTANCE) == DMAMUX2_RequestGenerator0) || \
                                                   ((INSTANCE) == DMAMUX2_RequestGenerator1) || \
                                                   ((INSTANCE) == DMAMUX2_RequestGenerator2) || \
                                                   ((INSTANCE) == DMAMUX2_RequestGenerator3))

/******************************** MDMA Request Generator Instances **************/
#define IS_MDMA_STREAM_ALL_INSTANCE(INSTANCE) (((INSTANCE) == MDMA_Channel0) || \
                                               ((INSTANCE) == MDMA_Channel1) || \
                                               ((INSTANCE) == MDMA_Channel2) || \
                                               ((INSTANCE) == MDMA_Channel3) || \
                                               ((INSTANCE) == MDMA_Channel4) || \
                                               ((INSTANCE) == MDMA_Channel5) || \
                                               ((INSTANCE) == MDMA_Channel6) || \
                                               ((INSTANCE) == MDMA_Channel7) || \
                                               ((INSTANCE) == MDMA_Channel8) || \
                                               ((INSTANCE) == MDMA_Channel9)  || \
                                               ((INSTANCE) == MDMA_Channel10) || \
                                               ((INSTANCE) == MDMA_Channel11) || \
                                               ((INSTANCE) == MDMA_Channel12) || \
                                               ((INSTANCE) == MDMA_Channel13) || \
                                               ((INSTANCE) == MDMA_Channel14) || \
                                               ((INSTANCE) == MDMA_Channel15) || \
                                               ((INSTANCE) == MDMA_Channel16) || \
                                               ((INSTANCE) == MDMA_Channel17) || \
                                               ((INSTANCE) == MDMA_Channel18) || \
                                               ((INSTANCE) == MDMA_Channel19) || \
                                               ((INSTANCE) == MDMA_Channel20) || \
                                               ((INSTANCE) == MDMA_Channel21) || \
                                               ((INSTANCE) == MDMA_Channel22) || \
                                               ((INSTANCE) == MDMA_Channel23) || \
                                               ((INSTANCE) == MDMA_Channel24) || \
                                               ((INSTANCE) == MDMA_Channel25) || \
                                               ((INSTANCE) == MDMA_Channel26) || \
                                               ((INSTANCE) == MDMA_Channel27) || \
                                               ((INSTANCE) == MDMA_Channel28) || \
                                               ((INSTANCE) == MDMA_Channel29) || \
                                               ((INSTANCE) == MDMA_Channel30) || \
                                               ((INSTANCE) == MDMA_Channel31) || \
                                               ((INSTANCE) == MDMA_Channel32) || \
                                               ((INSTANCE) == MDMA_Channel33) || \
                                               ((INSTANCE) == MDMA_Channel34) || \
                                               ((INSTANCE) == MDMA_Channel35) || \
                                               ((INSTANCE) == MDMA_Channel36) || \
                                               ((INSTANCE) == MDMA_Channel37) || \
                                               ((INSTANCE) == MDMA_Channel38) || \
                                               ((INSTANCE) == MDMA_Channel39) || \
                                               ((INSTANCE) == MDMA_Channel40) || \
                                               ((INSTANCE) == MDMA_Channel41) || \
                                               ((INSTANCE) == MDMA_Channel42) || \
                                               ((INSTANCE) == MDMA_Channel43) || \
                                               ((INSTANCE) == MDMA_Channel44) || \
                                               ((INSTANCE) == MDMA_Channel45) || \
                                               ((INSTANCE) == MDMA_Channel46) || \
                                               ((INSTANCE) == MDMA_Channel47) || \
                                               ((INSTANCE) == MDMA_Channel48) || \
                                               ((INSTANCE) == MDMA_Channel49) || \
                                               ((INSTANCE) == MDMA_Channel50) || \
                                               ((INSTANCE) == MDMA_Channel51) || \
                                               ((INSTANCE) == MDMA_Channel52) || \
                                               ((INSTANCE) == MDMA_Channel53) || \
                                               ((INSTANCE) == MDMA_Channel54) || \
                                               ((INSTANCE) == MDMA_Channel55) || \
                                               ((INSTANCE) == MDMA_Channel56) || \
                                               ((INSTANCE) == MDMA_Channel57) || \
                                               ((INSTANCE) == MDMA_Channel58) || \
                                               ((INSTANCE) == MDMA_Channel59) || \
                                               ((INSTANCE) == MDMA_Channel60) || \
                                               ((INSTANCE) == MDMA_Channel61) || \
                                               ((INSTANCE) == MDMA_Channel62))
																							 
